/* automatically generated by rust-bindgen 0.59.2 */

#[repr(C)]
#[derive(Default)]
pub struct __IncompleteArrayField<T>(::std::marker::PhantomData<T>, [T; 0]);
impl<T> __IncompleteArrayField<T> {
    #[inline]
    pub const fn new() -> Self {
        __IncompleteArrayField(::std::marker::PhantomData, [])
    }
    #[inline]
    pub fn as_ptr(&self) -> *const T {
        self as *const _ as *const T
    }
    #[inline]
    pub fn as_mut_ptr(&mut self) -> *mut T {
        self as *mut _ as *mut T
    }
    #[inline]
    pub unsafe fn as_slice(&self, len: usize) -> &[T] {
        ::std::slice::from_raw_parts(self.as_ptr(), len)
    }
    #[inline]
    pub unsafe fn as_mut_slice(&mut self, len: usize) -> &mut [T] {
        ::std::slice::from_raw_parts_mut(self.as_mut_ptr(), len)
    }
}
impl<T> ::std::fmt::Debug for __IncompleteArrayField<T> {
    fn fmt(&self, fmt: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        fmt.write_str("__IncompleteArrayField")
    }
}
pub const ROOT_UID: u32 = 0;
pub const MAX_MSG_HIST_LEN: u32 = 200;
pub const SESSION_FILE: &[u8; 12usize] = b"Session.vim\0";
pub const SYS_OPTWIN_FILE: &[u8; 23usize] = b"$VIMRUNTIME/optwin.vim\0";
pub const RUNTIME_DIRNAME: &[u8; 8usize] = b"runtime\0";
pub const VIMPACKAGE: &[u8; 4usize] = b"vim\0";
pub const MAXPATHL: u32 = 256;
pub const NUMBUFLEN: u32 = 65;
pub const STR2NR_BIN: u32 = 1;
pub const STR2NR_OCT: u32 = 2;
pub const STR2NR_HEX: u32 = 4;
pub const STR2NR_ALL: u32 = 7;

pub const SREQ_GLOBAL: u32 = 0;
pub const SREQ_WIN: u32 = 1;
pub const SREQ_BUF: u32 = 2;
pub const GREG_NO_EXPR: u32 = 1;
pub const GREG_EXPR_SRC: u32 = 2;
pub const GREG_LIST: u32 = 4;
pub const AUTOLOAD_CHAR: u8 = 35u8;
pub const MAX_OPEN_CHANNELS: u32 = 0;
pub const JSON_JS: u32 = 1;
pub const JSON_NO_NONE: u32 = 2;
pub const JSON_NL: u32 = 4;
pub const DIP_ALL: u32 = 1;
pub const DIP_DIR: u32 = 2;
pub const DIP_ERR: u32 = 4;
pub const DIP_START: u32 = 8;
pub const DIP_OPT: u32 = 16;
pub const DIP_NORTP: u32 = 32;
pub const DIP_NOAFTER: u32 = 64;
pub const DIP_AFTER: u32 = 128;
pub const LOWEST_WIN_ID: u32 = 1000;
pub const COPYID_INC: u32 = 2;
pub const COPYID_MASK: i32 = -2;
pub const TFN_INT: u32 = 1;
pub const TFN_QUIET: u32 = 2;
pub const TFN_NO_AUTOLOAD: u32 = 4;
pub const TFN_NO_DEREF: u32 = 8;
pub const TFN_READ_ONLY: u32 = 16;
pub const GLV_QUIET: u32 = 2;
pub const GLV_NO_AUTOLOAD: u32 = 4;
pub const GLV_READ_ONLY: u32 = 16;
pub const DO_NOT_FREE_CNT: u32 = 99999;
pub const ERROR_UNKNOWN: u32 = 0;
pub const ERROR_TOOMANY: u32 = 1;
pub const ERROR_TOOFEW: u32 = 2;
pub const ERROR_SCRIPT: u32 = 3;
pub const ERROR_DICT: u32 = 4;
pub const ERROR_NONE: u32 = 5;
pub const ERROR_OTHER: u32 = 6;
pub const ERROR_DELETED: u32 = 7;
pub const FNE_INCL_BR: u32 = 1;
pub const FNE_CHECK_START: u32 = 2;
pub const REPLACE_CR_NCHAR: i32 = -1;
pub const REPLACE_NL_NCHAR: i32 = -2;
pub const TERM_START_NOJOB: u32 = 1;
pub const TERM_START_FORCEIT: u32 = 2;
pub const TERM_START_SYSTEM: u32 = 4;
pub const SAVE_RESTORE_TITLE: u32 = 1;
pub const SAVE_RESTORE_ICON: u32 = 2;
pub const SAVE_RESTORE_BOTH: u32 = 3;
pub const APC_SAVE_FOR_UNDO: u32 = 1;
pub const APC_SUBSTITUTE: u32 = 2;
pub type char_u = ::std::os::raw::c_uchar;
pub type short_u = ::std::os::raw::c_ushort;
pub type int_u = ::std::os::raw::c_uint;
pub type long_long_T = ::std::os::raw::c_longlong;
pub type long_long_u_T = ::std::os::raw::c_ulonglong;
pub type long_u = ::std::os::raw::c_ulong;
pub type long_i = ::std::os::raw::c_long;
pub type off_T = ::std::os::raw::c_long;
pub type schar_T = char_u;
pub type sattr_T = ::std::os::raw::c_ushort;
pub type u8char_T = ::std::os::raw::c_uint;
pub type __int8_t = ::std::os::raw::c_schar;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __int16_t = ::std::os::raw::c_short;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __int32_t = ::std::os::raw::c_int;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_longlong;
pub type __uint64_t = ::std::os::raw::c_ulonglong;
pub type __darwin_intptr_t = ::std::os::raw::c_long;
pub type __darwin_natural_t = ::std::os::raw::c_uint;
pub type __darwin_ct_rune_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union __mbstate_t {
    pub __mbstate8: [::std::os::raw::c_char; 128usize],
    pub _mbstateL: ::std::os::raw::c_longlong,
}
#[test]
fn bindgen_test_layout___mbstate_t() {
    assert_eq!(
        ::std::mem::size_of::<__mbstate_t>(),
        128usize,
        concat!("Size of: ", stringify!(__mbstate_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__mbstate_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__mbstate_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__mbstate_t>())).__mbstate8 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t),
            "::",
            stringify!(__mbstate8)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__mbstate_t>()))._mbstateL as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t),
            "::",
            stringify!(_mbstateL)
        )
    );
}
pub type __darwin_mbstate_t = __mbstate_t;
pub type __darwin_ptrdiff_t = ::std::os::raw::c_long;
pub type __darwin_size_t = ::std::os::raw::c_ulong;
pub type __darwin_va_list = __builtin_va_list;
pub type __darwin_wchar_t = ::std::os::raw::c_int;
pub type __darwin_rune_t = __darwin_wchar_t;
pub type __darwin_wint_t = ::std::os::raw::c_int;
pub type __darwin_clock_t = ::std::os::raw::c_ulong;
pub type __darwin_socklen_t = __uint32_t;
pub type __darwin_ssize_t = ::std::os::raw::c_long;
pub type __darwin_time_t = ::std::os::raw::c_long;
pub type __darwin_blkcnt_t = __int64_t;
pub type __darwin_blksize_t = __int32_t;
pub type __darwin_dev_t = __int32_t;
pub type __darwin_fsblkcnt_t = ::std::os::raw::c_uint;
pub type __darwin_fsfilcnt_t = ::std::os::raw::c_uint;
pub type __darwin_gid_t = __uint32_t;
pub type __darwin_id_t = __uint32_t;
pub type __darwin_ino64_t = __uint64_t;
pub type __darwin_ino_t = __darwin_ino64_t;
pub type __darwin_mach_port_name_t = __darwin_natural_t;
pub type __darwin_mach_port_t = __darwin_mach_port_name_t;
pub type __darwin_mode_t = __uint16_t;
pub type __darwin_off_t = __int64_t;
pub type __darwin_pid_t = __int32_t;
pub type __darwin_sigset_t = __uint32_t;
pub type __darwin_suseconds_t = __int32_t;
pub type __darwin_uid_t = __uint32_t;
pub type __darwin_useconds_t = __uint32_t;
pub type __darwin_uuid_t = [::std::os::raw::c_uchar; 16usize];
pub type __darwin_uuid_string_t = [::std::os::raw::c_char; 37usize];
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __darwin_pthread_handler_rec {
    pub __routine: ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>,
    pub __arg: *mut ::std::os::raw::c_void,
    pub __next: *mut __darwin_pthread_handler_rec,
}
#[test]
fn bindgen_test_layout___darwin_pthread_handler_rec() {
    assert_eq!(
        ::std::mem::size_of::<__darwin_pthread_handler_rec>(),
        24usize,
        concat!("Size of: ", stringify!(__darwin_pthread_handler_rec))
    );
    assert_eq!(
        ::std::mem::align_of::<__darwin_pthread_handler_rec>(),
        8usize,
        concat!("Alignment of ", stringify!(__darwin_pthread_handler_rec))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__darwin_pthread_handler_rec>())).__routine as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__darwin_pthread_handler_rec),
            "::",
            stringify!(__routine)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__darwin_pthread_handler_rec>())).__arg as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__darwin_pthread_handler_rec),
            "::",
            stringify!(__arg)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__darwin_pthread_handler_rec>())).__next as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__darwin_pthread_handler_rec),
            "::",
            stringify!(__next)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_attr_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 56usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_attr_t() {
    assert_eq!(
        ::std::mem::size_of::<_opaque_pthread_attr_t>(),
        64usize,
        concat!("Size of: ", stringify!(_opaque_pthread_attr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_opaque_pthread_attr_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_opaque_pthread_attr_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_opaque_pthread_attr_t>())).__sig as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_attr_t),
            "::",
            stringify!(__sig)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_opaque_pthread_attr_t>())).__opaque as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_attr_t),
            "::",
            stringify!(__opaque)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_cond_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 40usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_cond_t() {
    assert_eq!(
        ::std::mem::size_of::<_opaque_pthread_cond_t>(),
        48usize,
        concat!("Size of: ", stringify!(_opaque_pthread_cond_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_opaque_pthread_cond_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_opaque_pthread_cond_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_opaque_pthread_cond_t>())).__sig as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_cond_t),
            "::",
            stringify!(__sig)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_opaque_pthread_cond_t>())).__opaque as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_cond_t),
            "::",
            stringify!(__opaque)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_condattr_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 8usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_condattr_t() {
    assert_eq!(
        ::std::mem::size_of::<_opaque_pthread_condattr_t>(),
        16usize,
        concat!("Size of: ", stringify!(_opaque_pthread_condattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_opaque_pthread_condattr_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_opaque_pthread_condattr_t))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_opaque_pthread_condattr_t>())).__sig as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_condattr_t),
            "::",
            stringify!(__sig)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_opaque_pthread_condattr_t>())).__opaque as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_condattr_t),
            "::",
            stringify!(__opaque)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_mutex_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 56usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_mutex_t() {
    assert_eq!(
        ::std::mem::size_of::<_opaque_pthread_mutex_t>(),
        64usize,
        concat!("Size of: ", stringify!(_opaque_pthread_mutex_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_opaque_pthread_mutex_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_opaque_pthread_mutex_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_opaque_pthread_mutex_t>())).__sig as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_mutex_t),
            "::",
            stringify!(__sig)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_opaque_pthread_mutex_t>())).__opaque as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_mutex_t),
            "::",
            stringify!(__opaque)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_mutexattr_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 8usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_mutexattr_t() {
    assert_eq!(
        ::std::mem::size_of::<_opaque_pthread_mutexattr_t>(),
        16usize,
        concat!("Size of: ", stringify!(_opaque_pthread_mutexattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_opaque_pthread_mutexattr_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_opaque_pthread_mutexattr_t))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_opaque_pthread_mutexattr_t>())).__sig as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_mutexattr_t),
            "::",
            stringify!(__sig)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_opaque_pthread_mutexattr_t>())).__opaque as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_mutexattr_t),
            "::",
            stringify!(__opaque)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_once_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 8usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_once_t() {
    assert_eq!(
        ::std::mem::size_of::<_opaque_pthread_once_t>(),
        16usize,
        concat!("Size of: ", stringify!(_opaque_pthread_once_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_opaque_pthread_once_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_opaque_pthread_once_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_opaque_pthread_once_t>())).__sig as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_once_t),
            "::",
            stringify!(__sig)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_opaque_pthread_once_t>())).__opaque as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_once_t),
            "::",
            stringify!(__opaque)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_rwlock_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 192usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_rwlock_t() {
    assert_eq!(
        ::std::mem::size_of::<_opaque_pthread_rwlock_t>(),
        200usize,
        concat!("Size of: ", stringify!(_opaque_pthread_rwlock_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_opaque_pthread_rwlock_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_opaque_pthread_rwlock_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_opaque_pthread_rwlock_t>())).__sig as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_rwlock_t),
            "::",
            stringify!(__sig)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_opaque_pthread_rwlock_t>())).__opaque as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_rwlock_t),
            "::",
            stringify!(__opaque)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_rwlockattr_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 16usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_rwlockattr_t() {
    assert_eq!(
        ::std::mem::size_of::<_opaque_pthread_rwlockattr_t>(),
        24usize,
        concat!("Size of: ", stringify!(_opaque_pthread_rwlockattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_opaque_pthread_rwlockattr_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_opaque_pthread_rwlockattr_t))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_opaque_pthread_rwlockattr_t>())).__sig as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_rwlockattr_t),
            "::",
            stringify!(__sig)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_opaque_pthread_rwlockattr_t>())).__opaque as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_rwlockattr_t),
            "::",
            stringify!(__opaque)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_t {
    pub __sig: ::std::os::raw::c_long,
    pub __cleanup_stack: *mut __darwin_pthread_handler_rec,
    pub __opaque: [::std::os::raw::c_char; 8176usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_t() {
    assert_eq!(
        ::std::mem::size_of::<_opaque_pthread_t>(),
        8192usize,
        concat!("Size of: ", stringify!(_opaque_pthread_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_opaque_pthread_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_opaque_pthread_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_opaque_pthread_t>())).__sig as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_t),
            "::",
            stringify!(__sig)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_opaque_pthread_t>())).__cleanup_stack as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_t),
            "::",
            stringify!(__cleanup_stack)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_opaque_pthread_t>())).__opaque as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_t),
            "::",
            stringify!(__opaque)
        )
    );
}
pub type __darwin_pthread_attr_t = _opaque_pthread_attr_t;
pub type __darwin_pthread_cond_t = _opaque_pthread_cond_t;
pub type __darwin_pthread_condattr_t = _opaque_pthread_condattr_t;
pub type __darwin_pthread_key_t = ::std::os::raw::c_ulong;
pub type __darwin_pthread_mutex_t = _opaque_pthread_mutex_t;
pub type __darwin_pthread_mutexattr_t = _opaque_pthread_mutexattr_t;
pub type __darwin_pthread_once_t = _opaque_pthread_once_t;
pub type __darwin_pthread_rwlock_t = _opaque_pthread_rwlock_t;
pub type __darwin_pthread_rwlockattr_t = _opaque_pthread_rwlockattr_t;
pub type __darwin_pthread_t = *mut _opaque_pthread_t;
pub type __darwin_nl_item = ::std::os::raw::c_int;
pub type __darwin_wctrans_t = ::std::os::raw::c_int;
pub type __darwin_wctype_t = __uint32_t;
pub type size_t = __darwin_size_t;
pub type ct_rune_t = __darwin_ct_rune_t;
pub type rune_t = __darwin_rune_t;
pub type wchar_t = __darwin_wchar_t;
pub type wint_t = __darwin_wint_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _RuneEntry {
    pub __min: __darwin_rune_t,
    pub __max: __darwin_rune_t,
    pub __map: __darwin_rune_t,
    pub __types: *mut __uint32_t,
}
#[test]
fn bindgen_test_layout__RuneEntry() {
    assert_eq!(
        ::std::mem::size_of::<_RuneEntry>(),
        24usize,
        concat!("Size of: ", stringify!(_RuneEntry))
    );
    assert_eq!(
        ::std::mem::align_of::<_RuneEntry>(),
        8usize,
        concat!("Alignment of ", stringify!(_RuneEntry))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_RuneEntry>())).__min as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_RuneEntry),
            "::",
            stringify!(__min)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_RuneEntry>())).__max as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_RuneEntry),
            "::",
            stringify!(__max)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_RuneEntry>())).__map as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_RuneEntry),
            "::",
            stringify!(__map)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_RuneEntry>())).__types as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_RuneEntry),
            "::",
            stringify!(__types)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _RuneRange {
    pub __nranges: ::std::os::raw::c_int,
    pub __ranges: *mut _RuneEntry,
}
#[test]
fn bindgen_test_layout__RuneRange() {
    assert_eq!(
        ::std::mem::size_of::<_RuneRange>(),
        16usize,
        concat!("Size of: ", stringify!(_RuneRange))
    );
    assert_eq!(
        ::std::mem::align_of::<_RuneRange>(),
        8usize,
        concat!("Alignment of ", stringify!(_RuneRange))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_RuneRange>())).__nranges as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_RuneRange),
            "::",
            stringify!(__nranges)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_RuneRange>())).__ranges as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_RuneRange),
            "::",
            stringify!(__ranges)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _RuneCharClass {
    pub __name: [::std::os::raw::c_char; 14usize],
    pub __mask: __uint32_t,
}
#[test]
fn bindgen_test_layout__RuneCharClass() {
    assert_eq!(
        ::std::mem::size_of::<_RuneCharClass>(),
        20usize,
        concat!("Size of: ", stringify!(_RuneCharClass))
    );
    assert_eq!(
        ::std::mem::align_of::<_RuneCharClass>(),
        4usize,
        concat!("Alignment of ", stringify!(_RuneCharClass))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_RuneCharClass>())).__name as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_RuneCharClass),
            "::",
            stringify!(__name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_RuneCharClass>())).__mask as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_RuneCharClass),
            "::",
            stringify!(__mask)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _RuneLocale {
    pub __magic: [::std::os::raw::c_char; 8usize],
    pub __encoding: [::std::os::raw::c_char; 32usize],
    pub __sgetrune: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *const ::std::os::raw::c_char,
            arg2: __darwin_size_t,
            arg3: *mut *const ::std::os::raw::c_char,
        ) -> __darwin_rune_t,
    >,
    pub __sputrune: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: __darwin_rune_t,
            arg2: *mut ::std::os::raw::c_char,
            arg3: __darwin_size_t,
            arg4: *mut *mut ::std::os::raw::c_char,
        ) -> ::std::os::raw::c_int,
    >,
    pub __invalid_rune: __darwin_rune_t,
    pub __runetype: [__uint32_t; 256usize],
    pub __maplower: [__darwin_rune_t; 256usize],
    pub __mapupper: [__darwin_rune_t; 256usize],
    pub __runetype_ext: _RuneRange,
    pub __maplower_ext: _RuneRange,
    pub __mapupper_ext: _RuneRange,
    pub __variable: *mut ::std::os::raw::c_void,
    pub __variable_len: ::std::os::raw::c_int,
    pub __ncharclasses: ::std::os::raw::c_int,
    pub __charclasses: *mut _RuneCharClass,
}
#[test]
fn bindgen_test_layout__RuneLocale() {
    assert_eq!(
        ::std::mem::size_of::<_RuneLocale>(),
        3208usize,
        concat!("Size of: ", stringify!(_RuneLocale))
    );
    assert_eq!(
        ::std::mem::align_of::<_RuneLocale>(),
        8usize,
        concat!("Alignment of ", stringify!(_RuneLocale))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_RuneLocale>())).__magic as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_RuneLocale),
            "::",
            stringify!(__magic)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_RuneLocale>())).__encoding as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_RuneLocale),
            "::",
            stringify!(__encoding)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_RuneLocale>())).__sgetrune as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_RuneLocale),
            "::",
            stringify!(__sgetrune)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_RuneLocale>())).__sputrune as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_RuneLocale),
            "::",
            stringify!(__sputrune)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_RuneLocale>())).__invalid_rune as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(_RuneLocale),
            "::",
            stringify!(__invalid_rune)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_RuneLocale>())).__runetype as *const _ as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(_RuneLocale),
            "::",
            stringify!(__runetype)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_RuneLocale>())).__maplower as *const _ as usize },
        1084usize,
        concat!(
            "Offset of field: ",
            stringify!(_RuneLocale),
            "::",
            stringify!(__maplower)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_RuneLocale>())).__mapupper as *const _ as usize },
        2108usize,
        concat!(
            "Offset of field: ",
            stringify!(_RuneLocale),
            "::",
            stringify!(__mapupper)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_RuneLocale>())).__runetype_ext as *const _ as usize },
        3136usize,
        concat!(
            "Offset of field: ",
            stringify!(_RuneLocale),
            "::",
            stringify!(__runetype_ext)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_RuneLocale>())).__maplower_ext as *const _ as usize },
        3152usize,
        concat!(
            "Offset of field: ",
            stringify!(_RuneLocale),
            "::",
            stringify!(__maplower_ext)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_RuneLocale>())).__mapupper_ext as *const _ as usize },
        3168usize,
        concat!(
            "Offset of field: ",
            stringify!(_RuneLocale),
            "::",
            stringify!(__mapupper_ext)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_RuneLocale>())).__variable as *const _ as usize },
        3184usize,
        concat!(
            "Offset of field: ",
            stringify!(_RuneLocale),
            "::",
            stringify!(__variable)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_RuneLocale>())).__variable_len as *const _ as usize },
        3192usize,
        concat!(
            "Offset of field: ",
            stringify!(_RuneLocale),
            "::",
            stringify!(__variable_len)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_RuneLocale>())).__ncharclasses as *const _ as usize },
        3196usize,
        concat!(
            "Offset of field: ",
            stringify!(_RuneLocale),
            "::",
            stringify!(__ncharclasses)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_RuneLocale>())).__charclasses as *const _ as usize },
        3200usize,
        concat!(
            "Offset of field: ",
            stringify!(_RuneLocale),
            "::",
            stringify!(__charclasses)
        )
    );
}
extern "C" {
    pub static mut _DefaultRuneLocale: _RuneLocale;
}
extern "C" {
    pub static mut _CurrentRuneLocale: *mut _RuneLocale;
}
extern "C" {
    pub fn ___runetype(arg1: __darwin_ct_rune_t) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn ___tolower(arg1: __darwin_ct_rune_t) -> __darwin_ct_rune_t;
}
extern "C" {
    pub fn ___toupper(arg1: __darwin_ct_rune_t) -> __darwin_ct_rune_t;
}
extern "C" {
    pub fn __maskrune(
        arg1: __darwin_ct_rune_t,
        arg2: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __toupper(arg1: __darwin_ct_rune_t) -> __darwin_ct_rune_t;
}
extern "C" {
    pub fn __tolower(arg1: __darwin_ct_rune_t) -> __darwin_ct_rune_t;
}
pub type u_int8_t = ::std::os::raw::c_uchar;
pub type u_int16_t = ::std::os::raw::c_ushort;
pub type u_int32_t = ::std::os::raw::c_uint;
pub type u_int64_t = ::std::os::raw::c_ulonglong;
pub type register_t = i64;
pub type user_addr_t = u_int64_t;
pub type user_size_t = u_int64_t;
pub type user_ssize_t = i64;
pub type user_long_t = i64;
pub type user_ulong_t = u_int64_t;
pub type user_time_t = i64;
pub type user_off_t = i64;
pub type syscall_arg_t = u_int64_t;
pub type va_list = __darwin_va_list;
extern "C" {
    pub fn renameat(
        arg1: ::std::os::raw::c_int,
        arg2: *const ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_int,
        arg4: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn renamex_np(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn renameatx_np(
        arg1: ::std::os::raw::c_int,
        arg2: *const ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_int,
        arg4: *const ::std::os::raw::c_char,
        arg5: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
pub type fpos_t = __darwin_off_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __sbuf {
    pub _base: *mut ::std::os::raw::c_uchar,
    pub _size: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout___sbuf() {
    assert_eq!(
        ::std::mem::size_of::<__sbuf>(),
        16usize,
        concat!("Size of: ", stringify!(__sbuf))
    );
    assert_eq!(
        ::std::mem::align_of::<__sbuf>(),
        8usize,
        concat!("Alignment of ", stringify!(__sbuf))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__sbuf>()))._base as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__sbuf),
            "::",
            stringify!(_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__sbuf>()))._size as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__sbuf),
            "::",
            stringify!(_size)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __sFILEX {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __sFILE {
    pub _p: *mut ::std::os::raw::c_uchar,
    pub _r: ::std::os::raw::c_int,
    pub _w: ::std::os::raw::c_int,
    pub _flags: ::std::os::raw::c_short,
    pub _file: ::std::os::raw::c_short,
    pub _bf: __sbuf,
    pub _lbfsize: ::std::os::raw::c_int,
    pub _cookie: *mut ::std::os::raw::c_void,
    pub _close: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_int,
    >,
    pub _read: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ::std::os::raw::c_void,
            arg2: *mut ::std::os::raw::c_char,
            arg3: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    pub _seek: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ::std::os::raw::c_void,
            arg2: fpos_t,
            arg3: ::std::os::raw::c_int,
        ) -> fpos_t,
    >,
    pub _write: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ::std::os::raw::c_void,
            arg2: *const ::std::os::raw::c_char,
            arg3: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    pub _ub: __sbuf,
    pub _extra: *mut __sFILEX,
    pub _ur: ::std::os::raw::c_int,
    pub _ubuf: [::std::os::raw::c_uchar; 3usize],
    pub _nbuf: [::std::os::raw::c_uchar; 1usize],
    pub _lb: __sbuf,
    pub _blksize: ::std::os::raw::c_int,
    pub _offset: fpos_t,
}
#[test]
fn bindgen_test_layout___sFILE() {
    assert_eq!(
        ::std::mem::size_of::<__sFILE>(),
        152usize,
        concat!("Size of: ", stringify!(__sFILE))
    );
    assert_eq!(
        ::std::mem::align_of::<__sFILE>(),
        8usize,
        concat!("Alignment of ", stringify!(__sFILE))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__sFILE>()))._p as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_p)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__sFILE>()))._r as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_r)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__sFILE>()))._w as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_w)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__sFILE>()))._flags as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__sFILE>()))._file as *const _ as usize },
        18usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_file)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__sFILE>()))._bf as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_bf)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__sFILE>()))._lbfsize as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_lbfsize)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__sFILE>()))._cookie as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_cookie)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__sFILE>()))._close as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_close)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__sFILE>()))._read as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_read)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__sFILE>()))._seek as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_seek)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__sFILE>()))._write as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_write)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__sFILE>()))._ub as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_ub)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__sFILE>()))._extra as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_extra)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__sFILE>()))._ur as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_ur)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__sFILE>()))._ubuf as *const _ as usize },
        116usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_ubuf)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__sFILE>()))._nbuf as *const _ as usize },
        119usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_nbuf)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__sFILE>()))._lb as *const _ as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_lb)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__sFILE>()))._blksize as *const _ as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_blksize)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__sFILE>()))._offset as *const _ as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_offset)
        )
    );
}
pub type FILE = __sFILE;
extern "C" {
    pub static mut __stdinp: *mut FILE;
}
extern "C" {
    pub static mut __stdoutp: *mut FILE;
}
extern "C" {
    pub static mut __stderrp: *mut FILE;
}
extern "C" {
    pub fn clearerr(arg1: *mut FILE);
}
extern "C" {
    pub fn fclose(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn feof(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ferror(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fflush(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fgetc(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fgetpos(arg1: *mut FILE, arg2: *mut fpos_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fgets(
        arg1: *mut ::std::os::raw::c_char,
        arg2: ::std::os::raw::c_int,
        arg3: *mut FILE,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn fopen(
        __filename: *const ::std::os::raw::c_char,
        __mode: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
extern "C" {
    pub fn fprintf(
        arg1: *mut FILE,
        arg2: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fputc(arg1: ::std::os::raw::c_int, arg2: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fputs(arg1: *const ::std::os::raw::c_char, arg2: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fread(
        __ptr: *mut ::std::os::raw::c_void,
        __size: ::std::os::raw::c_ulong,
        __nitems: ::std::os::raw::c_ulong,
        __stream: *mut FILE,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn freopen(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut FILE,
    ) -> *mut FILE;
}
extern "C" {
    pub fn fscanf(
        arg1: *mut FILE,
        arg2: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fseek(
        arg1: *mut FILE,
        arg2: ::std::os::raw::c_long,
        arg3: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fsetpos(arg1: *mut FILE, arg2: *const fpos_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ftell(arg1: *mut FILE) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn fwrite(
        __ptr: *const ::std::os::raw::c_void,
        __size: ::std::os::raw::c_ulong,
        __nitems: ::std::os::raw::c_ulong,
        __stream: *mut FILE,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn getc(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getchar() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gets(arg1: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn perror(arg1: *const ::std::os::raw::c_char);
}
extern "C" {
    pub fn printf(arg1: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putc(arg1: ::std::os::raw::c_int, arg2: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putchar(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn puts(arg1: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn remove(arg1: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rename(
        __old: *const ::std::os::raw::c_char,
        __new: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rewind(arg1: *mut FILE);
}
extern "C" {
    pub fn scanf(arg1: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setbuf(arg1: *mut FILE, arg2: *mut ::std::os::raw::c_char);
}
extern "C" {
    pub fn setvbuf(
        arg1: *mut FILE,
        arg2: *mut ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_int,
        arg4: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn sprintf(
        arg1: *mut ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn sscanf(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn tmpfile() -> *mut FILE;
}
extern "C" {
    pub fn tmpnam(arg1: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn ungetc(arg1: ::std::os::raw::c_int, arg2: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vfprintf(
        arg1: *mut FILE,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vprintf(
        arg1: *const ::std::os::raw::c_char,
        arg2: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vsprintf(
        arg1: *mut ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ctermid(arg1: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn fdopen(arg1: ::std::os::raw::c_int, arg2: *const ::std::os::raw::c_char) -> *mut FILE;
}
extern "C" {
    pub fn fileno(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pclose(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn popen(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
extern "C" {
    pub fn __srget(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __svfscanf(
        arg1: *mut FILE,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __swbuf(arg1: ::std::os::raw::c_int, arg2: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn flockfile(arg1: *mut FILE);
}
extern "C" {
    pub fn ftrylockfile(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn funlockfile(arg1: *mut FILE);
}
extern "C" {
    pub fn getc_unlocked(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getchar_unlocked() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putc_unlocked(arg1: ::std::os::raw::c_int, arg2: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putchar_unlocked(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getw(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putw(arg1: ::std::os::raw::c_int, arg2: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn tempnam(
        __dir: *const ::std::os::raw::c_char,
        __prefix: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
pub type off_t = __darwin_off_t;
extern "C" {
    pub fn fseeko(
        __stream: *mut FILE,
        __offset: off_t,
        __whence: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ftello(__stream: *mut FILE) -> off_t;
}
extern "C" {
    pub fn snprintf(
        __str: *mut ::std::os::raw::c_char,
        __size: ::std::os::raw::c_ulong,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vfscanf(
        __stream: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        arg1: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vscanf(
        __format: *const ::std::os::raw::c_char,
        arg1: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vsnprintf(
        __str: *mut ::std::os::raw::c_char,
        __size: ::std::os::raw::c_ulong,
        __format: *const ::std::os::raw::c_char,
        arg1: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vsscanf(
        __str: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        arg1: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
pub type ssize_t = __darwin_ssize_t;
extern "C" {
    pub fn dprintf(
        arg1: ::std::os::raw::c_int,
        arg2: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vdprintf(
        arg1: ::std::os::raw::c_int,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getdelim(
        __linep: *mut *mut ::std::os::raw::c_char,
        __linecapp: *mut size_t,
        __delimiter: ::std::os::raw::c_int,
        __stream: *mut FILE,
    ) -> ssize_t;
}
extern "C" {
    pub fn getline(
        __linep: *mut *mut ::std::os::raw::c_char,
        __linecapp: *mut size_t,
        __stream: *mut FILE,
    ) -> ssize_t;
}
extern "C" {
    pub fn fmemopen(
        __buf: *mut ::std::os::raw::c_void,
        __size: size_t,
        __mode: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
extern "C" {
    pub fn open_memstream(
        __bufp: *mut *mut ::std::os::raw::c_char,
        __sizep: *mut size_t,
    ) -> *mut FILE;
}
extern "C" {
    pub static sys_nerr: ::std::os::raw::c_int;
}
extern "C" {
    pub static mut sys_errlist: [*const ::std::os::raw::c_char; 0usize];
}
extern "C" {
    pub fn asprintf(
        arg1: *mut *mut ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ctermid_r(arg1: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn fgetln(arg1: *mut FILE, arg2: *mut size_t) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn fmtcheck(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn fpurge(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setbuffer(
        arg1: *mut FILE,
        arg2: *mut ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn setlinebuf(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vasprintf(
        arg1: *mut *mut ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn zopen(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_int,
    ) -> *mut FILE;
}
extern "C" {
    pub fn funopen(
        arg1: *const ::std::os::raw::c_void,
        arg2: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: *mut ::std::os::raw::c_void,
                arg2: *mut ::std::os::raw::c_char,
                arg3: ::std::os::raw::c_int,
            ) -> ::std::os::raw::c_int,
        >,
        arg3: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: *mut ::std::os::raw::c_void,
                arg2: *const ::std::os::raw::c_char,
                arg3: ::std::os::raw::c_int,
            ) -> ::std::os::raw::c_int,
        >,
        arg4: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: *mut ::std::os::raw::c_void,
                arg2: fpos_t,
                arg3: ::std::os::raw::c_int,
            ) -> fpos_t,
        >,
        arg5: ::std::option::Option<
            unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_int,
        >,
    ) -> *mut FILE;
}
extern "C" {
    pub fn __sprintf_chk(
        arg1: *mut ::std::os::raw::c_char,
        arg2: ::std::os::raw::c_int,
        arg3: size_t,
        arg4: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __snprintf_chk(
        arg1: *mut ::std::os::raw::c_char,
        arg2: size_t,
        arg3: ::std::os::raw::c_int,
        arg4: size_t,
        arg5: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __vsprintf_chk(
        arg1: *mut ::std::os::raw::c_char,
        arg2: ::std::os::raw::c_int,
        arg3: size_t,
        arg4: *const ::std::os::raw::c_char,
        arg5: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __vsnprintf_chk(
        arg1: *mut ::std::os::raw::c_char,
        arg2: size_t,
        arg3: ::std::os::raw::c_int,
        arg4: size_t,
        arg5: *const ::std::os::raw::c_char,
        arg6: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
pub const key_extra_KE_NAME: key_extra = 3;
pub const key_extra_KE_S_UP: key_extra = 4;
pub const key_extra_KE_S_DOWN: key_extra = 5;
pub const key_extra_KE_S_F1: key_extra = 6;
pub const key_extra_KE_S_F2: key_extra = 7;
pub const key_extra_KE_S_F3: key_extra = 8;
pub const key_extra_KE_S_F4: key_extra = 9;
pub const key_extra_KE_S_F5: key_extra = 10;
pub const key_extra_KE_S_F6: key_extra = 11;
pub const key_extra_KE_S_F7: key_extra = 12;
pub const key_extra_KE_S_F8: key_extra = 13;
pub const key_extra_KE_S_F9: key_extra = 14;
pub const key_extra_KE_S_F10: key_extra = 15;
pub const key_extra_KE_S_F11: key_extra = 16;
pub const key_extra_KE_S_F12: key_extra = 17;
pub const key_extra_KE_S_F13: key_extra = 18;
pub const key_extra_KE_S_F14: key_extra = 19;
pub const key_extra_KE_S_F15: key_extra = 20;
pub const key_extra_KE_S_F16: key_extra = 21;
pub const key_extra_KE_S_F17: key_extra = 22;
pub const key_extra_KE_S_F18: key_extra = 23;
pub const key_extra_KE_S_F19: key_extra = 24;
pub const key_extra_KE_S_F20: key_extra = 25;
pub const key_extra_KE_S_F21: key_extra = 26;
pub const key_extra_KE_S_F22: key_extra = 27;
pub const key_extra_KE_S_F23: key_extra = 28;
pub const key_extra_KE_S_F24: key_extra = 29;
pub const key_extra_KE_S_F25: key_extra = 30;
pub const key_extra_KE_S_F26: key_extra = 31;
pub const key_extra_KE_S_F27: key_extra = 32;
pub const key_extra_KE_S_F28: key_extra = 33;
pub const key_extra_KE_S_F29: key_extra = 34;
pub const key_extra_KE_S_F30: key_extra = 35;
pub const key_extra_KE_S_F31: key_extra = 36;
pub const key_extra_KE_S_F32: key_extra = 37;
pub const key_extra_KE_S_F33: key_extra = 38;
pub const key_extra_KE_S_F34: key_extra = 39;
pub const key_extra_KE_S_F35: key_extra = 40;
pub const key_extra_KE_S_F36: key_extra = 41;
pub const key_extra_KE_S_F37: key_extra = 42;
pub const key_extra_KE_MOUSE: key_extra = 43;
pub const key_extra_KE_LEFTMOUSE: key_extra = 44;
pub const key_extra_KE_LEFTDRAG: key_extra = 45;
pub const key_extra_KE_LEFTRELEASE: key_extra = 46;
pub const key_extra_KE_MIDDLEMOUSE: key_extra = 47;
pub const key_extra_KE_MIDDLEDRAG: key_extra = 48;
pub const key_extra_KE_MIDDLERELEASE: key_extra = 49;
pub const key_extra_KE_RIGHTMOUSE: key_extra = 50;
pub const key_extra_KE_RIGHTDRAG: key_extra = 51;
pub const key_extra_KE_RIGHTRELEASE: key_extra = 52;
pub const key_extra_KE_IGNORE: key_extra = 53;
pub const key_extra_KE_TAB: key_extra = 54;
pub const key_extra_KE_S_TAB_OLD: key_extra = 55;
pub const key_extra_KE_SNIFF_UNUSED: key_extra = 56;
pub const key_extra_KE_XF1: key_extra = 57;
pub const key_extra_KE_XF2: key_extra = 58;
pub const key_extra_KE_XF3: key_extra = 59;
pub const key_extra_KE_XF4: key_extra = 60;
pub const key_extra_KE_XEND: key_extra = 61;
pub const key_extra_KE_ZEND: key_extra = 62;
pub const key_extra_KE_XHOME: key_extra = 63;
pub const key_extra_KE_ZHOME: key_extra = 64;
pub const key_extra_KE_XUP: key_extra = 65;
pub const key_extra_KE_XDOWN: key_extra = 66;
pub const key_extra_KE_XLEFT: key_extra = 67;
pub const key_extra_KE_XRIGHT: key_extra = 68;
pub const key_extra_KE_LEFTMOUSE_NM: key_extra = 69;
pub const key_extra_KE_LEFTRELEASE_NM: key_extra = 70;
pub const key_extra_KE_S_XF1: key_extra = 71;
pub const key_extra_KE_S_XF2: key_extra = 72;
pub const key_extra_KE_S_XF3: key_extra = 73;
pub const key_extra_KE_S_XF4: key_extra = 74;
pub const key_extra_KE_MOUSEDOWN: key_extra = 75;
pub const key_extra_KE_MOUSEUP: key_extra = 76;
pub const key_extra_KE_MOUSELEFT: key_extra = 77;
pub const key_extra_KE_MOUSERIGHT: key_extra = 78;
pub const key_extra_KE_KINS: key_extra = 79;
pub const key_extra_KE_KDEL: key_extra = 80;
pub const key_extra_KE_CSI: key_extra = 81;
pub const key_extra_KE_SNR: key_extra = 82;
pub const key_extra_KE_PLUG: key_extra = 83;
pub const key_extra_KE_CMDWIN: key_extra = 84;
pub const key_extra_KE_C_LEFT: key_extra = 85;
pub const key_extra_KE_C_RIGHT: key_extra = 86;
pub const key_extra_KE_C_HOME: key_extra = 87;
pub const key_extra_KE_C_END: key_extra = 88;
pub const key_extra_KE_X1MOUSE: key_extra = 89;
pub const key_extra_KE_X1DRAG: key_extra = 90;
pub const key_extra_KE_X1RELEASE: key_extra = 91;
pub const key_extra_KE_X2MOUSE: key_extra = 92;
pub const key_extra_KE_X2DRAG: key_extra = 93;
pub const key_extra_KE_X2RELEASE: key_extra = 94;
pub const key_extra_KE_DROP: key_extra = 95;
pub const key_extra_KE_CURSORHOLD: key_extra = 96;
pub const key_extra_KE_NOP: key_extra = 97;
pub const key_extra_KE_FOCUSGAINED: key_extra = 98;
pub const key_extra_KE_FOCUSLOST: key_extra = 99;
pub const key_extra_KE_MOUSEMOVE: key_extra = 100;
pub const key_extra_KE_CANCEL: key_extra = 101;
pub type key_extra = ::std::os::raw::c_uint;
pub const SpecialKey_KS_NAME: SpecialKey = 0;
pub const SpecialKey_KS_CE: SpecialKey = 1;
pub const SpecialKey_KS_AL: SpecialKey = 2;
pub const SpecialKey_KS_CAL: SpecialKey = 3;
pub const SpecialKey_KS_DL: SpecialKey = 4;
pub const SpecialKey_KS_CDL: SpecialKey = 5;
pub const SpecialKey_KS_CS: SpecialKey = 6;
pub const SpecialKey_KS_CL: SpecialKey = 7;
pub const SpecialKey_KS_CD: SpecialKey = 8;
pub const SpecialKey_KS_UT: SpecialKey = 9;
pub const SpecialKey_KS_DA: SpecialKey = 10;
pub const SpecialKey_KS_DB: SpecialKey = 11;
pub const SpecialKey_KS_VI: SpecialKey = 12;
pub const SpecialKey_KS_VE: SpecialKey = 13;
pub const SpecialKey_KS_VS: SpecialKey = 14;
pub const SpecialKey_KS_CVS: SpecialKey = 15;
pub const SpecialKey_KS_CSH: SpecialKey = 16;
pub const SpecialKey_KS_CRC: SpecialKey = 17;
pub const SpecialKey_KS_CRS: SpecialKey = 18;
pub const SpecialKey_KS_ME: SpecialKey = 19;
pub const SpecialKey_KS_MR: SpecialKey = 20;
pub const SpecialKey_KS_MD: SpecialKey = 21;
pub const SpecialKey_KS_SE: SpecialKey = 22;
pub const SpecialKey_KS_SO: SpecialKey = 23;
pub const SpecialKey_KS_CZH: SpecialKey = 24;
pub const SpecialKey_KS_CZR: SpecialKey = 25;
pub const SpecialKey_KS_UE: SpecialKey = 26;
pub const SpecialKey_KS_US: SpecialKey = 27;
pub const SpecialKey_KS_UCE: SpecialKey = 28;
pub const SpecialKey_KS_UCS: SpecialKey = 29;
pub const SpecialKey_KS_STE: SpecialKey = 30;
pub const SpecialKey_KS_STS: SpecialKey = 31;
pub const SpecialKey_KS_MS: SpecialKey = 32;
pub const SpecialKey_KS_CM: SpecialKey = 33;
pub const SpecialKey_KS_SR: SpecialKey = 34;
pub const SpecialKey_KS_CRI: SpecialKey = 35;
pub const SpecialKey_KS_VB: SpecialKey = 36;
pub const SpecialKey_KS_KS: SpecialKey = 37;
pub const SpecialKey_KS_KE: SpecialKey = 38;
pub const SpecialKey_KS_TI: SpecialKey = 39;
pub const SpecialKey_KS_TE: SpecialKey = 40;
pub const SpecialKey_KS_BC: SpecialKey = 41;
pub const SpecialKey_KS_CCS: SpecialKey = 42;
pub const SpecialKey_KS_CCO: SpecialKey = 43;
pub const SpecialKey_KS_CSF: SpecialKey = 44;
pub const SpecialKey_KS_CSB: SpecialKey = 45;
pub const SpecialKey_KS_XS: SpecialKey = 46;
pub const SpecialKey_KS_XN: SpecialKey = 47;
pub const SpecialKey_KS_MB: SpecialKey = 48;
pub const SpecialKey_KS_CAF: SpecialKey = 49;
pub const SpecialKey_KS_CAB: SpecialKey = 50;
pub const SpecialKey_KS_LE: SpecialKey = 51;
pub const SpecialKey_KS_ND: SpecialKey = 52;
pub const SpecialKey_KS_CIS: SpecialKey = 53;
pub const SpecialKey_KS_CIE: SpecialKey = 54;
pub const SpecialKey_KS_CSC: SpecialKey = 55;
pub const SpecialKey_KS_CEC: SpecialKey = 56;
pub const SpecialKey_KS_TS: SpecialKey = 57;
pub const SpecialKey_KS_FS: SpecialKey = 58;
pub const SpecialKey_KS_CWP: SpecialKey = 59;
pub const SpecialKey_KS_CGP: SpecialKey = 60;
pub const SpecialKey_KS_CWS: SpecialKey = 61;
pub const SpecialKey_KS_CRV: SpecialKey = 62;
pub const SpecialKey_KS_RFG: SpecialKey = 63;
pub const SpecialKey_KS_RBG: SpecialKey = 64;
pub const SpecialKey_KS_CSI: SpecialKey = 65;
pub const SpecialKey_KS_CEI: SpecialKey = 66;
pub const SpecialKey_KS_CSR: SpecialKey = 67;
pub const SpecialKey_KS_CSV: SpecialKey = 68;
pub const SpecialKey_KS_OP: SpecialKey = 69;
pub const SpecialKey_KS_U7: SpecialKey = 70;
pub const SpecialKey_KS_8F: SpecialKey = 71;
pub const SpecialKey_KS_8B: SpecialKey = 72;
pub const SpecialKey_KS_CBE: SpecialKey = 73;
pub const SpecialKey_KS_CBD: SpecialKey = 74;
pub const SpecialKey_KS_CPS: SpecialKey = 75;
pub const SpecialKey_KS_CPE: SpecialKey = 76;
pub const SpecialKey_KS_CST: SpecialKey = 77;
pub const SpecialKey_KS_CRT: SpecialKey = 78;
pub const SpecialKey_KS_SSI: SpecialKey = 79;
pub const SpecialKey_KS_SRI: SpecialKey = 80;
pub type SpecialKey = ::std::os::raw::c_uint;
extern "C" {
    pub static mut term_strings: [*mut char_u; 0usize];
}
extern "C" {
    pub fn __assert_rtn(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_int,
        arg4: *const ::std::os::raw::c_char,
    );
}
pub type __gnuc_va_list = __builtin_va_list;
pub type rsize_t = ::std::os::raw::c_ulong;
pub type max_align_t = u128;
pub const btype_T_BVAL_NR: btype_T = 0;
pub const btype_T_BVAL_STRING: btype_T = 1;
pub const btype_T_BVAL_EMPTY: btype_T = 2;
pub type btype_T = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct bval_T {
    pub bv_type: btype_T,
    pub bv_nr: ::std::os::raw::c_long,
    pub bv_string: *mut char_u,
    pub bv_len: ::std::os::raw::c_int,
    pub bv_allocated: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_bval_T() {
    assert_eq!(
        ::std::mem::size_of::<bval_T>(),
        32usize,
        concat!("Size of: ", stringify!(bval_T))
    );
    assert_eq!(
        ::std::mem::align_of::<bval_T>(),
        8usize,
        concat!("Alignment of ", stringify!(bval_T))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<bval_T>())).bv_type as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bval_T),
            "::",
            stringify!(bv_type)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<bval_T>())).bv_nr as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(bval_T),
            "::",
            stringify!(bv_nr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<bval_T>())).bv_string as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(bval_T),
            "::",
            stringify!(bv_string)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<bval_T>())).bv_len as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(bval_T),
            "::",
            stringify!(bv_len)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<bval_T>())).bv_allocated as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(bval_T),
            "::",
            stringify!(bv_allocated)
        )
    );
}
pub const auto_event_EVENT_BUFADD: auto_event = 0;
pub const auto_event_EVENT_BUFDELETE: auto_event = 1;
pub const auto_event_EVENT_BUFENTER: auto_event = 2;
pub const auto_event_EVENT_BUFFILEPOST: auto_event = 3;
pub const auto_event_EVENT_BUFFILEPRE: auto_event = 4;
pub const auto_event_EVENT_BUFHIDDEN: auto_event = 5;
pub const auto_event_EVENT_BUFLEAVE: auto_event = 6;
pub const auto_event_EVENT_BUFNEW: auto_event = 7;
pub const auto_event_EVENT_BUFNEWFILE: auto_event = 8;
pub const auto_event_EVENT_BUFREADCMD: auto_event = 9;
pub const auto_event_EVENT_BUFREADPOST: auto_event = 10;
pub const auto_event_EVENT_BUFREADPRE: auto_event = 11;
pub const auto_event_EVENT_BUFUNLOAD: auto_event = 12;
pub const auto_event_EVENT_BUFWINENTER: auto_event = 13;
pub const auto_event_EVENT_BUFWINLEAVE: auto_event = 14;
pub const auto_event_EVENT_BUFWIPEOUT: auto_event = 15;
pub const auto_event_EVENT_BUFWRITECMD: auto_event = 16;
pub const auto_event_EVENT_BUFWRITEPOST: auto_event = 17;
pub const auto_event_EVENT_BUFWRITEPRE: auto_event = 18;
pub const auto_event_EVENT_CMDLINECHANGED: auto_event = 19;
pub const auto_event_EVENT_CMDLINEENTER: auto_event = 20;
pub const auto_event_EVENT_CMDLINELEAVE: auto_event = 21;
pub const auto_event_EVENT_CMDUNDEFINED: auto_event = 22;
pub const auto_event_EVENT_CMDWINENTER: auto_event = 23;
pub const auto_event_EVENT_CMDWINLEAVE: auto_event = 24;
pub const auto_event_EVENT_COLORSCHEME: auto_event = 25;
pub const auto_event_EVENT_COLORSCHEMEPRE: auto_event = 26;
pub const auto_event_EVENT_COMPLETECHANGED: auto_event = 27;
pub const auto_event_EVENT_COMPLETEDONE: auto_event = 28;
pub const auto_event_EVENT_CURSORHOLD: auto_event = 29;
pub const auto_event_EVENT_CURSORHOLDI: auto_event = 30;
pub const auto_event_EVENT_CURSORMOVED: auto_event = 31;
pub const auto_event_EVENT_CURSORMOVEDI: auto_event = 32;
pub const auto_event_EVENT_DIFFUPDATED: auto_event = 33;
pub const auto_event_EVENT_DIRCHANGED: auto_event = 34;
pub const auto_event_EVENT_ENCODINGCHANGED: auto_event = 35;
pub const auto_event_EVENT_EXITPRE: auto_event = 36;
pub const auto_event_EVENT_FILEAPPENDCMD: auto_event = 37;
pub const auto_event_EVENT_FILEAPPENDPOST: auto_event = 38;
pub const auto_event_EVENT_FILEAPPENDPRE: auto_event = 39;
pub const auto_event_EVENT_FILECHANGEDRO: auto_event = 40;
pub const auto_event_EVENT_FILECHANGEDSHELL: auto_event = 41;
pub const auto_event_EVENT_FILECHANGEDSHELLPOST: auto_event = 42;
pub const auto_event_EVENT_FILEREADCMD: auto_event = 43;
pub const auto_event_EVENT_FILEREADPOST: auto_event = 44;
pub const auto_event_EVENT_FILEREADPRE: auto_event = 45;
pub const auto_event_EVENT_FILETYPE: auto_event = 46;
pub const auto_event_EVENT_FILEWRITECMD: auto_event = 47;
pub const auto_event_EVENT_FILEWRITEPOST: auto_event = 48;
pub const auto_event_EVENT_FILEWRITEPRE: auto_event = 49;
pub const auto_event_EVENT_FILTERREADPOST: auto_event = 50;
pub const auto_event_EVENT_FILTERREADPRE: auto_event = 51;
pub const auto_event_EVENT_FILTERWRITEPOST: auto_event = 52;
pub const auto_event_EVENT_FILTERWRITEPRE: auto_event = 53;
pub const auto_event_EVENT_FOCUSGAINED: auto_event = 54;
pub const auto_event_EVENT_FOCUSLOST: auto_event = 55;
pub const auto_event_EVENT_FUNCUNDEFINED: auto_event = 56;
pub const auto_event_EVENT_GUIENTER: auto_event = 57;
pub const auto_event_EVENT_GUIFAILED: auto_event = 58;
pub const auto_event_EVENT_INSERTCHANGE: auto_event = 59;
pub const auto_event_EVENT_INSERTCHARPRE: auto_event = 60;
pub const auto_event_EVENT_INSERTENTER: auto_event = 61;
pub const auto_event_EVENT_INSERTLEAVE: auto_event = 62;
pub const auto_event_EVENT_MENUPOPUP: auto_event = 63;
pub const auto_event_EVENT_OPTIONSET: auto_event = 64;
pub const auto_event_EVENT_QUICKFIXCMDPOST: auto_event = 65;
pub const auto_event_EVENT_QUICKFIXCMDPRE: auto_event = 66;
pub const auto_event_EVENT_QUITPRE: auto_event = 67;
pub const auto_event_EVENT_REMOTEREPLY: auto_event = 68;
pub const auto_event_EVENT_SESSIONLOADPOST: auto_event = 69;
pub const auto_event_EVENT_SHELLCMDPOST: auto_event = 70;
pub const auto_event_EVENT_SHELLFILTERPOST: auto_event = 71;
pub const auto_event_EVENT_SOURCECMD: auto_event = 72;
pub const auto_event_EVENT_SOURCEPRE: auto_event = 73;
pub const auto_event_EVENT_SOURCEPOST: auto_event = 74;
pub const auto_event_EVENT_SPELLFILEMISSING: auto_event = 75;
pub const auto_event_EVENT_STDINREADPOST: auto_event = 76;
pub const auto_event_EVENT_STDINREADPRE: auto_event = 77;
pub const auto_event_EVENT_SWAPEXISTS: auto_event = 78;
pub const auto_event_EVENT_SYNTAX: auto_event = 79;
pub const auto_event_EVENT_TABCLOSED: auto_event = 80;
pub const auto_event_EVENT_TABENTER: auto_event = 81;
pub const auto_event_EVENT_TABLEAVE: auto_event = 82;
pub const auto_event_EVENT_TABNEW: auto_event = 83;
pub const auto_event_EVENT_TERMCHANGED: auto_event = 84;
pub const auto_event_EVENT_TERMINALOPEN: auto_event = 85;
pub const auto_event_EVENT_TERMRESPONSE: auto_event = 86;
pub const auto_event_EVENT_TEXTCHANGED: auto_event = 87;
pub const auto_event_EVENT_TEXTCHANGEDI: auto_event = 88;
pub const auto_event_EVENT_TEXTCHANGEDP: auto_event = 89;
pub const auto_event_EVENT_TEXTYANKPOST: auto_event = 90;
pub const auto_event_EVENT_USER: auto_event = 91;
pub const auto_event_EVENT_VIMENTER: auto_event = 92;
pub const auto_event_EVENT_VIMLEAVE: auto_event = 93;
pub const auto_event_EVENT_VIMLEAVEPRE: auto_event = 94;
pub const auto_event_EVENT_VIMRESIZED: auto_event = 95;
pub const auto_event_EVENT_WINENTER: auto_event = 96;
pub const auto_event_EVENT_WINLEAVE: auto_event = 97;
pub const auto_event_EVENT_WINNEW: auto_event = 98;
pub const auto_event_NUM_EVENTS: auto_event = 99;
pub type auto_event = ::std::os::raw::c_uint;
pub use self::auto_event as event_T;
pub const hlf_T_HLF_8: hlf_T = 0;
pub const hlf_T_HLF_EOB: hlf_T = 1;
pub const hlf_T_HLF_AT: hlf_T = 2;
pub const hlf_T_HLF_D: hlf_T = 3;
pub const hlf_T_HLF_E: hlf_T = 4;
pub const hlf_T_HLF_H: hlf_T = 5;
pub const hlf_T_HLF_I: hlf_T = 6;
pub const hlf_T_HLF_L: hlf_T = 7;
pub const hlf_T_HLF_M: hlf_T = 8;
pub const hlf_T_HLF_CM: hlf_T = 9;
pub const hlf_T_HLF_N: hlf_T = 10;
pub const hlf_T_HLF_CLN: hlf_T = 11;
pub const hlf_T_HLF_R: hlf_T = 12;
pub const hlf_T_HLF_S: hlf_T = 13;
pub const hlf_T_HLF_SNC: hlf_T = 14;
pub const hlf_T_HLF_C: hlf_T = 15;
pub const hlf_T_HLF_T: hlf_T = 16;
pub const hlf_T_HLF_V: hlf_T = 17;
pub const hlf_T_HLF_VNC: hlf_T = 18;
pub const hlf_T_HLF_W: hlf_T = 19;
pub const hlf_T_HLF_WM: hlf_T = 20;
pub const hlf_T_HLF_FL: hlf_T = 21;
pub const hlf_T_HLF_FC: hlf_T = 22;
pub const hlf_T_HLF_ADD: hlf_T = 23;
pub const hlf_T_HLF_CHD: hlf_T = 24;
pub const hlf_T_HLF_DED: hlf_T = 25;
pub const hlf_T_HLF_TXD: hlf_T = 26;
pub const hlf_T_HLF_CONCEAL: hlf_T = 27;
pub const hlf_T_HLF_SC: hlf_T = 28;
pub const hlf_T_HLF_SPB: hlf_T = 29;
pub const hlf_T_HLF_SPC: hlf_T = 30;
pub const hlf_T_HLF_SPR: hlf_T = 31;
pub const hlf_T_HLF_SPL: hlf_T = 32;
pub const hlf_T_HLF_PNI: hlf_T = 33;
pub const hlf_T_HLF_PSI: hlf_T = 34;
pub const hlf_T_HLF_PSB: hlf_T = 35;
pub const hlf_T_HLF_PST: hlf_T = 36;
pub const hlf_T_HLF_TP: hlf_T = 37;
pub const hlf_T_HLF_TPS: hlf_T = 38;
pub const hlf_T_HLF_TPF: hlf_T = 39;
pub const hlf_T_HLF_CUC: hlf_T = 40;
pub const hlf_T_HLF_CUL: hlf_T = 41;
pub const hlf_T_HLF_MC: hlf_T = 42;
pub const hlf_T_HLF_QFL: hlf_T = 43;
pub const hlf_T_HLF_ST: hlf_T = 44;
pub const hlf_T_HLF_STNC: hlf_T = 45;
pub const hlf_T_HLF_COUNT: hlf_T = 46;
pub type hlf_T = ::std::os::raw::c_uint;
pub type UINT32_T = ::std::os::raw::c_uint;
pub type linenr_T = ::std::os::raw::c_long;
pub type colnr_T = ::std::os::raw::c_int;
pub type disptick_T = ::std::os::raw::c_ushort;
pub type vim_acl_T = *mut ::std::os::raw::c_void;
extern "C" {
    pub fn vim_memset(
        arg1: *mut ::std::os::raw::c_void,
        arg2: ::std::os::raw::c_int,
        arg3: size_t,
    ) -> *mut ::std::os::raw::c_void;
}
pub type proftime_T = ::std::os::raw::c_int;
pub type time_T = ::std::os::raw::c_long;
pub type sock_T = ::std::os::raw::c_int;
extern "C" {
    pub static mut p_ambw: *mut char_u;
}
extern "C" {
    pub static mut p_emoji: *mut char_u;
}
extern "C" {
    pub static mut p_ar: ::std::os::raw::c_int;
}
extern "C" {
    pub static mut p_aw: ::std::os::raw::c_int;
}
extern "C" {
    pub static mut p_awa: ::std::os::raw::c_int;
}
extern "C" {
    pub static mut p_bs: *mut char_u;
}
extern "C" {
    pub static mut p_bg: *mut char_u;
}
extern "C" {
    pub static mut p_bk: ::std::os::raw::c_int;
}
extern "C" {
    pub static mut p_bkc: *mut char_u;
}
extern "C" {
    pub static mut bkc_flags: ::std::os::raw::c_uint;
}
extern "C" {
    pub static mut p_bdir: *mut char_u;
}
extern "C" {
    pub static mut p_bex: *mut char_u;
}
extern "C" {
    pub static mut p_bo: *mut char_u;
}
extern "C" {
    pub static mut bo_flags: ::std::os::raw::c_uint;
}
extern "C" {
    pub static mut p_bsk: *mut char_u;
}
extern "C" {
    pub static mut p_breakat: *mut char_u;
}
extern "C" {
    pub static mut p_cmp: *mut char_u;
}
extern "C" {
    pub static mut cmp_flags: ::std::os::raw::c_uint;
}
extern "C" {
    pub static mut p_enc: *mut char_u;
}
extern "C" {
    pub static mut p_deco: ::std::os::raw::c_int;
}
extern "C" {
    pub static mut p_ccv: *mut char_u;
}
extern "C" {
    pub static mut p_ch: ::std::os::raw::c_long;
}
extern "C" {
    pub static mut p_codelens: ::std::os::raw::c_int;
}
extern "C" {
    pub static mut p_cp: ::std::os::raw::c_int;
}
extern "C" {
    pub static mut p_cpo: *mut char_u;
}
extern "C" {
    pub static mut p_debug: *mut char_u;
}
extern "C" {
    pub static mut p_def: *mut char_u;
}
extern "C" {
    pub static mut p_inc: *mut char_u;
}
extern "C" {
    pub static mut p_dip: *mut char_u;
}
extern "C" {
    pub static mut p_dex: *mut char_u;
}
extern "C" {
    pub static mut p_dir: *mut char_u;
}
extern "C" {
    pub static mut p_dy: *mut char_u;
}
extern "C" {
    pub static mut dy_flags: ::std::os::raw::c_uint;
}
extern "C" {
    pub static mut p_ed: ::std::os::raw::c_int;
}
extern "C" {
    pub static mut p_ead: *mut char_u;
}
extern "C" {
    pub static mut p_ea: ::std::os::raw::c_int;
}
extern "C" {
    pub static mut p_ep: *mut char_u;
}
extern "C" {
    pub static mut p_eb: ::std::os::raw::c_int;
}
extern "C" {
    pub static mut p_ef: *mut char_u;
}
extern "C" {
    pub static mut p_efm: *mut char_u;
}
extern "C" {
    pub static mut p_gefm: *mut char_u;
}
extern "C" {
    pub static mut p_gp: *mut char_u;
}
extern "C" {
    pub static mut p_ei: *mut char_u;
}
extern "C" {
    pub static mut p_ek: ::std::os::raw::c_int;
}
extern "C" {
    pub static mut p_exrc: ::std::os::raw::c_int;
}
extern "C" {
    pub static mut p_fencs: *mut char_u;
}
extern "C" {
    pub static mut p_ffs: *mut char_u;
}
extern "C" {
    pub static mut p_fic: ::std::os::raw::c_long;
}
extern "C" {
    pub static mut p_fcl: *mut char_u;
}
extern "C" {
    pub static mut p_fdls: ::std::os::raw::c_long;
}
extern "C" {
    pub static mut p_fdo: *mut char_u;
}
extern "C" {
    pub static mut fdo_flags: ::std::os::raw::c_uint;
}
extern "C" {
    pub static mut p_fp: *mut char_u;
}
extern "C" {
    pub static mut p_gd: ::std::os::raw::c_int;
}
extern "C" {
    pub static mut p_guifont: *mut char_u;
}
extern "C" {
    pub static mut p_prompt: ::std::os::raw::c_int;
}
extern "C" {
    pub static mut p_hf: *mut char_u;
}
extern "C" {
    pub static mut p_hh: ::std::os::raw::c_long;
}
extern "C" {
    pub static mut p_hlg: *mut char_u;
}
extern "C" {
    pub static mut p_hid: ::std::os::raw::c_int;
}
extern "C" {
    pub static mut p_hl: *mut char_u;
}
extern "C" {
    pub static mut p_hls: ::std::os::raw::c_int;
}
extern "C" {
    pub static mut p_hi: ::std::os::raw::c_long;
}
extern "C" {
    pub static mut p_ic: ::std::os::raw::c_int;
}
extern "C" {
    pub static mut p_imaf: *mut char_u;
}
extern "C" {
    pub static mut p_imsf: *mut char_u;
}
extern "C" {
    pub static mut p_imcmdline: ::std::os::raw::c_int;
}
extern "C" {
    pub static mut p_imdisable: ::std::os::raw::c_int;
}
extern "C" {
    pub static mut p_is: ::std::os::raw::c_int;
}
extern "C" {
    pub static mut p_im: ::std::os::raw::c_int;
}
extern "C" {
    pub static mut p_isf: *mut char_u;
}
extern "C" {
    pub static mut p_isi: *mut char_u;
}
extern "C" {
    pub static mut p_isp: *mut char_u;
}
extern "C" {
    pub static mut p_js: ::std::os::raw::c_int;
}
extern "C" {
    pub static mut p_keydisplay: ::std::os::raw::c_int;
}
extern "C" {
    pub static mut p_kp: *mut char_u;
}
extern "C" {
    pub static mut p_km: *mut char_u;
}
extern "C" {
    pub static mut p_ls: ::std::os::raw::c_long;
}
extern "C" {
    pub static mut p_stal: ::std::os::raw::c_long;
}
extern "C" {
    pub static mut p_linespace: ::std::os::raw::c_long;
}
extern "C" {
    pub static mut p_lcs: *mut char_u;
}
extern "C" {
    pub static mut p_lz: ::std::os::raw::c_int;
}
extern "C" {
    pub static mut p_lpl: ::std::os::raw::c_int;
}
extern "C" {
    pub static mut p_magic: ::std::os::raw::c_int;
}
extern "C" {
    pub static mut p_menc: *mut char_u;
}
extern "C" {
    pub static mut p_mef: *mut char_u;
}
extern "C" {
    pub static mut p_mp: *mut char_u;
}
extern "C" {
    pub static mut p_mat: ::std::os::raw::c_long;
}
extern "C" {
    pub static mut p_mco: ::std::os::raw::c_long;
}
extern "C" {
    pub static mut p_mfd: ::std::os::raw::c_long;
}
extern "C" {
    pub static mut p_mmd: ::std::os::raw::c_long;
}
extern "C" {
    pub static mut p_mm: ::std::os::raw::c_long;
}
extern "C" {
    pub static mut p_mmp: ::std::os::raw::c_long;
}
extern "C" {
    pub static mut p_mmt: ::std::os::raw::c_long;
}
extern "C" {
    pub static mut p_minimap: ::std::os::raw::c_int;
}
extern "C" {
    pub static mut p_mle: ::std::os::raw::c_long;
}
extern "C" {
    pub static mut p_mls: ::std::os::raw::c_long;
}
extern "C" {
    pub static mut p_mouse: *mut char_u;
}
extern "C" {
    pub static mut p_mousem: *mut char_u;
}
extern "C" {
    pub static mut p_mouset: ::std::os::raw::c_long;
}
extern "C" {
    pub static mut p_more: ::std::os::raw::c_int;
}
extern "C" {
    pub static mut p_opfunc: *mut char_u;
}
extern "C" {
    pub static mut p_para: *mut char_u;
}
extern "C" {
    pub static mut p_paste: ::std::os::raw::c_int;
}
extern "C" {
    pub static mut p_pt: *mut char_u;
}
extern "C" {
    pub static mut p_pex: *mut char_u;
}
extern "C" {
    pub static mut p_pm: *mut char_u;
}
extern "C" {
    pub static mut p_path: *mut char_u;
}
extern "C" {
    pub static mut p_cdpath: *mut char_u;
}
extern "C" {
    pub static mut p_remap: ::std::os::raw::c_int;
}
extern "C" {
    pub static mut p_re: ::std::os::raw::c_long;
}
extern "C" {
    pub static mut p_report: ::std::os::raw::c_long;
}
extern "C" {
    pub static mut p_pvh: ::std::os::raw::c_long;
}
extern "C" {
    pub static mut p_pp: *mut char_u;
}
extern "C" {
    pub static mut p_rtp: *mut char_u;
}
extern "C" {
    pub static mut p_sj: ::std::os::raw::c_long;
}
extern "C" {
    pub static mut p_so: ::std::os::raw::c_long;
}
extern "C" {
    pub static mut p_sbo: *mut char_u;
}
extern "C" {
    pub static mut p_sections: *mut char_u;
}
extern "C" {
    pub static mut p_secure: ::std::os::raw::c_int;
}
extern "C" {
    pub static mut p_sel: *mut char_u;
}
extern "C" {
    pub static mut p_slm: *mut char_u;
}
extern "C" {
    pub static mut p_ssop: *mut char_u;
}
extern "C" {
    pub static mut ssop_flags: ::std::os::raw::c_uint;
}
extern "C" {
    pub static mut p_sh: *mut char_u;
}
extern "C" {
    pub static mut p_shcf: *mut char_u;
}
extern "C" {
    pub static mut p_sp: *mut char_u;
}
extern "C" {
    pub static mut p_shq: *mut char_u;
}
extern "C" {
    pub static mut p_sxq: *mut char_u;
}
extern "C" {
    pub static mut p_sxe: *mut char_u;
}
extern "C" {
    pub static mut p_srr: *mut char_u;
}
extern "C" {
    pub static mut p_stmp: ::std::os::raw::c_int;
}
extern "C" {
    pub static mut p_sr: ::std::os::raw::c_int;
}
extern "C" {
    pub static mut p_shm: *mut char_u;
}
extern "C" {
    pub static mut p_sbr: *mut char_u;
}
extern "C" {
    pub static mut p_sft: ::std::os::raw::c_int;
}
extern "C" {
    pub static mut p_sm: ::std::os::raw::c_int;
}
extern "C" {
    pub static mut p_smd: ::std::os::raw::c_int;
}
extern "C" {
    pub static mut p_ss: ::std::os::raw::c_long;
}
extern "C" {
    pub static mut p_siso: ::std::os::raw::c_long;
}
extern "C" {
    pub static mut p_scs: ::std::os::raw::c_int;
}
extern "C" {
    pub static mut p_sta: ::std::os::raw::c_int;
}
extern "C" {
    pub static mut p_smoothscroll: ::std::os::raw::c_int;
}
extern "C" {
    pub static mut p_sb: ::std::os::raw::c_int;
}
extern "C" {
    pub static mut p_tpm: ::std::os::raw::c_long;
}
extern "C" {
    pub static mut p_spr: ::std::os::raw::c_int;
}
extern "C" {
    pub static mut p_sol: ::std::os::raw::c_int;
}
extern "C" {
    pub static mut p_su: *mut char_u;
}
extern "C" {
    pub static mut p_sws: *mut char_u;
}
extern "C" {
    pub static mut p_swb: *mut char_u;
}
extern "C" {
    pub static mut swb_flags: ::std::os::raw::c_uint;
}
extern "C" {
    pub static mut p_tbs: ::std::os::raw::c_int;
}
extern "C" {
    pub static mut p_tc: *mut char_u;
}
extern "C" {
    pub static mut tc_flags: ::std::os::raw::c_uint;
}
extern "C" {
    pub static mut p_tl: ::std::os::raw::c_long;
}
extern "C" {
    pub static mut p_tr: ::std::os::raw::c_int;
}
extern "C" {
    pub static mut p_tags: *mut char_u;
}
extern "C" {
    pub static mut p_tgst: ::std::os::raw::c_int;
}
extern "C" {
    pub static mut p_tenc: *mut char_u;
}
extern "C" {
    pub static mut p_termfont: *mut char_u;
}
extern "C" {
    pub static mut p_terse: ::std::os::raw::c_int;
}
extern "C" {
    pub static mut p_ta: ::std::os::raw::c_int;
}
extern "C" {
    pub static mut p_to: ::std::os::raw::c_int;
}
extern "C" {
    pub static mut p_timeout: ::std::os::raw::c_int;
}
extern "C" {
    pub static mut p_tm: ::std::os::raw::c_long;
}
extern "C" {
    pub static mut p_ttimeout: ::std::os::raw::c_int;
}
extern "C" {
    pub static mut p_ttm: ::std::os::raw::c_long;
}
extern "C" {
    pub static mut p_tbi: ::std::os::raw::c_int;
}
extern "C" {
    pub static mut p_tf: ::std::os::raw::c_int;
}
extern "C" {
    pub static mut p_ttyscroll: ::std::os::raw::c_long;
}
extern "C" {
    pub static mut p_udir: *mut char_u;
}
extern "C" {
    pub static mut p_ul: ::std::os::raw::c_long;
}
extern "C" {
    pub static mut p_ur: ::std::os::raw::c_long;
}
extern "C" {
    pub static mut p_uc: ::std::os::raw::c_long;
}
extern "C" {
    pub static mut p_ut: ::std::os::raw::c_long;
}
extern "C" {
    pub static mut p_fcs: *mut char_u;
}
extern "C" {
    pub static mut p_vcp: ::std::os::raw::c_int;
}
extern "C" {
    pub static mut p_viminfo: *mut char_u;
}
extern "C" {
    pub static mut p_viminfofile: *mut char_u;
}
extern "C" {
    pub static mut p_vdir: *mut char_u;
}
extern "C" {
    pub static mut p_vop: *mut char_u;
}
extern "C" {
    pub static mut vop_flags: ::std::os::raw::c_uint;
}
extern "C" {
    pub static mut p_vb: ::std::os::raw::c_int;
}
extern "C" {
    pub static mut p_ve: *mut char_u;
}
extern "C" {
    pub static mut ve_flags: ::std::os::raw::c_uint;
}
extern "C" {
    pub static mut p_verbose: ::std::os::raw::c_long;
}
extern "C" {
    pub static mut p_vfile: *mut char_u;
}
extern "C" {
    pub static mut p_warn: ::std::os::raw::c_int;
}
extern "C" {
    pub static mut p_wop: *mut char_u;
}
extern "C" {
    pub static mut p_window: ::std::os::raw::c_long;
}
extern "C" {
    pub static mut p_wig: *mut char_u;
}
extern "C" {
    pub static mut p_wiv: ::std::os::raw::c_int;
}
extern "C" {
    pub static mut p_ww: *mut char_u;
}
extern "C" {
    pub static mut p_wc: ::std::os::raw::c_long;
}
extern "C" {
    pub static mut p_wcm: ::std::os::raw::c_long;
}
extern "C" {
    pub static mut p_wic: ::std::os::raw::c_long;
}
extern "C" {
    pub static mut p_wim: *mut char_u;
}
extern "C" {
    pub static mut p_wh: ::std::os::raw::c_long;
}
extern "C" {
    pub static mut p_wmh: ::std::os::raw::c_long;
}
extern "C" {
    pub static mut p_wmw: ::std::os::raw::c_long;
}
extern "C" {
    pub static mut p_wiw: ::std::os::raw::c_long;
}
extern "C" {
    pub static mut p_ws: ::std::os::raw::c_int;
}
extern "C" {
    pub static mut p_write: ::std::os::raw::c_int;
}
extern "C" {
    pub static mut p_wa: ::std::os::raw::c_int;
}
extern "C" {
    pub static mut p_wb: ::std::os::raw::c_int;
}
extern "C" {
    pub static mut p_wd: ::std::os::raw::c_long;
}
pub const BV_AI: ::std::os::raw::c_uint = 0;
pub const BV_AR: ::std::os::raw::c_uint = 1;
pub const BV_BH: ::std::os::raw::c_uint = 2;
pub const BV_BKC: ::std::os::raw::c_uint = 3;
pub const BV_BT: ::std::os::raw::c_uint = 4;
pub const BV_EFM: ::std::os::raw::c_uint = 5;
pub const BV_GP: ::std::os::raw::c_uint = 6;
pub const BV_MP: ::std::os::raw::c_uint = 7;
pub const BV_BIN: ::std::os::raw::c_uint = 8;
pub const BV_BL: ::std::os::raw::c_uint = 9;
pub const BV_BOMB: ::std::os::raw::c_uint = 10;
pub const BV_CI: ::std::os::raw::c_uint = 11;
pub const BV_CM: ::std::os::raw::c_uint = 12;
pub const BV_CMS: ::std::os::raw::c_uint = 13;
pub const BV_COM: ::std::os::raw::c_uint = 14;
pub const BV_DEF: ::std::os::raw::c_uint = 15;
pub const BV_INC: ::std::os::raw::c_uint = 16;
pub const BV_EOL: ::std::os::raw::c_uint = 17;
pub const BV_FIXEOL: ::std::os::raw::c_uint = 18;
pub const BV_EP: ::std::os::raw::c_uint = 19;
pub const BV_ET: ::std::os::raw::c_uint = 20;
pub const BV_FENC: ::std::os::raw::c_uint = 21;
pub const BV_FP: ::std::os::raw::c_uint = 22;
pub const BV_BEXPR: ::std::os::raw::c_uint = 23;
pub const BV_FEX: ::std::os::raw::c_uint = 24;
pub const BV_FF: ::std::os::raw::c_uint = 25;
pub const BV_FLP: ::std::os::raw::c_uint = 26;
pub const BV_FO: ::std::os::raw::c_uint = 27;
pub const BV_FT: ::std::os::raw::c_uint = 28;
pub const BV_IMI: ::std::os::raw::c_uint = 29;
pub const BV_IMS: ::std::os::raw::c_uint = 30;
pub const BV_INDE: ::std::os::raw::c_uint = 31;
pub const BV_INDK: ::std::os::raw::c_uint = 32;
pub const BV_INEX: ::std::os::raw::c_uint = 33;
pub const BV_INF: ::std::os::raw::c_uint = 34;
pub const BV_ISK: ::std::os::raw::c_uint = 35;
pub const BV_KP: ::std::os::raw::c_uint = 36;
pub const BV_MENC: ::std::os::raw::c_uint = 37;
pub const BV_MA: ::std::os::raw::c_uint = 38;
pub const BV_ML: ::std::os::raw::c_uint = 39;
pub const BV_MOD: ::std::os::raw::c_uint = 40;
pub const BV_MPS: ::std::os::raw::c_uint = 41;
pub const BV_NF: ::std::os::raw::c_uint = 42;
pub const BV_PATH: ::std::os::raw::c_uint = 43;
pub const BV_PI: ::std::os::raw::c_uint = 44;
pub const BV_QE: ::std::os::raw::c_uint = 45;
pub const BV_RO: ::std::os::raw::c_uint = 46;
pub const BV_SN: ::std::os::raw::c_uint = 47;
pub const BV_STS: ::std::os::raw::c_uint = 48;
pub const BV_SUA: ::std::os::raw::c_uint = 49;
pub const BV_SW: ::std::os::raw::c_uint = 50;
pub const BV_SWF: ::std::os::raw::c_uint = 51;
pub const BV_TFU: ::std::os::raw::c_uint = 52;
pub const BV_TAGS: ::std::os::raw::c_uint = 53;
pub const BV_TC: ::std::os::raw::c_uint = 54;
pub const BV_TS: ::std::os::raw::c_uint = 55;
pub const BV_TW: ::std::os::raw::c_uint = 56;
pub const BV_TX: ::std::os::raw::c_uint = 57;
pub const BV_UDF: ::std::os::raw::c_uint = 58;
pub const BV_UL: ::std::os::raw::c_uint = 59;
pub const BV_WM: ::std::os::raw::c_uint = 60;
pub const BV_COUNT: ::std::os::raw::c_uint = 61;
pub type _bindgen_ty_1 = ::std::os::raw::c_uint;
pub const WV_LIST: ::std::os::raw::c_uint = 0;
pub const WV_CRBIND: ::std::os::raw::c_uint = 1;
pub const WV_BRI: ::std::os::raw::c_uint = 2;
pub const WV_BRIOPT: ::std::os::raw::c_uint = 3;
pub const WV_WCR: ::std::os::raw::c_uint = 4;
pub const WV_DIFF: ::std::os::raw::c_uint = 5;
pub const WV_FDC: ::std::os::raw::c_uint = 6;
pub const WV_FEN: ::std::os::raw::c_uint = 7;
pub const WV_FDI: ::std::os::raw::c_uint = 8;
pub const WV_FDL: ::std::os::raw::c_uint = 9;
pub const WV_FDM: ::std::os::raw::c_uint = 10;
pub const WV_FML: ::std::os::raw::c_uint = 11;
pub const WV_FDN: ::std::os::raw::c_uint = 12;
pub const WV_FDE: ::std::os::raw::c_uint = 13;
pub const WV_FDT: ::std::os::raw::c_uint = 14;
pub const WV_FMR: ::std::os::raw::c_uint = 15;
pub const WV_LBR: ::std::os::raw::c_uint = 16;
pub const WV_NU: ::std::os::raw::c_uint = 17;
pub const WV_RNU: ::std::os::raw::c_uint = 18;
pub const WV_NUW: ::std::os::raw::c_uint = 19;
pub const WV_PVW: ::std::os::raw::c_uint = 20;
pub const WV_SCBIND: ::std::os::raw::c_uint = 21;
pub const WV_SCROLL: ::std::os::raw::c_uint = 22;
pub const WV_SISO: ::std::os::raw::c_uint = 23;
pub const WV_SO: ::std::os::raw::c_uint = 24;
pub const WV_WFH: ::std::os::raw::c_uint = 25;
pub const WV_WFW: ::std::os::raw::c_uint = 26;
pub const WV_WRAP: ::std::os::raw::c_uint = 27;
pub const WV_COUNT: ::std::os::raw::c_uint = 28;
pub type _bindgen_ty_2 = ::std::os::raw::c_uint;
extern "C" {
    pub static mut SDS_NOINIT: *const ::std::os::raw::c_char;
}
pub type int_least8_t = i8;
pub type int_least16_t = i16;
pub type int_least32_t = i32;
pub type int_least64_t = i64;
pub type uint_least8_t = u8;
pub type uint_least16_t = u16;
pub type uint_least32_t = u32;
pub type uint_least64_t = u64;
pub type int_fast8_t = i8;
pub type int_fast16_t = i16;
pub type int_fast32_t = i32;
pub type int_fast64_t = i64;
pub type uint_fast8_t = u8;
pub type uint_fast16_t = u16;
pub type uint_fast32_t = u32;
pub type uint_fast64_t = u64;
pub type intmax_t = ::std::os::raw::c_long;
pub type uintmax_t = ::std::os::raw::c_ulong;
pub type u_char = ::std::os::raw::c_uchar;
pub type u_short = ::std::os::raw::c_ushort;
pub type u_int = ::std::os::raw::c_uint;
pub type u_long = ::std::os::raw::c_ulong;
pub type ushort = ::std::os::raw::c_ushort;
pub type uint = ::std::os::raw::c_uint;
pub type u_quad_t = u_int64_t;
pub type quad_t = i64;
pub type qaddr_t = *mut quad_t;
pub type caddr_t = *mut ::std::os::raw::c_char;
pub type daddr_t = i32;
pub type dev_t = __darwin_dev_t;
pub type fixpt_t = u_int32_t;
pub type blkcnt_t = __darwin_blkcnt_t;
pub type blksize_t = __darwin_blksize_t;
pub type gid_t = __darwin_gid_t;
pub type in_addr_t = __uint32_t;
pub type in_port_t = __uint16_t;
pub type ino_t = __darwin_ino_t;
pub type ino64_t = __darwin_ino64_t;
pub type key_t = __int32_t;
pub type mode_t = __darwin_mode_t;
pub type nlink_t = __uint16_t;
pub type id_t = __darwin_id_t;
pub type pid_t = __darwin_pid_t;
pub type segsz_t = i32;
pub type swblk_t = i32;
pub type uid_t = __darwin_uid_t;
pub type clock_t = __darwin_clock_t;
pub type time_t = __darwin_time_t;
pub type useconds_t = __darwin_useconds_t;
pub type suseconds_t = __darwin_suseconds_t;
pub type errno_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fd_set {
    pub fds_bits: [__int32_t; 32usize],
}
#[test]
fn bindgen_test_layout_fd_set() {
    assert_eq!(
        ::std::mem::size_of::<fd_set>(),
        128usize,
        concat!("Size of: ", stringify!(fd_set))
    );
    assert_eq!(
        ::std::mem::align_of::<fd_set>(),
        4usize,
        concat!("Alignment of ", stringify!(fd_set))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fd_set>())).fds_bits as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fd_set),
            "::",
            stringify!(fds_bits)
        )
    );
}
extern "C" {
    pub fn __darwin_check_fd_set_overflow(
        arg1: ::std::os::raw::c_int,
        arg2: *const ::std::os::raw::c_void,
        arg3: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
pub type fd_mask = __int32_t;
pub type pthread_attr_t = __darwin_pthread_attr_t;
pub type pthread_cond_t = __darwin_pthread_cond_t;
pub type pthread_condattr_t = __darwin_pthread_condattr_t;
pub type pthread_mutex_t = __darwin_pthread_mutex_t;
pub type pthread_mutexattr_t = __darwin_pthread_mutexattr_t;
pub type pthread_once_t = __darwin_pthread_once_t;
pub type pthread_rwlock_t = __darwin_pthread_rwlock_t;
pub type pthread_rwlockattr_t = __darwin_pthread_rwlockattr_t;
pub type pthread_t = __darwin_pthread_t;
pub type pthread_key_t = __darwin_pthread_key_t;
pub type fsblkcnt_t = __darwin_fsblkcnt_t;
pub type fsfilcnt_t = __darwin_fsfilcnt_t;
pub type sds = *mut ::std::os::raw::c_char;
#[repr(C, packed)]
#[derive(Debug)]
pub struct sdshdr5 {
    pub flags: ::std::os::raw::c_uchar,
    pub buf: __IncompleteArrayField<::std::os::raw::c_char>,
}
#[test]
fn bindgen_test_layout_sdshdr5() {
    assert_eq!(
        ::std::mem::size_of::<sdshdr5>(),
        1usize,
        concat!("Size of: ", stringify!(sdshdr5))
    );
    assert_eq!(
        ::std::mem::align_of::<sdshdr5>(),
        1usize,
        concat!("Alignment of ", stringify!(sdshdr5))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<sdshdr5>())).flags as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sdshdr5),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<sdshdr5>())).buf as *const _ as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(sdshdr5),
            "::",
            stringify!(buf)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug)]
pub struct sdshdr8 {
    pub len: u8,
    pub alloc: u8,
    pub flags: ::std::os::raw::c_uchar,
    pub buf: __IncompleteArrayField<::std::os::raw::c_char>,
}
#[test]
fn bindgen_test_layout_sdshdr8() {
    assert_eq!(
        ::std::mem::size_of::<sdshdr8>(),
        3usize,
        concat!("Size of: ", stringify!(sdshdr8))
    );
    assert_eq!(
        ::std::mem::align_of::<sdshdr8>(),
        1usize,
        concat!("Alignment of ", stringify!(sdshdr8))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<sdshdr8>())).len as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sdshdr8),
            "::",
            stringify!(len)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<sdshdr8>())).alloc as *const _ as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(sdshdr8),
            "::",
            stringify!(alloc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<sdshdr8>())).flags as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(sdshdr8),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<sdshdr8>())).buf as *const _ as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(sdshdr8),
            "::",
            stringify!(buf)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug)]
pub struct sdshdr16 {
    pub len: u16,
    pub alloc: u16,
    pub flags: ::std::os::raw::c_uchar,
    pub buf: __IncompleteArrayField<::std::os::raw::c_char>,
}
#[test]
fn bindgen_test_layout_sdshdr16() {
    assert_eq!(
        ::std::mem::size_of::<sdshdr16>(),
        5usize,
        concat!("Size of: ", stringify!(sdshdr16))
    );
    assert_eq!(
        ::std::mem::align_of::<sdshdr16>(),
        1usize,
        concat!("Alignment of ", stringify!(sdshdr16))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<sdshdr16>())).len as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sdshdr16),
            "::",
            stringify!(len)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<sdshdr16>())).alloc as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(sdshdr16),
            "::",
            stringify!(alloc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<sdshdr16>())).flags as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(sdshdr16),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<sdshdr16>())).buf as *const _ as usize },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(sdshdr16),
            "::",
            stringify!(buf)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug)]
pub struct sdshdr32 {
    pub len: u32,
    pub alloc: u32,
    pub flags: ::std::os::raw::c_uchar,
    pub buf: __IncompleteArrayField<::std::os::raw::c_char>,
}
#[test]
fn bindgen_test_layout_sdshdr32() {
    assert_eq!(
        ::std::mem::size_of::<sdshdr32>(),
        9usize,
        concat!("Size of: ", stringify!(sdshdr32))
    );
    assert_eq!(
        ::std::mem::align_of::<sdshdr32>(),
        1usize,
        concat!("Alignment of ", stringify!(sdshdr32))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<sdshdr32>())).len as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sdshdr32),
            "::",
            stringify!(len)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<sdshdr32>())).alloc as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(sdshdr32),
            "::",
            stringify!(alloc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<sdshdr32>())).flags as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(sdshdr32),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<sdshdr32>())).buf as *const _ as usize },
        9usize,
        concat!(
            "Offset of field: ",
            stringify!(sdshdr32),
            "::",
            stringify!(buf)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug)]
pub struct sdshdr64 {
    pub len: u64,
    pub alloc: u64,
    pub flags: ::std::os::raw::c_uchar,
    pub buf: __IncompleteArrayField<::std::os::raw::c_char>,
}
#[test]
fn bindgen_test_layout_sdshdr64() {
    assert_eq!(
        ::std::mem::size_of::<sdshdr64>(),
        17usize,
        concat!("Size of: ", stringify!(sdshdr64))
    );
    assert_eq!(
        ::std::mem::align_of::<sdshdr64>(),
        1usize,
        concat!("Alignment of ", stringify!(sdshdr64))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<sdshdr64>())).len as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sdshdr64),
            "::",
            stringify!(len)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<sdshdr64>())).alloc as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(sdshdr64),
            "::",
            stringify!(alloc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<sdshdr64>())).flags as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(sdshdr64),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<sdshdr64>())).buf as *const _ as usize },
        17usize,
        concat!(
            "Offset of field: ",
            stringify!(sdshdr64),
            "::",
            stringify!(buf)
        )
    );
}
extern "C" {
    pub fn sdsnewlen(init: *const ::std::os::raw::c_void, initlen: size_t) -> sds;
}
extern "C" {
    pub fn sdsnew(init: *const ::std::os::raw::c_char) -> sds;
}
extern "C" {
    pub fn sdsempty() -> sds;
}
extern "C" {
    pub fn sdsdup(s: sds) -> sds;
}
extern "C" {
    pub fn sdsfree(s: sds);
}
extern "C" {
    pub fn sdsgrowzero(s: sds, len: size_t) -> sds;
}
extern "C" {
    pub fn sdscatlen(s: sds, t: *const ::std::os::raw::c_void, len: size_t) -> sds;
}
extern "C" {
    pub fn sdscat(s: sds, t: *const ::std::os::raw::c_char) -> sds;
}
extern "C" {
    pub fn sdscatsds(s: sds, t: sds) -> sds;
}
extern "C" {
    pub fn sdscpylen(s: sds, t: *const ::std::os::raw::c_char, len: size_t) -> sds;
}
extern "C" {
    pub fn sdscpy(s: sds, t: *const ::std::os::raw::c_char) -> sds;
}
extern "C" {
    pub fn sdscatvprintf(s: sds, fmt: *const ::std::os::raw::c_char, ap: *mut __va_list_tag)
        -> sds;
}
extern "C" {
    pub fn sdscatprintf(s: sds, fmt: *const ::std::os::raw::c_char, ...) -> sds;
}
extern "C" {
    pub fn sdscatfmt(s: sds, fmt: *const ::std::os::raw::c_char, ...) -> sds;
}
extern "C" {
    pub fn sdstrim(s: sds, cset: *const ::std::os::raw::c_char) -> sds;
}
extern "C" {
    pub fn sdsrange(s: sds, start: ssize_t, end: ssize_t);
}
extern "C" {
    pub fn sdsupdatelen(s: sds);
}
extern "C" {
    pub fn sdsclear(s: sds);
}
extern "C" {
    pub fn sdscmp(s1: sds, s2: sds) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn sdssplitlen(
        s: *const ::std::os::raw::c_char,
        len: ssize_t,
        sep: *const ::std::os::raw::c_char,
        seplen: ::std::os::raw::c_int,
        count: *mut ::std::os::raw::c_int,
    ) -> *mut sds;
}
extern "C" {
    pub fn sdsfreesplitres(tokens: *mut sds, count: ::std::os::raw::c_int);
}
extern "C" {
    pub fn sdstolower(s: sds);
}
extern "C" {
    pub fn sdstoupper(s: sds);
}
extern "C" {
    pub fn sdsfromlonglong(value: ::std::os::raw::c_longlong) -> sds;
}
extern "C" {
    pub fn sdscatrepr(s: sds, p: *const ::std::os::raw::c_char, len: size_t) -> sds;
}
extern "C" {
    pub fn sdssplitargs(
        line: *const ::std::os::raw::c_char,
        argc: *mut ::std::os::raw::c_int,
    ) -> *mut sds;
}
extern "C" {
    pub fn sdsmapchars(
        s: sds,
        from: *const ::std::os::raw::c_char,
        to: *const ::std::os::raw::c_char,
        setlen: size_t,
    ) -> sds;
}
extern "C" {
    pub fn sdsjoin(
        argv: *mut *mut ::std::os::raw::c_char,
        argc: ::std::os::raw::c_int,
        sep: *mut ::std::os::raw::c_char,
    ) -> sds;
}
extern "C" {
    pub fn sdsjoinsds(
        argv: *mut sds,
        argc: ::std::os::raw::c_int,
        sep: *const ::std::os::raw::c_char,
        seplen: size_t,
    ) -> sds;
}
extern "C" {
    pub fn sdsMakeRoomFor(s: sds, addlen: size_t) -> sds;
}
extern "C" {
    pub fn sdsIncrLen(s: sds, incr: ssize_t);
}
extern "C" {
    pub fn sdsRemoveFreeSpace(s: sds) -> sds;
}
extern "C" {
    pub fn sdsAllocSize(s: sds) -> size_t;
}
extern "C" {
    pub fn sdsAllocPtr(s: sds) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn sds_malloc(size: size_t) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn sds_realloc(
        ptr: *mut ::std::os::raw::c_void,
        size: size_t,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn sds_free(ptr: *mut ::std::os::raw::c_void);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pos_T {
    pub lnum: linenr_T,
    pub col: colnr_T,
    pub coladd: colnr_T,
}
#[test]
fn bindgen_test_layout_pos_T() {
    assert_eq!(
        ::std::mem::size_of::<pos_T>(),
        16usize,
        concat!("Size of: ", stringify!(pos_T))
    );
    assert_eq!(
        ::std::mem::align_of::<pos_T>(),
        8usize,
        concat!("Alignment of ", stringify!(pos_T))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pos_T>())).lnum as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pos_T),
            "::",
            stringify!(lnum)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pos_T>())).col as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(pos_T),
            "::",
            stringify!(col)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pos_T>())).coladd as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(pos_T),
            "::",
            stringify!(coladd)
        )
    );
}
pub type buf_T = file_buffer;
pub const msgPriority_T_MSG_INFO: msgPriority_T = 0;
pub const msgPriority_T_MSG_WARNING: msgPriority_T = 1;
pub const msgPriority_T_MSG_ERROR: msgPriority_T = 2;
pub type msgPriority_T = ::std::os::raw::c_uint;
pub const windowSplit_T_SPLIT_HORIZONTAL: windowSplit_T = 0;
pub const windowSplit_T_SPLIT_HORIZONTAL_NEW: windowSplit_T = 1;
pub const windowSplit_T_SPLIT_VERTICAL: windowSplit_T = 2;
pub const windowSplit_T_SPLIT_VERTICAL_NEW: windowSplit_T = 3;
pub const windowSplit_T_SPLIT_TAB: windowSplit_T = 4;
pub const windowSplit_T_SPLIT_TAB_NEW: windowSplit_T = 5;
pub type windowSplit_T = ::std::os::raw::c_uint;
pub const windowMovement_T_WIN_CURSOR_LEFT: windowMovement_T = 0;
pub const windowMovement_T_WIN_CURSOR_RIGHT: windowMovement_T = 1;
pub const windowMovement_T_WIN_CURSOR_UP: windowMovement_T = 2;
pub const windowMovement_T_WIN_CURSOR_DOWN: windowMovement_T = 3;
pub const windowMovement_T_WIN_MOVE_FULL_LEFT: windowMovement_T = 4;
pub const windowMovement_T_WIN_MOVE_FULL_RIGHT: windowMovement_T = 5;
pub const windowMovement_T_WIN_MOVE_FULL_UP: windowMovement_T = 6;
pub const windowMovement_T_WIN_MOVE_FULL_DOWN: windowMovement_T = 7;
pub const windowMovement_T_WIN_CURSOR_TOP_LEFT: windowMovement_T = 8;
pub const windowMovement_T_WIN_CURSOR_BOTTOM_RIGHT: windowMovement_T = 9;
pub const windowMovement_T_WIN_CURSOR_PREVIOUS: windowMovement_T = 10;
pub const windowMovement_T_WIN_MOVE_ROTATE_DOWNWARDS: windowMovement_T = 11;
pub const windowMovement_T_WIN_MOVE_ROTATE_UPWARDS: windowMovement_T = 12;
pub type windowMovement_T = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct exCommand_T {
    pub cmd: *mut char_u,
    pub forceit: ::std::os::raw::c_int,
    pub regname: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_exCommand_T() {
    assert_eq!(
        ::std::mem::size_of::<exCommand_T>(),
        16usize,
        concat!("Size of: ", stringify!(exCommand_T))
    );
    assert_eq!(
        ::std::mem::align_of::<exCommand_T>(),
        8usize,
        concat!("Alignment of ", stringify!(exCommand_T))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<exCommand_T>())).cmd as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(exCommand_T),
            "::",
            stringify!(cmd)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<exCommand_T>())).forceit as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(exCommand_T),
            "::",
            stringify!(forceit)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<exCommand_T>())).regname as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(exCommand_T),
            "::",
            stringify!(regname)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct yankInfo_T {
    pub op_char: ::std::os::raw::c_int,
    pub extra_op_char: ::std::os::raw::c_int,
    pub regname: ::std::os::raw::c_int,
    pub blockType: ::std::os::raw::c_int,
    pub start: pos_T,
    pub end: pos_T,
    pub numLines: ::std::os::raw::c_int,
    pub lines: *mut *mut char_u,
}
#[test]
fn bindgen_test_layout_yankInfo_T() {
    assert_eq!(
        ::std::mem::size_of::<yankInfo_T>(),
        64usize,
        concat!("Size of: ", stringify!(yankInfo_T))
    );
    assert_eq!(
        ::std::mem::align_of::<yankInfo_T>(),
        8usize,
        concat!("Alignment of ", stringify!(yankInfo_T))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<yankInfo_T>())).op_char as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(yankInfo_T),
            "::",
            stringify!(op_char)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<yankInfo_T>())).extra_op_char as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(yankInfo_T),
            "::",
            stringify!(extra_op_char)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<yankInfo_T>())).regname as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(yankInfo_T),
            "::",
            stringify!(regname)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<yankInfo_T>())).blockType as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(yankInfo_T),
            "::",
            stringify!(blockType)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<yankInfo_T>())).start as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(yankInfo_T),
            "::",
            stringify!(start)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<yankInfo_T>())).end as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(yankInfo_T),
            "::",
            stringify!(end)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<yankInfo_T>())).numLines as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(yankInfo_T),
            "::",
            stringify!(numLines)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<yankInfo_T>())).lines as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(yankInfo_T),
            "::",
            stringify!(lines)
        )
    );
}
pub const gotoTarget_T_DEFINITION: gotoTarget_T = 0;
pub const gotoTarget_T_DECLARATION: gotoTarget_T = 1;
pub const gotoTarget_T_IMPLEMENTATION: gotoTarget_T = 2;
pub const gotoTarget_T_TYPEDEFINITION: gotoTarget_T = 3;
pub const gotoTarget_T_HOVER: gotoTarget_T = 4;
pub const gotoTarget_T_OUTLINE: gotoTarget_T = 5;
pub const gotoTarget_T_MESSAGES: gotoTarget_T = 6;
pub type gotoTarget_T = ::std::os::raw::c_uint;
pub const clearTarget_T_CLEAR_MESSAGES: clearTarget_T = 0;
pub type clearTarget_T = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct clearRequest_T {
    pub count: ::std::os::raw::c_int,
    pub target: clearTarget_T,
}
#[test]
fn bindgen_test_layout_clearRequest_T() {
    assert_eq!(
        ::std::mem::size_of::<clearRequest_T>(),
        8usize,
        concat!("Size of: ", stringify!(clearRequest_T))
    );
    assert_eq!(
        ::std::mem::align_of::<clearRequest_T>(),
        4usize,
        concat!("Alignment of ", stringify!(clearRequest_T))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<clearRequest_T>())).count as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(clearRequest_T),
            "::",
            stringify!(count)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<clearRequest_T>())).target as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(clearRequest_T),
            "::",
            stringify!(target)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gotoRequest_T {
    pub count: ::std::os::raw::c_int,
    pub location: pos_T,
    pub target: gotoTarget_T,
}
#[test]
fn bindgen_test_layout_gotoRequest_T() {
    assert_eq!(
        ::std::mem::size_of::<gotoRequest_T>(),
        32usize,
        concat!("Size of: ", stringify!(gotoRequest_T))
    );
    assert_eq!(
        ::std::mem::align_of::<gotoRequest_T>(),
        8usize,
        concat!("Alignment of ", stringify!(gotoRequest_T))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gotoRequest_T>())).count as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(gotoRequest_T),
            "::",
            stringify!(count)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gotoRequest_T>())).location as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(gotoRequest_T),
            "::",
            stringify!(location)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gotoRequest_T>())).target as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(gotoRequest_T),
            "::",
            stringify!(target)
        )
    );
}
pub const scrollDirection_T_SCROLL_CURSOR_CENTERV: scrollDirection_T = 0;
pub const scrollDirection_T_SCROLL_CURSOR_CENTERH: scrollDirection_T = 1;
pub const scrollDirection_T_SCROLL_CURSOR_TOP: scrollDirection_T = 2;
pub const scrollDirection_T_SCROLL_CURSOR_BOTTOM: scrollDirection_T = 3;
pub const scrollDirection_T_SCROLL_CURSOR_LEFT: scrollDirection_T = 4;
pub const scrollDirection_T_SCROLL_CURSOR_RIGHT: scrollDirection_T = 5;
pub const scrollDirection_T_SCROLL_LINE_UP: scrollDirection_T = 6;
pub const scrollDirection_T_SCROLL_LINE_DOWN: scrollDirection_T = 7;
pub const scrollDirection_T_SCROLL_HALFPAGE_DOWN: scrollDirection_T = 8;
pub const scrollDirection_T_SCROLL_HALFPAGE_UP: scrollDirection_T = 9;
pub const scrollDirection_T_SCROLL_PAGE_DOWN: scrollDirection_T = 10;
pub const scrollDirection_T_SCROLL_PAGE_UP: scrollDirection_T = 11;
pub const scrollDirection_T_SCROLL_HALFPAGE_LEFT: scrollDirection_T = 12;
pub const scrollDirection_T_SCROLL_HALFPAGE_RIGHT: scrollDirection_T = 13;
pub const scrollDirection_T_SCROLL_COLUMN_LEFT: scrollDirection_T = 14;
pub const scrollDirection_T_SCROLL_COLUMN_RIGHT: scrollDirection_T = 15;
pub type scrollDirection_T = ::std::os::raw::c_uint;
pub const subMode_T_SM_NONE: subMode_T = 0;
pub const subMode_T_SM_INSERT_LITERAL: subMode_T = 1;
pub type subMode_T = ::std::os::raw::c_uint;
pub const tabPageKind_T_GOTO: tabPageKind_T = 0;
pub const tabPageKind_T_MOVE: tabPageKind_T = 1;
pub const tabPageKind_T_CLOSE: tabPageKind_T = 2;
pub const tabPageKind_T_ONLY: tabPageKind_T = 3;
pub type tabPageKind_T = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tabPageRequest_T {
    pub kind: tabPageKind_T,
    pub arg: ::std::os::raw::c_int,
    pub relative: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_tabPageRequest_T() {
    assert_eq!(
        ::std::mem::size_of::<tabPageRequest_T>(),
        12usize,
        concat!("Size of: ", stringify!(tabPageRequest_T))
    );
    assert_eq!(
        ::std::mem::align_of::<tabPageRequest_T>(),
        4usize,
        concat!("Alignment of ", stringify!(tabPageRequest_T))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tabPageRequest_T>())).kind as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tabPageRequest_T),
            "::",
            stringify!(kind)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tabPageRequest_T>())).arg as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(tabPageRequest_T),
            "::",
            stringify!(arg)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tabPageRequest_T>())).relative as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tabPageRequest_T),
            "::",
            stringify!(relative)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct terminalRequest_t {
    pub cmd: *mut char_u,
    pub rows: ::std::os::raw::c_int,
    pub cols: ::std::os::raw::c_int,
    pub curwin: ::std::os::raw::c_int,
    pub finish: ::std::os::raw::c_char,
    pub hidden: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_terminalRequest_t() {
    assert_eq!(
        ::std::mem::size_of::<terminalRequest_t>(),
        32usize,
        concat!("Size of: ", stringify!(terminalRequest_t))
    );
    assert_eq!(
        ::std::mem::align_of::<terminalRequest_t>(),
        8usize,
        concat!("Alignment of ", stringify!(terminalRequest_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<terminalRequest_t>())).cmd as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(terminalRequest_t),
            "::",
            stringify!(cmd)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<terminalRequest_t>())).rows as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(terminalRequest_t),
            "::",
            stringify!(rows)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<terminalRequest_t>())).cols as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(terminalRequest_t),
            "::",
            stringify!(cols)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<terminalRequest_t>())).curwin as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(terminalRequest_t),
            "::",
            stringify!(curwin)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<terminalRequest_t>())).finish as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(terminalRequest_t),
            "::",
            stringify!(finish)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<terminalRequest_t>())).hidden as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(terminalRequest_t),
            "::",
            stringify!(hidden)
        )
    );
}
pub const formatRequestType_T_INDENTATION: formatRequestType_T = 0;
pub const formatRequestType_T_FORMATTING: formatRequestType_T = 1;
pub type formatRequestType_T = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct formatRequest_T {
    pub formatType: formatRequestType_T,
    pub returnCursor: ::std::os::raw::c_int,
    pub start: pos_T,
    pub end: pos_T,
    pub buf: *mut buf_T,
    pub cmd: *mut char_u,
}
#[test]
fn bindgen_test_layout_formatRequest_T() {
    assert_eq!(
        ::std::mem::size_of::<formatRequest_T>(),
        56usize,
        concat!("Size of: ", stringify!(formatRequest_T))
    );
    assert_eq!(
        ::std::mem::align_of::<formatRequest_T>(),
        8usize,
        concat!("Alignment of ", stringify!(formatRequest_T))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<formatRequest_T>())).formatType as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(formatRequest_T),
            "::",
            stringify!(formatType)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<formatRequest_T>())).returnCursor as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(formatRequest_T),
            "::",
            stringify!(returnCursor)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<formatRequest_T>())).start as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(formatRequest_T),
            "::",
            stringify!(start)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<formatRequest_T>())).end as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(formatRequest_T),
            "::",
            stringify!(end)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<formatRequest_T>())).buf as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(formatRequest_T),
            "::",
            stringify!(buf)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<formatRequest_T>())).cmd as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(formatRequest_T),
            "::",
            stringify!(cmd)
        )
    );
}
pub type ClipboardGetCallback = ::std::option::Option<
    unsafe extern "C" fn(
        regname: ::std::os::raw::c_int,
        num_lines: *mut ::std::os::raw::c_int,
        lines: *mut *mut *mut char_u,
        blockType: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int,
>;
pub type ColorSchemeChangedCallback =
    ::std::option::Option<unsafe extern "C" fn(colorScheme: *mut char_u) -> ::std::os::raw::c_int>;
pub type CursorAddCallback = ::std::option::Option<unsafe extern "C" fn(cursor: pos_T)>;
pub type ColorSchemeCompletionCallback = ::std::option::Option<
    unsafe extern "C" fn(
        filter: *mut char_u,
        num_colorschemes: *mut ::std::os::raw::c_int,
        colorschemes: *mut *mut *mut char_u,
    ) -> ::std::os::raw::c_int,
>;
pub type FormatCallback =
    ::std::option::Option<unsafe extern "C" fn(formatRequest: *mut formatRequest_T)>;
pub type AutoIndentCallback = ::std::option::Option<
    unsafe extern "C" fn(
        lnum: ::std::os::raw::c_int,
        buf: *mut buf_T,
        prevLine: *mut char_u,
        currentLine: *mut char_u,
    ) -> ::std::os::raw::c_int,
>;
pub type MacroStartRecordCallback =
    ::std::option::Option<unsafe extern "C" fn(regname: ::std::os::raw::c_int)>;
pub type MacroStopRecordCallback = ::std::option::Option<
    unsafe extern "C" fn(regname: ::std::os::raw::c_int, regvalue: *mut char_u),
>;
pub type VoidCallback = ::std::option::Option<unsafe extern "C" fn()>;
pub type WindowSplitCallback =
    ::std::option::Option<unsafe extern "C" fn(splitType: windowSplit_T, fname: *mut char_u)>;
pub type WindowMovementCallback = ::std::option::Option<
    unsafe extern "C" fn(movementType: windowMovement_T, count: ::std::os::raw::c_int),
>;
pub type YankCallback = ::std::option::Option<unsafe extern "C" fn(yankInfo: *mut yankInfo_T)>;
pub type TerminalCallback =
    ::std::option::Option<unsafe extern "C" fn(terminalRequest: *mut terminalRequest_t)>;
pub type ClearCallback = ::std::option::Option<unsafe extern "C" fn(clearInfo: clearRequest_T)>;
pub type GotoCallback =
    ::std::option::Option<unsafe extern "C" fn(gotoInfo: gotoRequest_T) -> ::std::os::raw::c_int>;
pub type ScrollCallback = ::std::option::Option<
    unsafe extern "C" fn(dir: scrollDirection_T, count: ::std::os::raw::c_long),
>;
pub type TabPageCallback = ::std::option::Option<
    unsafe extern "C" fn(tabPageInfo: tabPageRequest_T) -> ::std::os::raw::c_int,
>;
pub type FunctionGetCharCallback = ::std::option::Option<
    unsafe extern "C" fn(
        mode: ::std::os::raw::c_int,
        character: *mut ::std::os::raw::c_char,
        modMask: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int,
>;
pub const screenLineMotion_T_MOTION_H: screenLineMotion_T = 0;
pub const screenLineMotion_T_MOTION_L: screenLineMotion_T = 1;
pub const screenLineMotion_T_MOTION_M: screenLineMotion_T = 2;
pub type screenLineMotion_T = ::std::os::raw::c_uint;
pub type CursorMoveScreenLineCallback = ::std::option::Option<
    unsafe extern "C" fn(
        motion: screenLineMotion_T,
        count: ::std::os::raw::c_int,
        startLine: linenr_T,
        destLine: *mut linenr_T,
    ),
>;
pub type CursorMoveScreenPositionCallback = ::std::option::Option<
    unsafe extern "C" fn(
        direction: ::std::os::raw::c_int,
        count: ::std::os::raw::c_int,
        lnum: linenr_T,
        cursor: colnr_T,
        curswant: colnr_T,
        destLnum: *mut linenr_T,
        destCol: *mut colnr_T,
    ),
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct msg_T {
    pub contents: sds,
    pub title: sds,
    pub priority: msgPriority_T,
}
#[test]
fn bindgen_test_layout_msg_T() {
    assert_eq!(
        ::std::mem::size_of::<msg_T>(),
        24usize,
        concat!("Size of: ", stringify!(msg_T))
    );
    assert_eq!(
        ::std::mem::align_of::<msg_T>(),
        8usize,
        concat!("Alignment of ", stringify!(msg_T))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<msg_T>())).contents as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(msg_T),
            "::",
            stringify!(contents)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<msg_T>())).title as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(msg_T),
            "::",
            stringify!(title)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<msg_T>())).priority as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(msg_T),
            "::",
            stringify!(priority)
        )
    );
}
pub const executionStatus_T_HANDLED: executionStatus_T = 0;
pub const executionStatus_T_COMPLETED: executionStatus_T = 1;
pub const executionStatus_T_UNHANDLED: executionStatus_T = 2;
pub const executionStatus_T_COMPLETED_UNHANDLED: executionStatus_T = 3;
pub type executionStatus_T = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lpos_T {
    pub lnum: linenr_T,
    pub col: colnr_T,
}
#[test]
fn bindgen_test_layout_lpos_T() {
    assert_eq!(
        ::std::mem::size_of::<lpos_T>(),
        16usize,
        concat!("Size of: ", stringify!(lpos_T))
    );
    assert_eq!(
        ::std::mem::align_of::<lpos_T>(),
        8usize,
        concat!("Alignment of ", stringify!(lpos_T))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lpos_T>())).lnum as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lpos_T),
            "::",
            stringify!(lnum)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lpos_T>())).col as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lpos_T),
            "::",
            stringify!(col)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct growarray {
    pub ga_len: ::std::os::raw::c_int,
    pub ga_maxlen: ::std::os::raw::c_int,
    pub ga_itemsize: ::std::os::raw::c_int,
    pub ga_growsize: ::std::os::raw::c_int,
    pub ga_data: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_growarray() {
    assert_eq!(
        ::std::mem::size_of::<growarray>(),
        24usize,
        concat!("Size of: ", stringify!(growarray))
    );
    assert_eq!(
        ::std::mem::align_of::<growarray>(),
        8usize,
        concat!("Alignment of ", stringify!(growarray))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<growarray>())).ga_len as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(growarray),
            "::",
            stringify!(ga_len)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<growarray>())).ga_maxlen as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(growarray),
            "::",
            stringify!(ga_maxlen)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<growarray>())).ga_itemsize as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(growarray),
            "::",
            stringify!(ga_itemsize)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<growarray>())).ga_growsize as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(growarray),
            "::",
            stringify!(ga_growsize)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<growarray>())).ga_data as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(growarray),
            "::",
            stringify!(ga_data)
        )
    );
}
pub type garray_T = growarray;
pub type win_T = window_S;
pub type wininfo_T = wininfo_S;
pub type frame_T = frame_S;
pub type scid_T = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct terminal_S {
    _unused: [u8; 0],
}
pub type term_T = terminal_S;
pub type AutoCommandCallback =
    ::std::option::Option<unsafe extern "C" fn(arg1: event_T, buf: *mut buf_T)>;
pub type CustomCommandCallback =
    ::std::option::Option<unsafe extern "C" fn(eap: *mut exCommand_T) -> ::std::os::raw::c_int>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sctx_T {
    pub sc_sid: scid_T,
    pub sc_seq: ::std::os::raw::c_int,
    pub sc_lnum: linenr_T,
    pub sc_version: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_sctx_T() {
    assert_eq!(
        ::std::mem::size_of::<sctx_T>(),
        24usize,
        concat!("Size of: ", stringify!(sctx_T))
    );
    assert_eq!(
        ::std::mem::align_of::<sctx_T>(),
        8usize,
        concat!("Alignment of ", stringify!(sctx_T))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<sctx_T>())).sc_sid as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sctx_T),
            "::",
            stringify!(sc_sid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<sctx_T>())).sc_seq as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(sctx_T),
            "::",
            stringify!(sc_seq)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<sctx_T>())).sc_lnum as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(sctx_T),
            "::",
            stringify!(sc_lnum)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<sctx_T>())).sc_version as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(sctx_T),
            "::",
            stringify!(sc_version)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct bufref_T {
    pub br_buf: *mut buf_T,
    pub br_fnum: ::std::os::raw::c_int,
    pub br_buf_free_count: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_bufref_T() {
    assert_eq!(
        ::std::mem::size_of::<bufref_T>(),
        16usize,
        concat!("Size of: ", stringify!(bufref_T))
    );
    assert_eq!(
        ::std::mem::align_of::<bufref_T>(),
        8usize,
        concat!("Alignment of ", stringify!(bufref_T))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<bufref_T>())).br_buf as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bufref_T),
            "::",
            stringify!(br_buf)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<bufref_T>())).br_fnum as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(bufref_T),
            "::",
            stringify!(br_fnum)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<bufref_T>())).br_buf_free_count as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(bufref_T),
            "::",
            stringify!(br_buf_free_count)
        )
    );
}
pub type regengine_T = regengine;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct regprog {
    pub engine: *mut regengine_T,
    pub regflags: ::std::os::raw::c_uint,
    pub re_engine: ::std::os::raw::c_uint,
    pub re_flags: ::std::os::raw::c_uint,
    pub re_in_use: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_regprog() {
    assert_eq!(
        ::std::mem::size_of::<regprog>(),
        24usize,
        concat!("Size of: ", stringify!(regprog))
    );
    assert_eq!(
        ::std::mem::align_of::<regprog>(),
        8usize,
        concat!("Alignment of ", stringify!(regprog))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<regprog>())).engine as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(regprog),
            "::",
            stringify!(engine)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<regprog>())).regflags as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(regprog),
            "::",
            stringify!(regflags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<regprog>())).re_engine as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(regprog),
            "::",
            stringify!(re_engine)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<regprog>())).re_flags as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(regprog),
            "::",
            stringify!(re_flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<regprog>())).re_in_use as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(regprog),
            "::",
            stringify!(re_in_use)
        )
    );
}
pub type regprog_T = regprog;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct bt_regprog_T {
    pub engine: *mut regengine_T,
    pub regflags: ::std::os::raw::c_uint,
    pub re_engine: ::std::os::raw::c_uint,
    pub re_flags: ::std::os::raw::c_uint,
    pub re_in_use: ::std::os::raw::c_int,
    pub regstart: ::std::os::raw::c_int,
    pub reganch: char_u,
    pub regmust: *mut char_u,
    pub regmlen: ::std::os::raw::c_int,
    pub program: [char_u; 1usize],
}
#[test]
fn bindgen_test_layout_bt_regprog_T() {
    assert_eq!(
        ::std::mem::size_of::<bt_regprog_T>(),
        48usize,
        concat!("Size of: ", stringify!(bt_regprog_T))
    );
    assert_eq!(
        ::std::mem::align_of::<bt_regprog_T>(),
        8usize,
        concat!("Alignment of ", stringify!(bt_regprog_T))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<bt_regprog_T>())).engine as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bt_regprog_T),
            "::",
            stringify!(engine)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<bt_regprog_T>())).regflags as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(bt_regprog_T),
            "::",
            stringify!(regflags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<bt_regprog_T>())).re_engine as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(bt_regprog_T),
            "::",
            stringify!(re_engine)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<bt_regprog_T>())).re_flags as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(bt_regprog_T),
            "::",
            stringify!(re_flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<bt_regprog_T>())).re_in_use as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(bt_regprog_T),
            "::",
            stringify!(re_in_use)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<bt_regprog_T>())).regstart as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(bt_regprog_T),
            "::",
            stringify!(regstart)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<bt_regprog_T>())).reganch as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(bt_regprog_T),
            "::",
            stringify!(reganch)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<bt_regprog_T>())).regmust as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(bt_regprog_T),
            "::",
            stringify!(regmust)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<bt_regprog_T>())).regmlen as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(bt_regprog_T),
            "::",
            stringify!(regmlen)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<bt_regprog_T>())).program as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(bt_regprog_T),
            "::",
            stringify!(program)
        )
    );
}
pub type nfa_state_T = nfa_state;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct nfa_state {
    pub c: ::std::os::raw::c_int,
    pub out: *mut nfa_state_T,
    pub out1: *mut nfa_state_T,
    pub id: ::std::os::raw::c_int,
    pub lastlist: [::std::os::raw::c_int; 2usize],
    pub val: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_nfa_state() {
    assert_eq!(
        ::std::mem::size_of::<nfa_state>(),
        40usize,
        concat!("Size of: ", stringify!(nfa_state))
    );
    assert_eq!(
        ::std::mem::align_of::<nfa_state>(),
        8usize,
        concat!("Alignment of ", stringify!(nfa_state))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nfa_state>())).c as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nfa_state),
            "::",
            stringify!(c)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nfa_state>())).out as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(nfa_state),
            "::",
            stringify!(out)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nfa_state>())).out1 as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(nfa_state),
            "::",
            stringify!(out1)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nfa_state>())).id as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(nfa_state),
            "::",
            stringify!(id)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nfa_state>())).lastlist as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(nfa_state),
            "::",
            stringify!(lastlist)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nfa_state>())).val as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(nfa_state),
            "::",
            stringify!(val)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct nfa_regprog_T {
    pub engine: *mut regengine_T,
    pub regflags: ::std::os::raw::c_uint,
    pub re_engine: ::std::os::raw::c_uint,
    pub re_flags: ::std::os::raw::c_uint,
    pub re_in_use: ::std::os::raw::c_int,
    pub start: *mut nfa_state_T,
    pub reganch: ::std::os::raw::c_int,
    pub regstart: ::std::os::raw::c_int,
    pub match_text: *mut char_u,
    pub has_zend: ::std::os::raw::c_int,
    pub has_backref: ::std::os::raw::c_int,
    pub pattern: *mut char_u,
    pub nsubexp: ::std::os::raw::c_int,
    pub nstate: ::std::os::raw::c_int,
    pub state: [nfa_state_T; 1usize],
}
#[test]
fn bindgen_test_layout_nfa_regprog_T() {
    assert_eq!(
        ::std::mem::size_of::<nfa_regprog_T>(),
        112usize,
        concat!("Size of: ", stringify!(nfa_regprog_T))
    );
    assert_eq!(
        ::std::mem::align_of::<nfa_regprog_T>(),
        8usize,
        concat!("Alignment of ", stringify!(nfa_regprog_T))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nfa_regprog_T>())).engine as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nfa_regprog_T),
            "::",
            stringify!(engine)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nfa_regprog_T>())).regflags as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(nfa_regprog_T),
            "::",
            stringify!(regflags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nfa_regprog_T>())).re_engine as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(nfa_regprog_T),
            "::",
            stringify!(re_engine)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nfa_regprog_T>())).re_flags as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(nfa_regprog_T),
            "::",
            stringify!(re_flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nfa_regprog_T>())).re_in_use as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(nfa_regprog_T),
            "::",
            stringify!(re_in_use)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nfa_regprog_T>())).start as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(nfa_regprog_T),
            "::",
            stringify!(start)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nfa_regprog_T>())).reganch as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(nfa_regprog_T),
            "::",
            stringify!(reganch)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nfa_regprog_T>())).regstart as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(nfa_regprog_T),
            "::",
            stringify!(regstart)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nfa_regprog_T>())).match_text as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(nfa_regprog_T),
            "::",
            stringify!(match_text)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nfa_regprog_T>())).has_zend as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(nfa_regprog_T),
            "::",
            stringify!(has_zend)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nfa_regprog_T>())).has_backref as *const _ as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(nfa_regprog_T),
            "::",
            stringify!(has_backref)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nfa_regprog_T>())).pattern as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(nfa_regprog_T),
            "::",
            stringify!(pattern)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nfa_regprog_T>())).nsubexp as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(nfa_regprog_T),
            "::",
            stringify!(nsubexp)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nfa_regprog_T>())).nstate as *const _ as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(nfa_regprog_T),
            "::",
            stringify!(nstate)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nfa_regprog_T>())).state as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(nfa_regprog_T),
            "::",
            stringify!(state)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct regmatch_T {
    pub regprog: *mut regprog_T,
    pub startp: [*mut char_u; 10usize],
    pub endp: [*mut char_u; 10usize],
    pub rm_ic: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_regmatch_T() {
    assert_eq!(
        ::std::mem::size_of::<regmatch_T>(),
        176usize,
        concat!("Size of: ", stringify!(regmatch_T))
    );
    assert_eq!(
        ::std::mem::align_of::<regmatch_T>(),
        8usize,
        concat!("Alignment of ", stringify!(regmatch_T))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<regmatch_T>())).regprog as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_T),
            "::",
            stringify!(regprog)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<regmatch_T>())).startp as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_T),
            "::",
            stringify!(startp)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<regmatch_T>())).endp as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_T),
            "::",
            stringify!(endp)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<regmatch_T>())).rm_ic as *const _ as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_T),
            "::",
            stringify!(rm_ic)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct regmmatch_T {
    pub regprog: *mut regprog_T,
    pub startpos: [lpos_T; 10usize],
    pub endpos: [lpos_T; 10usize],
    pub rmm_ic: ::std::os::raw::c_int,
    pub rmm_maxcol: colnr_T,
}
#[test]
fn bindgen_test_layout_regmmatch_T() {
    assert_eq!(
        ::std::mem::size_of::<regmmatch_T>(),
        336usize,
        concat!("Size of: ", stringify!(regmmatch_T))
    );
    assert_eq!(
        ::std::mem::align_of::<regmmatch_T>(),
        8usize,
        concat!("Alignment of ", stringify!(regmmatch_T))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<regmmatch_T>())).regprog as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(regmmatch_T),
            "::",
            stringify!(regprog)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<regmmatch_T>())).startpos as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(regmmatch_T),
            "::",
            stringify!(startpos)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<regmmatch_T>())).endpos as *const _ as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(regmmatch_T),
            "::",
            stringify!(endpos)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<regmmatch_T>())).rmm_ic as *const _ as usize },
        328usize,
        concat!(
            "Offset of field: ",
            stringify!(regmmatch_T),
            "::",
            stringify!(rmm_ic)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<regmmatch_T>())).rmm_maxcol as *const _ as usize },
        332usize,
        concat!(
            "Offset of field: ",
            stringify!(regmmatch_T),
            "::",
            stringify!(rmm_maxcol)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct reg_extmatch_T {
    pub refcnt: ::std::os::raw::c_short,
    pub matches: [*mut char_u; 10usize],
}
#[test]
fn bindgen_test_layout_reg_extmatch_T() {
    assert_eq!(
        ::std::mem::size_of::<reg_extmatch_T>(),
        88usize,
        concat!("Size of: ", stringify!(reg_extmatch_T))
    );
    assert_eq!(
        ::std::mem::align_of::<reg_extmatch_T>(),
        8usize,
        concat!("Alignment of ", stringify!(reg_extmatch_T))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<reg_extmatch_T>())).refcnt as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(reg_extmatch_T),
            "::",
            stringify!(refcnt)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<reg_extmatch_T>())).matches as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(reg_extmatch_T),
            "::",
            stringify!(matches)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct regengine {
    pub regcomp: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut char_u, arg2: ::std::os::raw::c_int) -> *mut regprog_T,
    >,
    pub regfree: ::std::option::Option<unsafe extern "C" fn(arg1: *mut regprog_T)>,
    pub regexec_nl: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut regmatch_T,
            arg2: *mut char_u,
            arg3: colnr_T,
            arg4: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    pub regexec_multi: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut regmmatch_T,
            arg2: *mut win_T,
            arg3: *mut buf_T,
            arg4: linenr_T,
            arg5: colnr_T,
            arg6: *mut proftime_T,
            arg7: *mut ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_long,
    >,
    pub expr: *mut char_u,
}
#[test]
fn bindgen_test_layout_regengine() {
    assert_eq!(
        ::std::mem::size_of::<regengine>(),
        40usize,
        concat!("Size of: ", stringify!(regengine))
    );
    assert_eq!(
        ::std::mem::align_of::<regengine>(),
        8usize,
        concat!("Alignment of ", stringify!(regengine))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<regengine>())).regcomp as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(regengine),
            "::",
            stringify!(regcomp)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<regengine>())).regfree as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(regengine),
            "::",
            stringify!(regfree)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<regengine>())).regexec_nl as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(regengine),
            "::",
            stringify!(regexec_nl)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<regengine>())).regexec_multi as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(regengine),
            "::",
            stringify!(regexec_multi)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<regengine>())).expr as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(regengine),
            "::",
            stringify!(expr)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct filemark {
    pub mark: pos_T,
    pub fnum: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_filemark() {
    assert_eq!(
        ::std::mem::size_of::<filemark>(),
        24usize,
        concat!("Size of: ", stringify!(filemark))
    );
    assert_eq!(
        ::std::mem::align_of::<filemark>(),
        8usize,
        concat!("Alignment of ", stringify!(filemark))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<filemark>())).mark as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(filemark),
            "::",
            stringify!(mark)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<filemark>())).fnum as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(filemark),
            "::",
            stringify!(fnum)
        )
    );
}
pub type fmark_T = filemark;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xfilemark {
    pub fmark: fmark_T,
    pub fname: *mut char_u,
    pub time_set: time_T,
}
#[test]
fn bindgen_test_layout_xfilemark() {
    assert_eq!(
        ::std::mem::size_of::<xfilemark>(),
        40usize,
        concat!("Size of: ", stringify!(xfilemark))
    );
    assert_eq!(
        ::std::mem::align_of::<xfilemark>(),
        8usize,
        concat!("Alignment of ", stringify!(xfilemark))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<xfilemark>())).fmark as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(xfilemark),
            "::",
            stringify!(fmark)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<xfilemark>())).fname as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(xfilemark),
            "::",
            stringify!(fname)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<xfilemark>())).time_set as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(xfilemark),
            "::",
            stringify!(time_set)
        )
    );
}
pub type xfmark_T = xfilemark;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct taggy {
    pub tagname: *mut char_u,
    pub fmark: fmark_T,
    pub cur_match: ::std::os::raw::c_int,
    pub cur_fnum: ::std::os::raw::c_int,
    pub user_data: *mut char_u,
}
#[test]
fn bindgen_test_layout_taggy() {
    assert_eq!(
        ::std::mem::size_of::<taggy>(),
        48usize,
        concat!("Size of: ", stringify!(taggy))
    );
    assert_eq!(
        ::std::mem::align_of::<taggy>(),
        8usize,
        concat!("Alignment of ", stringify!(taggy))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<taggy>())).tagname as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(taggy),
            "::",
            stringify!(tagname)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<taggy>())).fmark as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(taggy),
            "::",
            stringify!(fmark)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<taggy>())).cur_match as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(taggy),
            "::",
            stringify!(cur_match)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<taggy>())).cur_fnum as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(taggy),
            "::",
            stringify!(cur_fnum)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<taggy>())).user_data as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(taggy),
            "::",
            stringify!(user_data)
        )
    );
}
pub type taggy_T = taggy;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct winopt_T {
    pub wo_bri: ::std::os::raw::c_int,
    pub wo_briopt: *mut char_u,
    pub wo_wcr: *mut char_u,
    pub wo_diff: ::std::os::raw::c_int,
    pub wo_fdc: ::std::os::raw::c_long,
    pub wo_fdc_save: ::std::os::raw::c_int,
    pub wo_fen: ::std::os::raw::c_int,
    pub wo_fen_save: ::std::os::raw::c_int,
    pub wo_fdi: *mut char_u,
    pub wo_fdl: ::std::os::raw::c_long,
    pub wo_fdl_save: ::std::os::raw::c_int,
    pub wo_fdm: *mut char_u,
    pub wo_fdm_save: *mut char_u,
    pub wo_fml: ::std::os::raw::c_long,
    pub wo_fdn: ::std::os::raw::c_long,
    pub wo_fde: *mut char_u,
    pub wo_fdt: *mut char_u,
    pub wo_fmr: *mut char_u,
    pub wo_lbr: ::std::os::raw::c_int,
    pub wo_list: ::std::os::raw::c_int,
    pub wo_nu: ::std::os::raw::c_int,
    pub wo_rnu: ::std::os::raw::c_int,
    pub wo_nuw: ::std::os::raw::c_long,
    pub wo_wfh: ::std::os::raw::c_int,
    pub wo_wfw: ::std::os::raw::c_int,
    pub wo_pvw: ::std::os::raw::c_int,
    pub wo_scr: ::std::os::raw::c_long,
    pub wo_scb: ::std::os::raw::c_int,
    pub wo_diff_saved: ::std::os::raw::c_int,
    pub wo_scb_save: ::std::os::raw::c_int,
    pub wo_wrap: ::std::os::raw::c_int,
    pub wo_wrap_save: ::std::os::raw::c_int,
    pub wo_crb: ::std::os::raw::c_int,
    pub wo_crb_save: ::std::os::raw::c_int,
    pub wo_script_ctx: [sctx_T; 28usize],
}
#[test]
fn bindgen_test_layout_winopt_T() {
    assert_eq!(
        ::std::mem::size_of::<winopt_T>(),
        888usize,
        concat!("Size of: ", stringify!(winopt_T))
    );
    assert_eq!(
        ::std::mem::align_of::<winopt_T>(),
        8usize,
        concat!("Alignment of ", stringify!(winopt_T))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<winopt_T>())).wo_bri as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(winopt_T),
            "::",
            stringify!(wo_bri)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<winopt_T>())).wo_briopt as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(winopt_T),
            "::",
            stringify!(wo_briopt)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<winopt_T>())).wo_wcr as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(winopt_T),
            "::",
            stringify!(wo_wcr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<winopt_T>())).wo_diff as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(winopt_T),
            "::",
            stringify!(wo_diff)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<winopt_T>())).wo_fdc as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(winopt_T),
            "::",
            stringify!(wo_fdc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<winopt_T>())).wo_fdc_save as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(winopt_T),
            "::",
            stringify!(wo_fdc_save)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<winopt_T>())).wo_fen as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(winopt_T),
            "::",
            stringify!(wo_fen)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<winopt_T>())).wo_fen_save as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(winopt_T),
            "::",
            stringify!(wo_fen_save)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<winopt_T>())).wo_fdi as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(winopt_T),
            "::",
            stringify!(wo_fdi)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<winopt_T>())).wo_fdl as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(winopt_T),
            "::",
            stringify!(wo_fdl)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<winopt_T>())).wo_fdl_save as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(winopt_T),
            "::",
            stringify!(wo_fdl_save)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<winopt_T>())).wo_fdm as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(winopt_T),
            "::",
            stringify!(wo_fdm)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<winopt_T>())).wo_fdm_save as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(winopt_T),
            "::",
            stringify!(wo_fdm_save)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<winopt_T>())).wo_fml as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(winopt_T),
            "::",
            stringify!(wo_fml)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<winopt_T>())).wo_fdn as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(winopt_T),
            "::",
            stringify!(wo_fdn)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<winopt_T>())).wo_fde as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(winopt_T),
            "::",
            stringify!(wo_fde)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<winopt_T>())).wo_fdt as *const _ as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(winopt_T),
            "::",
            stringify!(wo_fdt)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<winopt_T>())).wo_fmr as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(winopt_T),
            "::",
            stringify!(wo_fmr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<winopt_T>())).wo_lbr as *const _ as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(winopt_T),
            "::",
            stringify!(wo_lbr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<winopt_T>())).wo_list as *const _ as usize },
        140usize,
        concat!(
            "Offset of field: ",
            stringify!(winopt_T),
            "::",
            stringify!(wo_list)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<winopt_T>())).wo_nu as *const _ as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(winopt_T),
            "::",
            stringify!(wo_nu)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<winopt_T>())).wo_rnu as *const _ as usize },
        148usize,
        concat!(
            "Offset of field: ",
            stringify!(winopt_T),
            "::",
            stringify!(wo_rnu)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<winopt_T>())).wo_nuw as *const _ as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(winopt_T),
            "::",
            stringify!(wo_nuw)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<winopt_T>())).wo_wfh as *const _ as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(winopt_T),
            "::",
            stringify!(wo_wfh)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<winopt_T>())).wo_wfw as *const _ as usize },
        164usize,
        concat!(
            "Offset of field: ",
            stringify!(winopt_T),
            "::",
            stringify!(wo_wfw)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<winopt_T>())).wo_pvw as *const _ as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(winopt_T),
            "::",
            stringify!(wo_pvw)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<winopt_T>())).wo_scr as *const _ as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(winopt_T),
            "::",
            stringify!(wo_scr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<winopt_T>())).wo_scb as *const _ as usize },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(winopt_T),
            "::",
            stringify!(wo_scb)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<winopt_T>())).wo_diff_saved as *const _ as usize },
        188usize,
        concat!(
            "Offset of field: ",
            stringify!(winopt_T),
            "::",
            stringify!(wo_diff_saved)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<winopt_T>())).wo_scb_save as *const _ as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(winopt_T),
            "::",
            stringify!(wo_scb_save)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<winopt_T>())).wo_wrap as *const _ as usize },
        196usize,
        concat!(
            "Offset of field: ",
            stringify!(winopt_T),
            "::",
            stringify!(wo_wrap)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<winopt_T>())).wo_wrap_save as *const _ as usize },
        200usize,
        concat!(
            "Offset of field: ",
            stringify!(winopt_T),
            "::",
            stringify!(wo_wrap_save)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<winopt_T>())).wo_crb as *const _ as usize },
        204usize,
        concat!(
            "Offset of field: ",
            stringify!(winopt_T),
            "::",
            stringify!(wo_crb)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<winopt_T>())).wo_crb_save as *const _ as usize },
        208usize,
        concat!(
            "Offset of field: ",
            stringify!(winopt_T),
            "::",
            stringify!(wo_crb_save)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<winopt_T>())).wo_script_ctx as *const _ as usize },
        216usize,
        concat!(
            "Offset of field: ",
            stringify!(winopt_T),
            "::",
            stringify!(wo_script_ctx)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wininfo_S {
    pub wi_next: *mut wininfo_T,
    pub wi_prev: *mut wininfo_T,
    pub wi_win: *mut win_T,
    pub wi_fpos: pos_T,
    pub wi_optset: ::std::os::raw::c_int,
    pub wi_opt: winopt_T,
    pub wi_fold_manual: ::std::os::raw::c_int,
    pub wi_folds: garray_T,
}
#[test]
fn bindgen_test_layout_wininfo_S() {
    assert_eq!(
        ::std::mem::size_of::<wininfo_S>(),
        968usize,
        concat!("Size of: ", stringify!(wininfo_S))
    );
    assert_eq!(
        ::std::mem::align_of::<wininfo_S>(),
        8usize,
        concat!("Alignment of ", stringify!(wininfo_S))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<wininfo_S>())).wi_next as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(wininfo_S),
            "::",
            stringify!(wi_next)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<wininfo_S>())).wi_prev as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(wininfo_S),
            "::",
            stringify!(wi_prev)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<wininfo_S>())).wi_win as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(wininfo_S),
            "::",
            stringify!(wi_win)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<wininfo_S>())).wi_fpos as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(wininfo_S),
            "::",
            stringify!(wi_fpos)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<wininfo_S>())).wi_optset as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(wininfo_S),
            "::",
            stringify!(wi_optset)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<wininfo_S>())).wi_opt as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(wininfo_S),
            "::",
            stringify!(wi_opt)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<wininfo_S>())).wi_fold_manual as *const _ as usize },
        936usize,
        concat!(
            "Offset of field: ",
            stringify!(wininfo_S),
            "::",
            stringify!(wi_fold_manual)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<wininfo_S>())).wi_folds as *const _ as usize },
        944usize,
        concat!(
            "Offset of field: ",
            stringify!(wininfo_S),
            "::",
            stringify!(wi_folds)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct foldinfo {
    pub fi_level: ::std::os::raw::c_int,
    pub fi_lnum: ::std::os::raw::c_int,
    pub fi_low_level: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_foldinfo() {
    assert_eq!(
        ::std::mem::size_of::<foldinfo>(),
        12usize,
        concat!("Size of: ", stringify!(foldinfo))
    );
    assert_eq!(
        ::std::mem::align_of::<foldinfo>(),
        4usize,
        concat!("Alignment of ", stringify!(foldinfo))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<foldinfo>())).fi_level as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(foldinfo),
            "::",
            stringify!(fi_level)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<foldinfo>())).fi_lnum as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(foldinfo),
            "::",
            stringify!(fi_lnum)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<foldinfo>())).fi_low_level as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(foldinfo),
            "::",
            stringify!(fi_low_level)
        )
    );
}
pub type foldinfo_T = foldinfo;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct visualinfo_T {
    pub vi_start: pos_T,
    pub vi_end: pos_T,
    pub vi_mode: ::std::os::raw::c_int,
    pub vi_curswant: colnr_T,
}
#[test]
fn bindgen_test_layout_visualinfo_T() {
    assert_eq!(
        ::std::mem::size_of::<visualinfo_T>(),
        40usize,
        concat!("Size of: ", stringify!(visualinfo_T))
    );
    assert_eq!(
        ::std::mem::align_of::<visualinfo_T>(),
        8usize,
        concat!("Alignment of ", stringify!(visualinfo_T))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<visualinfo_T>())).vi_start as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(visualinfo_T),
            "::",
            stringify!(vi_start)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<visualinfo_T>())).vi_end as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(visualinfo_T),
            "::",
            stringify!(vi_end)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<visualinfo_T>())).vi_mode as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(visualinfo_T),
            "::",
            stringify!(vi_mode)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<visualinfo_T>())).vi_curswant as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(visualinfo_T),
            "::",
            stringify!(vi_curswant)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct undoline_T {
    pub ul_line: *mut char_u,
    pub ul_len: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_undoline_T() {
    assert_eq!(
        ::std::mem::size_of::<undoline_T>(),
        16usize,
        concat!("Size of: ", stringify!(undoline_T))
    );
    assert_eq!(
        ::std::mem::align_of::<undoline_T>(),
        8usize,
        concat!("Alignment of ", stringify!(undoline_T))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<undoline_T>())).ul_line as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(undoline_T),
            "::",
            stringify!(ul_line)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<undoline_T>())).ul_len as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(undoline_T),
            "::",
            stringify!(ul_len)
        )
    );
}
pub type u_entry_T = u_entry;
pub type u_header_T = u_header;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct u_entry {
    pub ue_next: *mut u_entry_T,
    pub ue_top: linenr_T,
    pub ue_bot: linenr_T,
    pub ue_lcount: linenr_T,
    pub ue_array: *mut undoline_T,
    pub ue_size: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_u_entry() {
    assert_eq!(
        ::std::mem::size_of::<u_entry>(),
        48usize,
        concat!("Size of: ", stringify!(u_entry))
    );
    assert_eq!(
        ::std::mem::align_of::<u_entry>(),
        8usize,
        concat!("Alignment of ", stringify!(u_entry))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<u_entry>())).ue_next as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(u_entry),
            "::",
            stringify!(ue_next)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<u_entry>())).ue_top as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(u_entry),
            "::",
            stringify!(ue_top)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<u_entry>())).ue_bot as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(u_entry),
            "::",
            stringify!(ue_bot)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<u_entry>())).ue_lcount as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(u_entry),
            "::",
            stringify!(ue_lcount)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<u_entry>())).ue_array as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(u_entry),
            "::",
            stringify!(ue_array)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<u_entry>())).ue_size as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(u_entry),
            "::",
            stringify!(ue_size)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct u_header {
    pub uh_next: u_header__bindgen_ty_1,
    pub uh_prev: u_header__bindgen_ty_2,
    pub uh_alt_next: u_header__bindgen_ty_3,
    pub uh_alt_prev: u_header__bindgen_ty_4,
    pub uh_seq: ::std::os::raw::c_long,
    pub uh_walk: ::std::os::raw::c_int,
    pub uh_entry: *mut u_entry_T,
    pub uh_getbot_entry: *mut u_entry_T,
    pub uh_cursor: pos_T,
    pub uh_cursor_vcol: ::std::os::raw::c_long,
    pub uh_flags: ::std::os::raw::c_int,
    pub uh_namedm: [pos_T; 26usize],
    pub uh_visual: visualinfo_T,
    pub uh_time: time_T,
    pub uh_save_nr: ::std::os::raw::c_long,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union u_header__bindgen_ty_1 {
    pub ptr: *mut u_header_T,
    pub seq: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_u_header__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<u_header__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(u_header__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<u_header__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(u_header__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<u_header__bindgen_ty_1>())).ptr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(u_header__bindgen_ty_1),
            "::",
            stringify!(ptr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<u_header__bindgen_ty_1>())).seq as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(u_header__bindgen_ty_1),
            "::",
            stringify!(seq)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union u_header__bindgen_ty_2 {
    pub ptr: *mut u_header_T,
    pub seq: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_u_header__bindgen_ty_2() {
    assert_eq!(
        ::std::mem::size_of::<u_header__bindgen_ty_2>(),
        8usize,
        concat!("Size of: ", stringify!(u_header__bindgen_ty_2))
    );
    assert_eq!(
        ::std::mem::align_of::<u_header__bindgen_ty_2>(),
        8usize,
        concat!("Alignment of ", stringify!(u_header__bindgen_ty_2))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<u_header__bindgen_ty_2>())).ptr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(u_header__bindgen_ty_2),
            "::",
            stringify!(ptr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<u_header__bindgen_ty_2>())).seq as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(u_header__bindgen_ty_2),
            "::",
            stringify!(seq)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union u_header__bindgen_ty_3 {
    pub ptr: *mut u_header_T,
    pub seq: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_u_header__bindgen_ty_3() {
    assert_eq!(
        ::std::mem::size_of::<u_header__bindgen_ty_3>(),
        8usize,
        concat!("Size of: ", stringify!(u_header__bindgen_ty_3))
    );
    assert_eq!(
        ::std::mem::align_of::<u_header__bindgen_ty_3>(),
        8usize,
        concat!("Alignment of ", stringify!(u_header__bindgen_ty_3))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<u_header__bindgen_ty_3>())).ptr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(u_header__bindgen_ty_3),
            "::",
            stringify!(ptr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<u_header__bindgen_ty_3>())).seq as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(u_header__bindgen_ty_3),
            "::",
            stringify!(seq)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union u_header__bindgen_ty_4 {
    pub ptr: *mut u_header_T,
    pub seq: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_u_header__bindgen_ty_4() {
    assert_eq!(
        ::std::mem::size_of::<u_header__bindgen_ty_4>(),
        8usize,
        concat!("Size of: ", stringify!(u_header__bindgen_ty_4))
    );
    assert_eq!(
        ::std::mem::align_of::<u_header__bindgen_ty_4>(),
        8usize,
        concat!("Alignment of ", stringify!(u_header__bindgen_ty_4))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<u_header__bindgen_ty_4>())).ptr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(u_header__bindgen_ty_4),
            "::",
            stringify!(ptr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<u_header__bindgen_ty_4>())).seq as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(u_header__bindgen_ty_4),
            "::",
            stringify!(seq)
        )
    );
}
#[test]
fn bindgen_test_layout_u_header() {
    assert_eq!(
        ::std::mem::size_of::<u_header>(),
        568usize,
        concat!("Size of: ", stringify!(u_header))
    );
    assert_eq!(
        ::std::mem::align_of::<u_header>(),
        8usize,
        concat!("Alignment of ", stringify!(u_header))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<u_header>())).uh_next as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(u_header),
            "::",
            stringify!(uh_next)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<u_header>())).uh_prev as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(u_header),
            "::",
            stringify!(uh_prev)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<u_header>())).uh_alt_next as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(u_header),
            "::",
            stringify!(uh_alt_next)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<u_header>())).uh_alt_prev as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(u_header),
            "::",
            stringify!(uh_alt_prev)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<u_header>())).uh_seq as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(u_header),
            "::",
            stringify!(uh_seq)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<u_header>())).uh_walk as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(u_header),
            "::",
            stringify!(uh_walk)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<u_header>())).uh_entry as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(u_header),
            "::",
            stringify!(uh_entry)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<u_header>())).uh_getbot_entry as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(u_header),
            "::",
            stringify!(uh_getbot_entry)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<u_header>())).uh_cursor as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(u_header),
            "::",
            stringify!(uh_cursor)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<u_header>())).uh_cursor_vcol as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(u_header),
            "::",
            stringify!(uh_cursor_vcol)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<u_header>())).uh_flags as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(u_header),
            "::",
            stringify!(uh_flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<u_header>())).uh_namedm as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(u_header),
            "::",
            stringify!(uh_namedm)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<u_header>())).uh_visual as *const _ as usize },
        512usize,
        concat!(
            "Offset of field: ",
            stringify!(u_header),
            "::",
            stringify!(uh_visual)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<u_header>())).uh_time as *const _ as usize },
        552usize,
        concat!(
            "Offset of field: ",
            stringify!(u_header),
            "::",
            stringify!(uh_time)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<u_header>())).uh_save_nr as *const _ as usize },
        560usize,
        concat!(
            "Offset of field: ",
            stringify!(u_header),
            "::",
            stringify!(uh_save_nr)
        )
    );
}
pub type minfo_T = m_info;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct m_info {
    pub m_size: long_u,
    pub m_next: *mut minfo_T,
}
#[test]
fn bindgen_test_layout_m_info() {
    assert_eq!(
        ::std::mem::size_of::<m_info>(),
        16usize,
        concat!("Size of: ", stringify!(m_info))
    );
    assert_eq!(
        ::std::mem::align_of::<m_info>(),
        8usize,
        concat!("Alignment of ", stringify!(m_info))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m_info>())).m_size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(m_info),
            "::",
            stringify!(m_size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<m_info>())).m_next as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(m_info),
            "::",
            stringify!(m_next)
        )
    );
}
pub type bhdr_T = block_hdr;
pub type memfile_T = memfile;
pub type blocknr_T = ::std::os::raw::c_long;
pub type mf_hashitem_T = mf_hashitem_S;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mf_hashitem_S {
    pub mhi_next: *mut mf_hashitem_T,
    pub mhi_prev: *mut mf_hashitem_T,
    pub mhi_key: blocknr_T,
}
#[test]
fn bindgen_test_layout_mf_hashitem_S() {
    assert_eq!(
        ::std::mem::size_of::<mf_hashitem_S>(),
        24usize,
        concat!("Size of: ", stringify!(mf_hashitem_S))
    );
    assert_eq!(
        ::std::mem::align_of::<mf_hashitem_S>(),
        8usize,
        concat!("Alignment of ", stringify!(mf_hashitem_S))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<mf_hashitem_S>())).mhi_next as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(mf_hashitem_S),
            "::",
            stringify!(mhi_next)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<mf_hashitem_S>())).mhi_prev as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(mf_hashitem_S),
            "::",
            stringify!(mhi_prev)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<mf_hashitem_S>())).mhi_key as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(mf_hashitem_S),
            "::",
            stringify!(mhi_key)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mf_hashtab_S {
    pub mht_mask: long_u,
    pub mht_count: long_u,
    pub mht_buckets: *mut *mut mf_hashitem_T,
    pub mht_small_buckets: [*mut mf_hashitem_T; 64usize],
    pub mht_fixed: ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_mf_hashtab_S() {
    assert_eq!(
        ::std::mem::size_of::<mf_hashtab_S>(),
        544usize,
        concat!("Size of: ", stringify!(mf_hashtab_S))
    );
    assert_eq!(
        ::std::mem::align_of::<mf_hashtab_S>(),
        8usize,
        concat!("Alignment of ", stringify!(mf_hashtab_S))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<mf_hashtab_S>())).mht_mask as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(mf_hashtab_S),
            "::",
            stringify!(mht_mask)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<mf_hashtab_S>())).mht_count as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(mf_hashtab_S),
            "::",
            stringify!(mht_count)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<mf_hashtab_S>())).mht_buckets as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(mf_hashtab_S),
            "::",
            stringify!(mht_buckets)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<mf_hashtab_S>())).mht_small_buckets as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(mf_hashtab_S),
            "::",
            stringify!(mht_small_buckets)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<mf_hashtab_S>())).mht_fixed as *const _ as usize },
        536usize,
        concat!(
            "Offset of field: ",
            stringify!(mf_hashtab_S),
            "::",
            stringify!(mht_fixed)
        )
    );
}
pub type mf_hashtab_T = mf_hashtab_S;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct block_hdr {
    pub bh_hashitem: mf_hashitem_T,
    pub bh_next: *mut bhdr_T,
    pub bh_prev: *mut bhdr_T,
    pub bh_data: *mut char_u,
    pub bh_page_count: ::std::os::raw::c_int,
    pub bh_flags: ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_block_hdr() {
    assert_eq!(
        ::std::mem::size_of::<block_hdr>(),
        56usize,
        concat!("Size of: ", stringify!(block_hdr))
    );
    assert_eq!(
        ::std::mem::align_of::<block_hdr>(),
        8usize,
        concat!("Alignment of ", stringify!(block_hdr))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<block_hdr>())).bh_hashitem as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(block_hdr),
            "::",
            stringify!(bh_hashitem)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<block_hdr>())).bh_next as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(block_hdr),
            "::",
            stringify!(bh_next)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<block_hdr>())).bh_prev as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(block_hdr),
            "::",
            stringify!(bh_prev)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<block_hdr>())).bh_data as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(block_hdr),
            "::",
            stringify!(bh_data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<block_hdr>())).bh_page_count as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(block_hdr),
            "::",
            stringify!(bh_page_count)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<block_hdr>())).bh_flags as *const _ as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(block_hdr),
            "::",
            stringify!(bh_flags)
        )
    );
}
pub type NR_TRANS = nr_trans;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct nr_trans {
    pub nt_hashitem: mf_hashitem_T,
    pub nt_new_bnum: blocknr_T,
}
#[test]
fn bindgen_test_layout_nr_trans() {
    assert_eq!(
        ::std::mem::size_of::<nr_trans>(),
        32usize,
        concat!("Size of: ", stringify!(nr_trans))
    );
    assert_eq!(
        ::std::mem::align_of::<nr_trans>(),
        8usize,
        concat!("Alignment of ", stringify!(nr_trans))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nr_trans>())).nt_hashitem as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(nr_trans),
            "::",
            stringify!(nt_hashitem)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<nr_trans>())).nt_new_bnum as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(nr_trans),
            "::",
            stringify!(nt_new_bnum)
        )
    );
}
pub type buffblock_T = buffblock;
pub type buffheader_T = buffheader;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct buffblock {
    pub b_next: *mut buffblock_T,
    pub b_str: [char_u; 1usize],
}
#[test]
fn bindgen_test_layout_buffblock() {
    assert_eq!(
        ::std::mem::size_of::<buffblock>(),
        16usize,
        concat!("Size of: ", stringify!(buffblock))
    );
    assert_eq!(
        ::std::mem::align_of::<buffblock>(),
        8usize,
        concat!("Alignment of ", stringify!(buffblock))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<buffblock>())).b_next as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(buffblock),
            "::",
            stringify!(b_next)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<buffblock>())).b_str as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(buffblock),
            "::",
            stringify!(b_str)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct buffheader {
    pub bh_first: buffblock_T,
    pub bh_curr: *mut buffblock_T,
    pub bh_index: ::std::os::raw::c_int,
    pub bh_space: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_buffheader() {
    assert_eq!(
        ::std::mem::size_of::<buffheader>(),
        32usize,
        concat!("Size of: ", stringify!(buffheader))
    );
    assert_eq!(
        ::std::mem::align_of::<buffheader>(),
        8usize,
        concat!("Alignment of ", stringify!(buffheader))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<buffheader>())).bh_first as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(buffheader),
            "::",
            stringify!(bh_first)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<buffheader>())).bh_curr as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(buffheader),
            "::",
            stringify!(bh_curr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<buffheader>())).bh_index as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(buffheader),
            "::",
            stringify!(bh_index)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<buffheader>())).bh_space as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(buffheader),
            "::",
            stringify!(bh_space)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct save_redo_T {
    pub sr_redobuff: buffheader_T,
    pub sr_old_redobuff: buffheader_T,
}
#[test]
fn bindgen_test_layout_save_redo_T() {
    assert_eq!(
        ::std::mem::size_of::<save_redo_T>(),
        64usize,
        concat!("Size of: ", stringify!(save_redo_T))
    );
    assert_eq!(
        ::std::mem::align_of::<save_redo_T>(),
        8usize,
        concat!("Alignment of ", stringify!(save_redo_T))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<save_redo_T>())).sr_redobuff as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(save_redo_T),
            "::",
            stringify!(sr_redobuff)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<save_redo_T>())).sr_old_redobuff as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(save_redo_T),
            "::",
            stringify!(sr_old_redobuff)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct expand {
    pub xp_context: ::std::os::raw::c_int,
    pub xp_pattern: *mut char_u,
    pub xp_pattern_len: ::std::os::raw::c_int,
    pub xp_arg: *mut char_u,
    pub xp_script_ctx: sctx_T,
    pub xp_backslash: ::std::os::raw::c_int,
    pub xp_shell: ::std::os::raw::c_int,
    pub xp_numfiles: ::std::os::raw::c_int,
    pub xp_files: *mut *mut char_u,
    pub xp_line: *mut char_u,
    pub xp_col: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_expand() {
    assert_eq!(
        ::std::mem::size_of::<expand>(),
        96usize,
        concat!("Size of: ", stringify!(expand))
    );
    assert_eq!(
        ::std::mem::align_of::<expand>(),
        8usize,
        concat!("Alignment of ", stringify!(expand))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<expand>())).xp_context as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(expand),
            "::",
            stringify!(xp_context)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<expand>())).xp_pattern as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(expand),
            "::",
            stringify!(xp_pattern)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<expand>())).xp_pattern_len as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(expand),
            "::",
            stringify!(xp_pattern_len)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<expand>())).xp_arg as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(expand),
            "::",
            stringify!(xp_arg)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<expand>())).xp_script_ctx as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(expand),
            "::",
            stringify!(xp_script_ctx)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<expand>())).xp_backslash as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(expand),
            "::",
            stringify!(xp_backslash)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<expand>())).xp_shell as *const _ as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(expand),
            "::",
            stringify!(xp_shell)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<expand>())).xp_numfiles as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(expand),
            "::",
            stringify!(xp_numfiles)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<expand>())).xp_files as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(expand),
            "::",
            stringify!(xp_files)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<expand>())).xp_line as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(expand),
            "::",
            stringify!(xp_line)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<expand>())).xp_col as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(expand),
            "::",
            stringify!(xp_col)
        )
    );
}
pub type expand_T = expand;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cmdline_info {
    pub cmdbuff: *mut char_u,
    pub cmdbufflen: ::std::os::raw::c_int,
    pub cmdlen: ::std::os::raw::c_int,
    pub cmdpos: ::std::os::raw::c_int,
    pub cmdfirstc: ::std::os::raw::c_int,
    pub cmdindent: ::std::os::raw::c_int,
    pub cmdprompt: *mut char_u,
    pub cmdattr: ::std::os::raw::c_int,
    pub overstrike: ::std::os::raw::c_int,
    pub xpc: *mut expand_T,
    pub xp_context: ::std::os::raw::c_int,
    pub xp_arg: *mut char_u,
    pub input_fn: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_cmdline_info() {
    assert_eq!(
        ::std::mem::size_of::<cmdline_info>(),
        80usize,
        concat!("Size of: ", stringify!(cmdline_info))
    );
    assert_eq!(
        ::std::mem::align_of::<cmdline_info>(),
        8usize,
        concat!("Alignment of ", stringify!(cmdline_info))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cmdline_info>())).cmdbuff as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cmdline_info),
            "::",
            stringify!(cmdbuff)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cmdline_info>())).cmdbufflen as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(cmdline_info),
            "::",
            stringify!(cmdbufflen)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cmdline_info>())).cmdlen as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(cmdline_info),
            "::",
            stringify!(cmdlen)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cmdline_info>())).cmdpos as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(cmdline_info),
            "::",
            stringify!(cmdpos)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cmdline_info>())).cmdfirstc as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(cmdline_info),
            "::",
            stringify!(cmdfirstc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cmdline_info>())).cmdindent as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(cmdline_info),
            "::",
            stringify!(cmdindent)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cmdline_info>())).cmdprompt as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(cmdline_info),
            "::",
            stringify!(cmdprompt)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cmdline_info>())).cmdattr as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(cmdline_info),
            "::",
            stringify!(cmdattr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cmdline_info>())).overstrike as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(cmdline_info),
            "::",
            stringify!(overstrike)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cmdline_info>())).xpc as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(cmdline_info),
            "::",
            stringify!(xpc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cmdline_info>())).xp_context as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(cmdline_info),
            "::",
            stringify!(xp_context)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cmdline_info>())).xp_arg as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(cmdline_info),
            "::",
            stringify!(xp_arg)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cmdline_info>())).input_fn as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(cmdline_info),
            "::",
            stringify!(input_fn)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cmdmod_T {
    pub hide: ::std::os::raw::c_int,
    pub browse: ::std::os::raw::c_int,
    pub split: ::std::os::raw::c_int,
    pub tab: ::std::os::raw::c_int,
    pub keepalt: ::std::os::raw::c_int,
    pub keepmarks: ::std::os::raw::c_int,
    pub keepjumps: ::std::os::raw::c_int,
    pub lockmarks: ::std::os::raw::c_int,
    pub keeppatterns: ::std::os::raw::c_int,
    pub noswapfile: ::std::os::raw::c_int,
    pub save_ei: *mut char_u,
    pub filter_regmatch: regmatch_T,
    pub filter_force: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_cmdmod_T() {
    assert_eq!(
        ::std::mem::size_of::<cmdmod_T>(),
        232usize,
        concat!("Size of: ", stringify!(cmdmod_T))
    );
    assert_eq!(
        ::std::mem::align_of::<cmdmod_T>(),
        8usize,
        concat!("Alignment of ", stringify!(cmdmod_T))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cmdmod_T>())).hide as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cmdmod_T),
            "::",
            stringify!(hide)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cmdmod_T>())).browse as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(cmdmod_T),
            "::",
            stringify!(browse)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cmdmod_T>())).split as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(cmdmod_T),
            "::",
            stringify!(split)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cmdmod_T>())).tab as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(cmdmod_T),
            "::",
            stringify!(tab)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cmdmod_T>())).keepalt as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(cmdmod_T),
            "::",
            stringify!(keepalt)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cmdmod_T>())).keepmarks as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(cmdmod_T),
            "::",
            stringify!(keepmarks)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cmdmod_T>())).keepjumps as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(cmdmod_T),
            "::",
            stringify!(keepjumps)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cmdmod_T>())).lockmarks as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(cmdmod_T),
            "::",
            stringify!(lockmarks)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cmdmod_T>())).keeppatterns as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(cmdmod_T),
            "::",
            stringify!(keeppatterns)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cmdmod_T>())).noswapfile as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(cmdmod_T),
            "::",
            stringify!(noswapfile)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cmdmod_T>())).save_ei as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(cmdmod_T),
            "::",
            stringify!(save_ei)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cmdmod_T>())).filter_regmatch as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(cmdmod_T),
            "::",
            stringify!(filter_regmatch)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cmdmod_T>())).filter_force as *const _ as usize },
        224usize,
        concat!(
            "Offset of field: ",
            stringify!(cmdmod_T),
            "::",
            stringify!(filter_force)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct memfile {
    pub mf_fname: *mut char_u,
    pub mf_ffname: *mut char_u,
    pub mf_fd: ::std::os::raw::c_int,
    pub mf_flags: ::std::os::raw::c_int,
    pub mf_reopen: ::std::os::raw::c_int,
    pub mf_free_first: *mut bhdr_T,
    pub mf_used_first: *mut bhdr_T,
    pub mf_used_last: *mut bhdr_T,
    pub mf_used_count: ::std::os::raw::c_uint,
    pub mf_used_count_max: ::std::os::raw::c_uint,
    pub mf_hash: mf_hashtab_T,
    pub mf_trans: mf_hashtab_T,
    pub mf_blocknr_max: blocknr_T,
    pub mf_blocknr_min: blocknr_T,
    pub mf_neg_count: blocknr_T,
    pub mf_infile_count: blocknr_T,
    pub mf_page_size: ::std::os::raw::c_uint,
    pub mf_dirty: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_memfile() {
    assert_eq!(
        ::std::mem::size_of::<memfile>(),
        1192usize,
        concat!("Size of: ", stringify!(memfile))
    );
    assert_eq!(
        ::std::mem::align_of::<memfile>(),
        8usize,
        concat!("Alignment of ", stringify!(memfile))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<memfile>())).mf_fname as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(memfile),
            "::",
            stringify!(mf_fname)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<memfile>())).mf_ffname as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(memfile),
            "::",
            stringify!(mf_ffname)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<memfile>())).mf_fd as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(memfile),
            "::",
            stringify!(mf_fd)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<memfile>())).mf_flags as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(memfile),
            "::",
            stringify!(mf_flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<memfile>())).mf_reopen as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(memfile),
            "::",
            stringify!(mf_reopen)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<memfile>())).mf_free_first as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(memfile),
            "::",
            stringify!(mf_free_first)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<memfile>())).mf_used_first as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(memfile),
            "::",
            stringify!(mf_used_first)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<memfile>())).mf_used_last as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(memfile),
            "::",
            stringify!(mf_used_last)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<memfile>())).mf_used_count as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(memfile),
            "::",
            stringify!(mf_used_count)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<memfile>())).mf_used_count_max as *const _ as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(memfile),
            "::",
            stringify!(mf_used_count_max)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<memfile>())).mf_hash as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(memfile),
            "::",
            stringify!(mf_hash)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<memfile>())).mf_trans as *const _ as usize },
        608usize,
        concat!(
            "Offset of field: ",
            stringify!(memfile),
            "::",
            stringify!(mf_trans)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<memfile>())).mf_blocknr_max as *const _ as usize },
        1152usize,
        concat!(
            "Offset of field: ",
            stringify!(memfile),
            "::",
            stringify!(mf_blocknr_max)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<memfile>())).mf_blocknr_min as *const _ as usize },
        1160usize,
        concat!(
            "Offset of field: ",
            stringify!(memfile),
            "::",
            stringify!(mf_blocknr_min)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<memfile>())).mf_neg_count as *const _ as usize },
        1168usize,
        concat!(
            "Offset of field: ",
            stringify!(memfile),
            "::",
            stringify!(mf_neg_count)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<memfile>())).mf_infile_count as *const _ as usize },
        1176usize,
        concat!(
            "Offset of field: ",
            stringify!(memfile),
            "::",
            stringify!(mf_infile_count)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<memfile>())).mf_page_size as *const _ as usize },
        1184usize,
        concat!(
            "Offset of field: ",
            stringify!(memfile),
            "::",
            stringify!(mf_page_size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<memfile>())).mf_dirty as *const _ as usize },
        1188usize,
        concat!(
            "Offset of field: ",
            stringify!(memfile),
            "::",
            stringify!(mf_dirty)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct info_pointer {
    pub ip_bnum: blocknr_T,
    pub ip_low: linenr_T,
    pub ip_high: linenr_T,
    pub ip_index: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_info_pointer() {
    assert_eq!(
        ::std::mem::size_of::<info_pointer>(),
        32usize,
        concat!("Size of: ", stringify!(info_pointer))
    );
    assert_eq!(
        ::std::mem::align_of::<info_pointer>(),
        8usize,
        concat!("Alignment of ", stringify!(info_pointer))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<info_pointer>())).ip_bnum as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(info_pointer),
            "::",
            stringify!(ip_bnum)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<info_pointer>())).ip_low as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(info_pointer),
            "::",
            stringify!(ip_low)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<info_pointer>())).ip_high as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(info_pointer),
            "::",
            stringify!(ip_high)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<info_pointer>())).ip_index as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(info_pointer),
            "::",
            stringify!(ip_index)
        )
    );
}
pub type infoptr_T = info_pointer;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ml_chunksize {
    pub mlcs_numlines: ::std::os::raw::c_int,
    pub mlcs_totalsize: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_ml_chunksize() {
    assert_eq!(
        ::std::mem::size_of::<ml_chunksize>(),
        16usize,
        concat!("Size of: ", stringify!(ml_chunksize))
    );
    assert_eq!(
        ::std::mem::align_of::<ml_chunksize>(),
        8usize,
        concat!("Alignment of ", stringify!(ml_chunksize))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ml_chunksize>())).mlcs_numlines as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ml_chunksize),
            "::",
            stringify!(mlcs_numlines)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ml_chunksize>())).mlcs_totalsize as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ml_chunksize),
            "::",
            stringify!(mlcs_totalsize)
        )
    );
}
pub type chunksize_T = ml_chunksize;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct memline {
    pub ml_line_count: linenr_T,
    pub ml_mfp: *mut memfile_T,
    pub ml_flags: ::std::os::raw::c_int,
    pub ml_stack: *mut infoptr_T,
    pub ml_stack_top: ::std::os::raw::c_int,
    pub ml_stack_size: ::std::os::raw::c_int,
    pub ml_line_lnum: linenr_T,
    pub ml_line_ptr: *mut char_u,
    pub ml_line_len: colnr_T,
    pub ml_locked: *mut bhdr_T,
    pub ml_locked_low: linenr_T,
    pub ml_locked_high: linenr_T,
    pub ml_locked_lineadd: ::std::os::raw::c_int,
    pub ml_chunksize: *mut chunksize_T,
    pub ml_numchunks: ::std::os::raw::c_int,
    pub ml_usedchunks: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_memline() {
    assert_eq!(
        ::std::mem::size_of::<memline>(),
        112usize,
        concat!("Size of: ", stringify!(memline))
    );
    assert_eq!(
        ::std::mem::align_of::<memline>(),
        8usize,
        concat!("Alignment of ", stringify!(memline))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<memline>())).ml_line_count as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(memline),
            "::",
            stringify!(ml_line_count)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<memline>())).ml_mfp as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(memline),
            "::",
            stringify!(ml_mfp)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<memline>())).ml_flags as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(memline),
            "::",
            stringify!(ml_flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<memline>())).ml_stack as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(memline),
            "::",
            stringify!(ml_stack)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<memline>())).ml_stack_top as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(memline),
            "::",
            stringify!(ml_stack_top)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<memline>())).ml_stack_size as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(memline),
            "::",
            stringify!(ml_stack_size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<memline>())).ml_line_lnum as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(memline),
            "::",
            stringify!(ml_line_lnum)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<memline>())).ml_line_ptr as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(memline),
            "::",
            stringify!(ml_line_ptr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<memline>())).ml_line_len as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(memline),
            "::",
            stringify!(ml_line_len)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<memline>())).ml_locked as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(memline),
            "::",
            stringify!(ml_locked)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<memline>())).ml_locked_low as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(memline),
            "::",
            stringify!(ml_locked_low)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<memline>())).ml_locked_high as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(memline),
            "::",
            stringify!(ml_locked_high)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<memline>())).ml_locked_lineadd as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(memline),
            "::",
            stringify!(ml_locked_lineadd)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<memline>())).ml_chunksize as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(memline),
            "::",
            stringify!(ml_chunksize)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<memline>())).ml_numchunks as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(memline),
            "::",
            stringify!(ml_numchunks)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<memline>())).ml_usedchunks as *const _ as usize },
        108usize,
        concat!(
            "Offset of field: ",
            stringify!(memline),
            "::",
            stringify!(ml_usedchunks)
        )
    );
}
pub type memline_T = memline;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct textprop_S {
    pub tp_col: colnr_T,
    pub tp_len: colnr_T,
    pub tp_id: ::std::os::raw::c_int,
    pub tp_type: ::std::os::raw::c_int,
    pub tp_flags: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_textprop_S() {
    assert_eq!(
        ::std::mem::size_of::<textprop_S>(),
        20usize,
        concat!("Size of: ", stringify!(textprop_S))
    );
    assert_eq!(
        ::std::mem::align_of::<textprop_S>(),
        4usize,
        concat!("Alignment of ", stringify!(textprop_S))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<textprop_S>())).tp_col as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(textprop_S),
            "::",
            stringify!(tp_col)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<textprop_S>())).tp_len as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(textprop_S),
            "::",
            stringify!(tp_len)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<textprop_S>())).tp_id as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(textprop_S),
            "::",
            stringify!(tp_id)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<textprop_S>())).tp_type as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(textprop_S),
            "::",
            stringify!(tp_type)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<textprop_S>())).tp_flags as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(textprop_S),
            "::",
            stringify!(tp_flags)
        )
    );
}
pub type textprop_T = textprop_S;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct proptype_S {
    pub pt_id: ::std::os::raw::c_int,
    pub pt_type: ::std::os::raw::c_int,
    pub pt_hl_id: ::std::os::raw::c_int,
    pub pt_priority: ::std::os::raw::c_int,
    pub pt_flags: ::std::os::raw::c_int,
    pub pt_name: [char_u; 1usize],
}
#[test]
fn bindgen_test_layout_proptype_S() {
    assert_eq!(
        ::std::mem::size_of::<proptype_S>(),
        24usize,
        concat!("Size of: ", stringify!(proptype_S))
    );
    assert_eq!(
        ::std::mem::align_of::<proptype_S>(),
        4usize,
        concat!("Alignment of ", stringify!(proptype_S))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<proptype_S>())).pt_id as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(proptype_S),
            "::",
            stringify!(pt_id)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<proptype_S>())).pt_type as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(proptype_S),
            "::",
            stringify!(pt_type)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<proptype_S>())).pt_hl_id as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(proptype_S),
            "::",
            stringify!(pt_hl_id)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<proptype_S>())).pt_priority as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(proptype_S),
            "::",
            stringify!(pt_priority)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<proptype_S>())).pt_flags as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(proptype_S),
            "::",
            stringify!(pt_flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<proptype_S>())).pt_name as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(proptype_S),
            "::",
            stringify!(pt_name)
        )
    );
}
pub type proptype_T = proptype_S;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct signgroup_S {
    pub refcount: short_u,
    pub next_sign_id: ::std::os::raw::c_int,
    pub sg_name: [char_u; 1usize],
}
#[test]
fn bindgen_test_layout_signgroup_S() {
    assert_eq!(
        ::std::mem::size_of::<signgroup_S>(),
        12usize,
        concat!("Size of: ", stringify!(signgroup_S))
    );
    assert_eq!(
        ::std::mem::align_of::<signgroup_S>(),
        4usize,
        concat!("Alignment of ", stringify!(signgroup_S))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<signgroup_S>())).refcount as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(signgroup_S),
            "::",
            stringify!(refcount)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<signgroup_S>())).next_sign_id as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(signgroup_S),
            "::",
            stringify!(next_sign_id)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<signgroup_S>())).sg_name as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(signgroup_S),
            "::",
            stringify!(sg_name)
        )
    );
}
pub type signgroup_T = signgroup_S;
pub type signlist_T = signlist;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct signlist {
    pub id: ::std::os::raw::c_int,
    pub lnum: linenr_T,
    pub typenr: ::std::os::raw::c_int,
    pub group: *mut signgroup_T,
    pub priority: ::std::os::raw::c_int,
    pub next: *mut signlist_T,
    pub prev: *mut signlist_T,
}
#[test]
fn bindgen_test_layout_signlist() {
    assert_eq!(
        ::std::mem::size_of::<signlist>(),
        56usize,
        concat!("Size of: ", stringify!(signlist))
    );
    assert_eq!(
        ::std::mem::align_of::<signlist>(),
        8usize,
        concat!("Alignment of ", stringify!(signlist))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<signlist>())).id as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(signlist),
            "::",
            stringify!(id)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<signlist>())).lnum as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(signlist),
            "::",
            stringify!(lnum)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<signlist>())).typenr as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(signlist),
            "::",
            stringify!(typenr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<signlist>())).group as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(signlist),
            "::",
            stringify!(group)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<signlist>())).priority as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(signlist),
            "::",
            stringify!(priority)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<signlist>())).next as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(signlist),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<signlist>())).prev as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(signlist),
            "::",
            stringify!(prev)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct arglist {
    pub al_ga: garray_T,
    pub al_refcount: ::std::os::raw::c_int,
    pub id: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_arglist() {
    assert_eq!(
        ::std::mem::size_of::<arglist>(),
        32usize,
        concat!("Size of: ", stringify!(arglist))
    );
    assert_eq!(
        ::std::mem::align_of::<arglist>(),
        8usize,
        concat!("Alignment of ", stringify!(arglist))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<arglist>())).al_ga as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(arglist),
            "::",
            stringify!(al_ga)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<arglist>())).al_refcount as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(arglist),
            "::",
            stringify!(al_refcount)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<arglist>())).id as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(arglist),
            "::",
            stringify!(id)
        )
    );
}
pub type alist_T = arglist;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct argentry {
    pub ae_fname: *mut char_u,
    pub ae_fnum: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_argentry() {
    assert_eq!(
        ::std::mem::size_of::<argentry>(),
        16usize,
        concat!("Size of: ", stringify!(argentry))
    );
    assert_eq!(
        ::std::mem::align_of::<argentry>(),
        8usize,
        concat!("Alignment of ", stringify!(argentry))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<argentry>())).ae_fname as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(argentry),
            "::",
            stringify!(ae_fname)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<argentry>())).ae_fnum as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(argentry),
            "::",
            stringify!(ae_fnum)
        )
    );
}
pub type aentry_T = argentry;
pub type eslist_T = eslist_elem;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct eslist_elem {
    pub saved_emsg_silent: ::std::os::raw::c_int,
    pub next: *mut eslist_T,
}
#[test]
fn bindgen_test_layout_eslist_elem() {
    assert_eq!(
        ::std::mem::size_of::<eslist_elem>(),
        16usize,
        concat!("Size of: ", stringify!(eslist_elem))
    );
    assert_eq!(
        ::std::mem::align_of::<eslist_elem>(),
        8usize,
        concat!("Alignment of ", stringify!(eslist_elem))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<eslist_elem>())).saved_emsg_silent as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(eslist_elem),
            "::",
            stringify!(saved_emsg_silent)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<eslist_elem>())).next as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(eslist_elem),
            "::",
            stringify!(next)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct condstack {
    pub cs_flags: [::std::os::raw::c_short; 50usize],
    pub cs_pending: [::std::os::raw::c_char; 50usize],
    pub cs_pend: condstack__bindgen_ty_1,
    pub cs_forinfo: [*mut ::std::os::raw::c_void; 50usize],
    pub cs_line: [::std::os::raw::c_int; 50usize],
    pub cs_idx: ::std::os::raw::c_int,
    pub cs_looplevel: ::std::os::raw::c_int,
    pub cs_trylevel: ::std::os::raw::c_int,
    pub cs_emsg_silent_list: *mut eslist_T,
    pub cs_lflags: ::std::os::raw::c_char,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union condstack__bindgen_ty_1 {
    pub csp_rv: [*mut ::std::os::raw::c_void; 50usize],
    pub csp_ex: [*mut ::std::os::raw::c_void; 50usize],
}
#[test]
fn bindgen_test_layout_condstack__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<condstack__bindgen_ty_1>(),
        400usize,
        concat!("Size of: ", stringify!(condstack__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<condstack__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(condstack__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<condstack__bindgen_ty_1>())).csp_rv as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(condstack__bindgen_ty_1),
            "::",
            stringify!(csp_rv)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<condstack__bindgen_ty_1>())).csp_ex as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(condstack__bindgen_ty_1),
            "::",
            stringify!(csp_ex)
        )
    );
}
#[test]
fn bindgen_test_layout_condstack() {
    assert_eq!(
        ::std::mem::size_of::<condstack>(),
        1184usize,
        concat!("Size of: ", stringify!(condstack))
    );
    assert_eq!(
        ::std::mem::align_of::<condstack>(),
        8usize,
        concat!("Alignment of ", stringify!(condstack))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<condstack>())).cs_flags as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(condstack),
            "::",
            stringify!(cs_flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<condstack>())).cs_pending as *const _ as usize },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(condstack),
            "::",
            stringify!(cs_pending)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<condstack>())).cs_pend as *const _ as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(condstack),
            "::",
            stringify!(cs_pend)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<condstack>())).cs_forinfo as *const _ as usize },
        552usize,
        concat!(
            "Offset of field: ",
            stringify!(condstack),
            "::",
            stringify!(cs_forinfo)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<condstack>())).cs_line as *const _ as usize },
        952usize,
        concat!(
            "Offset of field: ",
            stringify!(condstack),
            "::",
            stringify!(cs_line)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<condstack>())).cs_idx as *const _ as usize },
        1152usize,
        concat!(
            "Offset of field: ",
            stringify!(condstack),
            "::",
            stringify!(cs_idx)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<condstack>())).cs_looplevel as *const _ as usize },
        1156usize,
        concat!(
            "Offset of field: ",
            stringify!(condstack),
            "::",
            stringify!(cs_looplevel)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<condstack>())).cs_trylevel as *const _ as usize },
        1160usize,
        concat!(
            "Offset of field: ",
            stringify!(condstack),
            "::",
            stringify!(cs_trylevel)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<condstack>())).cs_emsg_silent_list as *const _ as usize },
        1168usize,
        concat!(
            "Offset of field: ",
            stringify!(condstack),
            "::",
            stringify!(cs_emsg_silent_list)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<condstack>())).cs_lflags as *const _ as usize },
        1176usize,
        concat!(
            "Offset of field: ",
            stringify!(condstack),
            "::",
            stringify!(cs_lflags)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct msglist {
    pub msg: *mut ::std::os::raw::c_char,
    pub throw_msg: *mut ::std::os::raw::c_char,
    pub next: *mut msglist,
}
#[test]
fn bindgen_test_layout_msglist() {
    assert_eq!(
        ::std::mem::size_of::<msglist>(),
        24usize,
        concat!("Size of: ", stringify!(msglist))
    );
    assert_eq!(
        ::std::mem::align_of::<msglist>(),
        8usize,
        concat!("Alignment of ", stringify!(msglist))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<msglist>())).msg as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(msglist),
            "::",
            stringify!(msg)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<msglist>())).throw_msg as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(msglist),
            "::",
            stringify!(throw_msg)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<msglist>())).next as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(msglist),
            "::",
            stringify!(next)
        )
    );
}
pub const except_type_T_ET_USER: except_type_T = 0;
pub const except_type_T_ET_ERROR: except_type_T = 1;
pub const except_type_T_ET_INTERRUPT: except_type_T = 2;
pub type except_type_T = ::std::os::raw::c_uint;
pub type except_T = vim_exception;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vim_exception {
    pub type_: except_type_T,
    pub value: *mut ::std::os::raw::c_char,
    pub messages: *mut msglist,
    pub throw_name: *mut char_u,
    pub throw_lnum: linenr_T,
    pub caught: *mut except_T,
}
#[test]
fn bindgen_test_layout_vim_exception() {
    assert_eq!(
        ::std::mem::size_of::<vim_exception>(),
        48usize,
        concat!("Size of: ", stringify!(vim_exception))
    );
    assert_eq!(
        ::std::mem::align_of::<vim_exception>(),
        8usize,
        concat!("Alignment of ", stringify!(vim_exception))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<vim_exception>())).type_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vim_exception),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<vim_exception>())).value as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(vim_exception),
            "::",
            stringify!(value)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<vim_exception>())).messages as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(vim_exception),
            "::",
            stringify!(messages)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<vim_exception>())).throw_name as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(vim_exception),
            "::",
            stringify!(throw_name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<vim_exception>())).throw_lnum as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(vim_exception),
            "::",
            stringify!(throw_lnum)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<vim_exception>())).caught as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(vim_exception),
            "::",
            stringify!(caught)
        )
    );
}
pub type cleanup_T = cleanup_stuff;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cleanup_stuff {
    pub pending: ::std::os::raw::c_int,
    pub exception: *mut except_T,
}
#[test]
fn bindgen_test_layout_cleanup_stuff() {
    assert_eq!(
        ::std::mem::size_of::<cleanup_stuff>(),
        16usize,
        concat!("Size of: ", stringify!(cleanup_stuff))
    );
    assert_eq!(
        ::std::mem::align_of::<cleanup_stuff>(),
        8usize,
        concat!("Alignment of ", stringify!(cleanup_stuff))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cleanup_stuff>())).pending as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cleanup_stuff),
            "::",
            stringify!(pending)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cleanup_stuff>())).exception as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(cleanup_stuff),
            "::",
            stringify!(exception)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct attr_entry {
    pub ae_attr: ::std::os::raw::c_short,
    pub ae_u: attr_entry__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union attr_entry__bindgen_ty_1 {
    pub term: attr_entry__bindgen_ty_1__bindgen_ty_1,
    pub cterm: attr_entry__bindgen_ty_1__bindgen_ty_2,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct attr_entry__bindgen_ty_1__bindgen_ty_1 {
    pub start: *mut char_u,
    pub stop: *mut char_u,
}
#[test]
fn bindgen_test_layout_attr_entry__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<attr_entry__bindgen_ty_1__bindgen_ty_1>(),
        16usize,
        concat!(
            "Size of: ",
            stringify!(attr_entry__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<attr_entry__bindgen_ty_1__bindgen_ty_1>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(attr_entry__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<attr_entry__bindgen_ty_1__bindgen_ty_1>())).start as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(attr_entry__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(start)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<attr_entry__bindgen_ty_1__bindgen_ty_1>())).stop as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(attr_entry__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(stop)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct attr_entry__bindgen_ty_1__bindgen_ty_2 {
    pub fg_color: short_u,
    pub bg_color: short_u,
}
#[test]
fn bindgen_test_layout_attr_entry__bindgen_ty_1__bindgen_ty_2() {
    assert_eq!(
        ::std::mem::size_of::<attr_entry__bindgen_ty_1__bindgen_ty_2>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(attr_entry__bindgen_ty_1__bindgen_ty_2)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<attr_entry__bindgen_ty_1__bindgen_ty_2>(),
        2usize,
        concat!(
            "Alignment of ",
            stringify!(attr_entry__bindgen_ty_1__bindgen_ty_2)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<attr_entry__bindgen_ty_1__bindgen_ty_2>())).fg_color as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(attr_entry__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(fg_color)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<attr_entry__bindgen_ty_1__bindgen_ty_2>())).bg_color as *const _
                as usize
        },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(attr_entry__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(bg_color)
        )
    );
}
#[test]
fn bindgen_test_layout_attr_entry__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<attr_entry__bindgen_ty_1>(),
        16usize,
        concat!("Size of: ", stringify!(attr_entry__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<attr_entry__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(attr_entry__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<attr_entry__bindgen_ty_1>())).term as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(attr_entry__bindgen_ty_1),
            "::",
            stringify!(term)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<attr_entry__bindgen_ty_1>())).cterm as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(attr_entry__bindgen_ty_1),
            "::",
            stringify!(cterm)
        )
    );
}
#[test]
fn bindgen_test_layout_attr_entry() {
    assert_eq!(
        ::std::mem::size_of::<attr_entry>(),
        24usize,
        concat!("Size of: ", stringify!(attr_entry))
    );
    assert_eq!(
        ::std::mem::align_of::<attr_entry>(),
        8usize,
        concat!("Alignment of ", stringify!(attr_entry))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<attr_entry>())).ae_attr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(attr_entry),
            "::",
            stringify!(ae_attr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<attr_entry>())).ae_u as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(attr_entry),
            "::",
            stringify!(ae_u)
        )
    );
}
pub type attrentry_T = attr_entry;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct typebuf_T {
    pub tb_buf: *mut char_u,
    pub tb_noremap: *mut char_u,
    pub tb_buflen: ::std::os::raw::c_int,
    pub tb_off: ::std::os::raw::c_int,
    pub tb_len: ::std::os::raw::c_int,
    pub tb_maplen: ::std::os::raw::c_int,
    pub tb_silent: ::std::os::raw::c_int,
    pub tb_no_abbr_cnt: ::std::os::raw::c_int,
    pub tb_change_cnt: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_typebuf_T() {
    assert_eq!(
        ::std::mem::size_of::<typebuf_T>(),
        48usize,
        concat!("Size of: ", stringify!(typebuf_T))
    );
    assert_eq!(
        ::std::mem::align_of::<typebuf_T>(),
        8usize,
        concat!("Alignment of ", stringify!(typebuf_T))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<typebuf_T>())).tb_buf as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(typebuf_T),
            "::",
            stringify!(tb_buf)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<typebuf_T>())).tb_noremap as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(typebuf_T),
            "::",
            stringify!(tb_noremap)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<typebuf_T>())).tb_buflen as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(typebuf_T),
            "::",
            stringify!(tb_buflen)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<typebuf_T>())).tb_off as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(typebuf_T),
            "::",
            stringify!(tb_off)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<typebuf_T>())).tb_len as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(typebuf_T),
            "::",
            stringify!(tb_len)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<typebuf_T>())).tb_maplen as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(typebuf_T),
            "::",
            stringify!(tb_maplen)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<typebuf_T>())).tb_silent as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(typebuf_T),
            "::",
            stringify!(tb_silent)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<typebuf_T>())).tb_no_abbr_cnt as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(typebuf_T),
            "::",
            stringify!(tb_no_abbr_cnt)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<typebuf_T>())).tb_change_cnt as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(typebuf_T),
            "::",
            stringify!(tb_change_cnt)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tasave_T {
    pub save_typebuf: typebuf_T,
    pub typebuf_valid: ::std::os::raw::c_int,
    pub old_char: ::std::os::raw::c_int,
    pub old_mod_mask: ::std::os::raw::c_int,
    pub save_readbuf1: buffheader_T,
    pub save_readbuf2: buffheader_T,
}
#[test]
fn bindgen_test_layout_tasave_T() {
    assert_eq!(
        ::std::mem::size_of::<tasave_T>(),
        128usize,
        concat!("Size of: ", stringify!(tasave_T))
    );
    assert_eq!(
        ::std::mem::align_of::<tasave_T>(),
        8usize,
        concat!("Alignment of ", stringify!(tasave_T))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tasave_T>())).save_typebuf as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tasave_T),
            "::",
            stringify!(save_typebuf)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tasave_T>())).typebuf_valid as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(tasave_T),
            "::",
            stringify!(typebuf_valid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tasave_T>())).old_char as *const _ as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(tasave_T),
            "::",
            stringify!(old_char)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tasave_T>())).old_mod_mask as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(tasave_T),
            "::",
            stringify!(old_mod_mask)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tasave_T>())).save_readbuf1 as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(tasave_T),
            "::",
            stringify!(save_readbuf1)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tasave_T>())).save_readbuf2 as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(tasave_T),
            "::",
            stringify!(save_readbuf2)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vimconv_T {
    pub vc_type: ::std::os::raw::c_int,
    pub vc_factor: ::std::os::raw::c_int,
    pub vc_fail: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_vimconv_T() {
    assert_eq!(
        ::std::mem::size_of::<vimconv_T>(),
        12usize,
        concat!("Size of: ", stringify!(vimconv_T))
    );
    assert_eq!(
        ::std::mem::align_of::<vimconv_T>(),
        4usize,
        concat!("Alignment of ", stringify!(vimconv_T))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<vimconv_T>())).vc_type as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vimconv_T),
            "::",
            stringify!(vc_type)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<vimconv_T>())).vc_factor as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(vimconv_T),
            "::",
            stringify!(vc_factor)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<vimconv_T>())).vc_fail as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(vimconv_T),
            "::",
            stringify!(vc_fail)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vir_T {
    pub vir_line: *mut char_u,
    pub vir_fd: *mut FILE,
    pub vir_conv: vimconv_T,
    pub vir_version: ::std::os::raw::c_int,
    pub vir_barlines: garray_T,
}
#[test]
fn bindgen_test_layout_vir_T() {
    assert_eq!(
        ::std::mem::size_of::<vir_T>(),
        56usize,
        concat!("Size of: ", stringify!(vir_T))
    );
    assert_eq!(
        ::std::mem::align_of::<vir_T>(),
        8usize,
        concat!("Alignment of ", stringify!(vir_T))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<vir_T>())).vir_line as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vir_T),
            "::",
            stringify!(vir_line)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<vir_T>())).vir_fd as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(vir_T),
            "::",
            stringify!(vir_fd)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<vir_T>())).vir_conv as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(vir_T),
            "::",
            stringify!(vir_conv)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<vir_T>())).vir_version as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(vir_T),
            "::",
            stringify!(vir_version)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<vir_T>())).vir_barlines as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(vir_T),
            "::",
            stringify!(vir_barlines)
        )
    );
}
pub type mapblock_T = mapblock;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mapblock {
    pub m_next: *mut mapblock_T,
    pub m_keys: *mut char_u,
    pub m_orig_keys: *mut char_u,
    pub m_str: *mut char_u,
    pub m_orig_str: *mut char_u,
    pub m_keylen: ::std::os::raw::c_int,
    pub m_mode: ::std::os::raw::c_int,
    pub m_noremap: ::std::os::raw::c_int,
    pub m_silent: ::std::os::raw::c_char,
    pub m_nowait: ::std::os::raw::c_char,
    pub m_expr: ::std::os::raw::c_char,
    pub m_script_ctx: sctx_T,
}
#[test]
fn bindgen_test_layout_mapblock() {
    assert_eq!(
        ::std::mem::size_of::<mapblock>(),
        80usize,
        concat!("Size of: ", stringify!(mapblock))
    );
    assert_eq!(
        ::std::mem::align_of::<mapblock>(),
        8usize,
        concat!("Alignment of ", stringify!(mapblock))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<mapblock>())).m_next as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(mapblock),
            "::",
            stringify!(m_next)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<mapblock>())).m_keys as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(mapblock),
            "::",
            stringify!(m_keys)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<mapblock>())).m_orig_keys as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(mapblock),
            "::",
            stringify!(m_orig_keys)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<mapblock>())).m_str as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(mapblock),
            "::",
            stringify!(m_str)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<mapblock>())).m_orig_str as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(mapblock),
            "::",
            stringify!(m_orig_str)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<mapblock>())).m_keylen as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(mapblock),
            "::",
            stringify!(m_keylen)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<mapblock>())).m_mode as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(mapblock),
            "::",
            stringify!(m_mode)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<mapblock>())).m_noremap as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(mapblock),
            "::",
            stringify!(m_noremap)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<mapblock>())).m_silent as *const _ as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(mapblock),
            "::",
            stringify!(m_silent)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<mapblock>())).m_nowait as *const _ as usize },
        53usize,
        concat!(
            "Offset of field: ",
            stringify!(mapblock),
            "::",
            stringify!(m_nowait)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<mapblock>())).m_expr as *const _ as usize },
        54usize,
        concat!(
            "Offset of field: ",
            stringify!(mapblock),
            "::",
            stringify!(m_expr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<mapblock>())).m_script_ctx as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(mapblock),
            "::",
            stringify!(m_script_ctx)
        )
    );
}
pub type InputMapCallback = ::std::option::Option<unsafe extern "C" fn(mapping: *const mapblock_T)>;
pub type InputUnmapCallback = ::std::option::Option<
    unsafe extern "C" fn(mode: ::std::os::raw::c_int, orig_lhs: *const char_u),
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stl_hlrec {
    pub start: *mut char_u,
    pub userhl: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_stl_hlrec() {
    assert_eq!(
        ::std::mem::size_of::<stl_hlrec>(),
        16usize,
        concat!("Size of: ", stringify!(stl_hlrec))
    );
    assert_eq!(
        ::std::mem::align_of::<stl_hlrec>(),
        8usize,
        concat!("Alignment of ", stringify!(stl_hlrec))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<stl_hlrec>())).start as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(stl_hlrec),
            "::",
            stringify!(start)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<stl_hlrec>())).userhl as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(stl_hlrec),
            "::",
            stringify!(userhl)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct hashitem_S {
    pub hi_hash: long_u,
    pub hi_key: *mut char_u,
}
#[test]
fn bindgen_test_layout_hashitem_S() {
    assert_eq!(
        ::std::mem::size_of::<hashitem_S>(),
        16usize,
        concat!("Size of: ", stringify!(hashitem_S))
    );
    assert_eq!(
        ::std::mem::align_of::<hashitem_S>(),
        8usize,
        concat!("Alignment of ", stringify!(hashitem_S))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hashitem_S>())).hi_hash as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(hashitem_S),
            "::",
            stringify!(hi_hash)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hashitem_S>())).hi_key as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(hashitem_S),
            "::",
            stringify!(hi_key)
        )
    );
}
pub type hashitem_T = hashitem_S;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct hashtable_S {
    pub ht_mask: long_u,
    pub ht_used: long_u,
    pub ht_filled: long_u,
    pub ht_locked: ::std::os::raw::c_int,
    pub ht_error: ::std::os::raw::c_int,
    pub ht_array: *mut hashitem_T,
    pub ht_smallarray: [hashitem_T; 16usize],
}
#[test]
fn bindgen_test_layout_hashtable_S() {
    assert_eq!(
        ::std::mem::size_of::<hashtable_S>(),
        296usize,
        concat!("Size of: ", stringify!(hashtable_S))
    );
    assert_eq!(
        ::std::mem::align_of::<hashtable_S>(),
        8usize,
        concat!("Alignment of ", stringify!(hashtable_S))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hashtable_S>())).ht_mask as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(hashtable_S),
            "::",
            stringify!(ht_mask)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hashtable_S>())).ht_used as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(hashtable_S),
            "::",
            stringify!(ht_used)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hashtable_S>())).ht_filled as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(hashtable_S),
            "::",
            stringify!(ht_filled)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hashtable_S>())).ht_locked as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(hashtable_S),
            "::",
            stringify!(ht_locked)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hashtable_S>())).ht_error as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(hashtable_S),
            "::",
            stringify!(ht_error)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hashtable_S>())).ht_array as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(hashtable_S),
            "::",
            stringify!(ht_array)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hashtable_S>())).ht_smallarray as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(hashtable_S),
            "::",
            stringify!(ht_smallarray)
        )
    );
}
pub type hashtab_T = hashtable_S;
pub type hash_T = long_u;
pub type varnumber_T = ::std::os::raw::c_int;
pub type uvarnumber_T = ::std::os::raw::c_uint;
pub type float_T = f64;
pub type list_T = listvar_S;
pub type dict_T = dictvar_S;
pub type partial_T = partial_S;
pub type blob_T = blobvar_S;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct callback_T {
    pub cb_name: *mut char_u,
    pub cb_partial: *mut partial_T,
    pub cb_free_name: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_callback_T() {
    assert_eq!(
        ::std::mem::size_of::<callback_T>(),
        24usize,
        concat!("Size of: ", stringify!(callback_T))
    );
    assert_eq!(
        ::std::mem::align_of::<callback_T>(),
        8usize,
        concat!("Alignment of ", stringify!(callback_T))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<callback_T>())).cb_name as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(callback_T),
            "::",
            stringify!(cb_name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<callback_T>())).cb_partial as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(callback_T),
            "::",
            stringify!(cb_partial)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<callback_T>())).cb_free_name as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(callback_T),
            "::",
            stringify!(cb_free_name)
        )
    );
}
pub type job_T = jobvar_S;
pub type readq_T = readq_S;
pub type writeq_T = writeq_S;
pub type jsonq_T = jsonq_S;
pub type cbq_T = cbq_S;
pub type channel_T = channel_S;
pub const vartype_T_VAR_UNKNOWN: vartype_T = 0;
pub const vartype_T_VAR_NUMBER: vartype_T = 1;
pub const vartype_T_VAR_STRING: vartype_T = 2;
pub const vartype_T_VAR_FUNC: vartype_T = 3;
pub const vartype_T_VAR_PARTIAL: vartype_T = 4;
pub const vartype_T_VAR_LIST: vartype_T = 5;
pub const vartype_T_VAR_DICT: vartype_T = 6;
pub const vartype_T_VAR_FLOAT: vartype_T = 7;
pub const vartype_T_VAR_SPECIAL: vartype_T = 8;
pub const vartype_T_VAR_JOB: vartype_T = 9;
pub const vartype_T_VAR_CHANNEL: vartype_T = 10;
pub const vartype_T_VAR_BLOB: vartype_T = 11;
pub type vartype_T = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct typval_T {
    pub v_type: vartype_T,
    pub v_lock: ::std::os::raw::c_char,
    pub vval: typval_T__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union typval_T__bindgen_ty_1 {
    pub v_number: varnumber_T,
    pub v_string: *mut char_u,
    pub v_list: *mut list_T,
    pub v_dict: *mut dict_T,
    pub v_partial: *mut partial_T,
    pub v_blob: *mut blob_T,
}
#[test]
fn bindgen_test_layout_typval_T__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<typval_T__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(typval_T__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<typval_T__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(typval_T__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<typval_T__bindgen_ty_1>())).v_number as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(typval_T__bindgen_ty_1),
            "::",
            stringify!(v_number)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<typval_T__bindgen_ty_1>())).v_string as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(typval_T__bindgen_ty_1),
            "::",
            stringify!(v_string)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<typval_T__bindgen_ty_1>())).v_list as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(typval_T__bindgen_ty_1),
            "::",
            stringify!(v_list)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<typval_T__bindgen_ty_1>())).v_dict as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(typval_T__bindgen_ty_1),
            "::",
            stringify!(v_dict)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<typval_T__bindgen_ty_1>())).v_partial as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(typval_T__bindgen_ty_1),
            "::",
            stringify!(v_partial)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<typval_T__bindgen_ty_1>())).v_blob as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(typval_T__bindgen_ty_1),
            "::",
            stringify!(v_blob)
        )
    );
}
#[test]
fn bindgen_test_layout_typval_T() {
    assert_eq!(
        ::std::mem::size_of::<typval_T>(),
        16usize,
        concat!("Size of: ", stringify!(typval_T))
    );
    assert_eq!(
        ::std::mem::align_of::<typval_T>(),
        8usize,
        concat!("Alignment of ", stringify!(typval_T))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<typval_T>())).v_type as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(typval_T),
            "::",
            stringify!(v_type)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<typval_T>())).v_lock as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(typval_T),
            "::",
            stringify!(v_lock)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<typval_T>())).vval as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(typval_T),
            "::",
            stringify!(vval)
        )
    );
}
pub type listitem_T = listitem_S;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct listitem_S {
    pub li_next: *mut listitem_T,
    pub li_prev: *mut listitem_T,
    pub li_tv: typval_T,
}
#[test]
fn bindgen_test_layout_listitem_S() {
    assert_eq!(
        ::std::mem::size_of::<listitem_S>(),
        32usize,
        concat!("Size of: ", stringify!(listitem_S))
    );
    assert_eq!(
        ::std::mem::align_of::<listitem_S>(),
        8usize,
        concat!("Alignment of ", stringify!(listitem_S))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<listitem_S>())).li_next as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(listitem_S),
            "::",
            stringify!(li_next)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<listitem_S>())).li_prev as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(listitem_S),
            "::",
            stringify!(li_prev)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<listitem_S>())).li_tv as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(listitem_S),
            "::",
            stringify!(li_tv)
        )
    );
}
pub type listwatch_T = listwatch_S;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct listwatch_S {
    pub lw_item: *mut listitem_T,
    pub lw_next: *mut listwatch_T,
}
#[test]
fn bindgen_test_layout_listwatch_S() {
    assert_eq!(
        ::std::mem::size_of::<listwatch_S>(),
        16usize,
        concat!("Size of: ", stringify!(listwatch_S))
    );
    assert_eq!(
        ::std::mem::align_of::<listwatch_S>(),
        8usize,
        concat!("Alignment of ", stringify!(listwatch_S))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<listwatch_S>())).lw_item as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(listwatch_S),
            "::",
            stringify!(lw_item)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<listwatch_S>())).lw_next as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(listwatch_S),
            "::",
            stringify!(lw_next)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct listvar_S {
    pub lv_first: *mut listitem_T,
    pub lv_last: *mut listitem_T,
    pub lv_watch: *mut listwatch_T,
    pub lv_idx_item: *mut listitem_T,
    pub lv_copylist: *mut list_T,
    pub lv_used_next: *mut list_T,
    pub lv_used_prev: *mut list_T,
    pub lv_refcount: ::std::os::raw::c_int,
    pub lv_len: ::std::os::raw::c_int,
    pub lv_idx: ::std::os::raw::c_int,
    pub lv_copyID: ::std::os::raw::c_int,
    pub lv_lock: ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_listvar_S() {
    assert_eq!(
        ::std::mem::size_of::<listvar_S>(),
        80usize,
        concat!("Size of: ", stringify!(listvar_S))
    );
    assert_eq!(
        ::std::mem::align_of::<listvar_S>(),
        8usize,
        concat!("Alignment of ", stringify!(listvar_S))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<listvar_S>())).lv_first as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(listvar_S),
            "::",
            stringify!(lv_first)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<listvar_S>())).lv_last as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(listvar_S),
            "::",
            stringify!(lv_last)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<listvar_S>())).lv_watch as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(listvar_S),
            "::",
            stringify!(lv_watch)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<listvar_S>())).lv_idx_item as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(listvar_S),
            "::",
            stringify!(lv_idx_item)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<listvar_S>())).lv_copylist as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(listvar_S),
            "::",
            stringify!(lv_copylist)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<listvar_S>())).lv_used_next as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(listvar_S),
            "::",
            stringify!(lv_used_next)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<listvar_S>())).lv_used_prev as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(listvar_S),
            "::",
            stringify!(lv_used_prev)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<listvar_S>())).lv_refcount as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(listvar_S),
            "::",
            stringify!(lv_refcount)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<listvar_S>())).lv_len as *const _ as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(listvar_S),
            "::",
            stringify!(lv_len)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<listvar_S>())).lv_idx as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(listvar_S),
            "::",
            stringify!(lv_idx)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<listvar_S>())).lv_copyID as *const _ as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(listvar_S),
            "::",
            stringify!(lv_copyID)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<listvar_S>())).lv_lock as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(listvar_S),
            "::",
            stringify!(lv_lock)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct staticList10_T {
    pub sl_list: list_T,
    pub sl_items: [listitem_T; 10usize],
}
#[test]
fn bindgen_test_layout_staticList10_T() {
    assert_eq!(
        ::std::mem::size_of::<staticList10_T>(),
        400usize,
        concat!("Size of: ", stringify!(staticList10_T))
    );
    assert_eq!(
        ::std::mem::align_of::<staticList10_T>(),
        8usize,
        concat!("Alignment of ", stringify!(staticList10_T))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<staticList10_T>())).sl_list as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(staticList10_T),
            "::",
            stringify!(sl_list)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<staticList10_T>())).sl_items as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(staticList10_T),
            "::",
            stringify!(sl_items)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct dictitem_S {
    pub di_tv: typval_T,
    pub di_flags: char_u,
    pub di_key: [char_u; 1usize],
}
#[test]
fn bindgen_test_layout_dictitem_S() {
    assert_eq!(
        ::std::mem::size_of::<dictitem_S>(),
        24usize,
        concat!("Size of: ", stringify!(dictitem_S))
    );
    assert_eq!(
        ::std::mem::align_of::<dictitem_S>(),
        8usize,
        concat!("Alignment of ", stringify!(dictitem_S))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<dictitem_S>())).di_tv as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(dictitem_S),
            "::",
            stringify!(di_tv)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<dictitem_S>())).di_flags as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(dictitem_S),
            "::",
            stringify!(di_flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<dictitem_S>())).di_key as *const _ as usize },
        17usize,
        concat!(
            "Offset of field: ",
            stringify!(dictitem_S),
            "::",
            stringify!(di_key)
        )
    );
}
pub type dictitem_T = dictitem_S;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct dictitem16_S {
    pub di_tv: typval_T,
    pub di_flags: char_u,
    pub di_key: [char_u; 17usize],
}
#[test]
fn bindgen_test_layout_dictitem16_S() {
    assert_eq!(
        ::std::mem::size_of::<dictitem16_S>(),
        40usize,
        concat!("Size of: ", stringify!(dictitem16_S))
    );
    assert_eq!(
        ::std::mem::align_of::<dictitem16_S>(),
        8usize,
        concat!("Alignment of ", stringify!(dictitem16_S))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<dictitem16_S>())).di_tv as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(dictitem16_S),
            "::",
            stringify!(di_tv)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<dictitem16_S>())).di_flags as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(dictitem16_S),
            "::",
            stringify!(di_flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<dictitem16_S>())).di_key as *const _ as usize },
        17usize,
        concat!(
            "Offset of field: ",
            stringify!(dictitem16_S),
            "::",
            stringify!(di_key)
        )
    );
}
pub type dictitem16_T = dictitem16_S;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dictvar_S {
    pub dv_lock: ::std::os::raw::c_char,
    pub dv_scope: ::std::os::raw::c_char,
    pub dv_refcount: ::std::os::raw::c_int,
    pub dv_copyID: ::std::os::raw::c_int,
    pub dv_hashtab: hashtab_T,
    pub dv_copydict: *mut dict_T,
    pub dv_used_next: *mut dict_T,
    pub dv_used_prev: *mut dict_T,
}
#[test]
fn bindgen_test_layout_dictvar_S() {
    assert_eq!(
        ::std::mem::size_of::<dictvar_S>(),
        336usize,
        concat!("Size of: ", stringify!(dictvar_S))
    );
    assert_eq!(
        ::std::mem::align_of::<dictvar_S>(),
        8usize,
        concat!("Alignment of ", stringify!(dictvar_S))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<dictvar_S>())).dv_lock as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(dictvar_S),
            "::",
            stringify!(dv_lock)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<dictvar_S>())).dv_scope as *const _ as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(dictvar_S),
            "::",
            stringify!(dv_scope)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<dictvar_S>())).dv_refcount as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(dictvar_S),
            "::",
            stringify!(dv_refcount)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<dictvar_S>())).dv_copyID as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(dictvar_S),
            "::",
            stringify!(dv_copyID)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<dictvar_S>())).dv_hashtab as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(dictvar_S),
            "::",
            stringify!(dv_hashtab)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<dictvar_S>())).dv_copydict as *const _ as usize },
        312usize,
        concat!(
            "Offset of field: ",
            stringify!(dictvar_S),
            "::",
            stringify!(dv_copydict)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<dictvar_S>())).dv_used_next as *const _ as usize },
        320usize,
        concat!(
            "Offset of field: ",
            stringify!(dictvar_S),
            "::",
            stringify!(dv_used_next)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<dictvar_S>())).dv_used_prev as *const _ as usize },
        328usize,
        concat!(
            "Offset of field: ",
            stringify!(dictvar_S),
            "::",
            stringify!(dv_used_prev)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct blobvar_S {
    pub bv_ga: garray_T,
    pub bv_refcount: ::std::os::raw::c_int,
    pub bv_lock: ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_blobvar_S() {
    assert_eq!(
        ::std::mem::size_of::<blobvar_S>(),
        32usize,
        concat!("Size of: ", stringify!(blobvar_S))
    );
    assert_eq!(
        ::std::mem::align_of::<blobvar_S>(),
        8usize,
        concat!("Alignment of ", stringify!(blobvar_S))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<blobvar_S>())).bv_ga as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(blobvar_S),
            "::",
            stringify!(bv_ga)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<blobvar_S>())).bv_refcount as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(blobvar_S),
            "::",
            stringify!(bv_refcount)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<blobvar_S>())).bv_lock as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(blobvar_S),
            "::",
            stringify!(bv_lock)
        )
    );
}
pub type funccall_T = funccall_S;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ufunc_T {
    pub uf_varargs: ::std::os::raw::c_int,
    pub uf_flags: ::std::os::raw::c_int,
    pub uf_calls: ::std::os::raw::c_int,
    pub uf_cleared: ::std::os::raw::c_int,
    pub uf_args: garray_T,
    pub uf_def_args: garray_T,
    pub uf_lines: garray_T,
    pub uf_script_ctx: sctx_T,
    pub uf_refcount: ::std::os::raw::c_int,
    pub uf_scoped: *mut funccall_T,
    pub uf_name: [char_u; 1usize],
}
#[test]
fn bindgen_test_layout_ufunc_T() {
    assert_eq!(
        ::std::mem::size_of::<ufunc_T>(),
        136usize,
        concat!("Size of: ", stringify!(ufunc_T))
    );
    assert_eq!(
        ::std::mem::align_of::<ufunc_T>(),
        8usize,
        concat!("Alignment of ", stringify!(ufunc_T))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ufunc_T>())).uf_varargs as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ufunc_T),
            "::",
            stringify!(uf_varargs)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ufunc_T>())).uf_flags as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ufunc_T),
            "::",
            stringify!(uf_flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ufunc_T>())).uf_calls as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ufunc_T),
            "::",
            stringify!(uf_calls)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ufunc_T>())).uf_cleared as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ufunc_T),
            "::",
            stringify!(uf_cleared)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ufunc_T>())).uf_args as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ufunc_T),
            "::",
            stringify!(uf_args)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ufunc_T>())).uf_def_args as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(ufunc_T),
            "::",
            stringify!(uf_def_args)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ufunc_T>())).uf_lines as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(ufunc_T),
            "::",
            stringify!(uf_lines)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ufunc_T>())).uf_script_ctx as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(ufunc_T),
            "::",
            stringify!(uf_script_ctx)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ufunc_T>())).uf_refcount as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(ufunc_T),
            "::",
            stringify!(uf_refcount)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ufunc_T>())).uf_scoped as *const _ as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(ufunc_T),
            "::",
            stringify!(uf_scoped)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ufunc_T>())).uf_name as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(ufunc_T),
            "::",
            stringify!(uf_name)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct funccall_S {
    pub func: *mut ufunc_T,
    pub linenr: ::std::os::raw::c_int,
    pub returned: ::std::os::raw::c_int,
    pub fixvar: [funccall_S__bindgen_ty_1; 12usize],
    pub l_vars: dict_T,
    pub l_vars_var: dictitem_T,
    pub l_avars: dict_T,
    pub l_avars_var: dictitem_T,
    pub l_varlist: list_T,
    pub l_listitems: [listitem_T; 20usize],
    pub rettv: *mut typval_T,
    pub breakpoint: linenr_T,
    pub dbg_tick: ::std::os::raw::c_int,
    pub level: ::std::os::raw::c_int,
    pub caller: *mut funccall_T,
    pub fc_refcount: ::std::os::raw::c_int,
    pub fc_copyID: ::std::os::raw::c_int,
    pub fc_funcs: garray_T,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct funccall_S__bindgen_ty_1 {
    pub var: dictitem_T,
    pub room: [char_u; 20usize],
}
#[test]
fn bindgen_test_layout_funccall_S__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<funccall_S__bindgen_ty_1>(),
        48usize,
        concat!("Size of: ", stringify!(funccall_S__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<funccall_S__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(funccall_S__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<funccall_S__bindgen_ty_1>())).var as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(funccall_S__bindgen_ty_1),
            "::",
            stringify!(var)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<funccall_S__bindgen_ty_1>())).room as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(funccall_S__bindgen_ty_1),
            "::",
            stringify!(room)
        )
    );
}
#[test]
fn bindgen_test_layout_funccall_S() {
    assert_eq!(
        ::std::mem::size_of::<funccall_S>(),
        2096usize,
        concat!("Size of: ", stringify!(funccall_S))
    );
    assert_eq!(
        ::std::mem::align_of::<funccall_S>(),
        8usize,
        concat!("Alignment of ", stringify!(funccall_S))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<funccall_S>())).func as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(funccall_S),
            "::",
            stringify!(func)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<funccall_S>())).linenr as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(funccall_S),
            "::",
            stringify!(linenr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<funccall_S>())).returned as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(funccall_S),
            "::",
            stringify!(returned)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<funccall_S>())).fixvar as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(funccall_S),
            "::",
            stringify!(fixvar)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<funccall_S>())).l_vars as *const _ as usize },
        592usize,
        concat!(
            "Offset of field: ",
            stringify!(funccall_S),
            "::",
            stringify!(l_vars)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<funccall_S>())).l_vars_var as *const _ as usize },
        928usize,
        concat!(
            "Offset of field: ",
            stringify!(funccall_S),
            "::",
            stringify!(l_vars_var)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<funccall_S>())).l_avars as *const _ as usize },
        952usize,
        concat!(
            "Offset of field: ",
            stringify!(funccall_S),
            "::",
            stringify!(l_avars)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<funccall_S>())).l_avars_var as *const _ as usize },
        1288usize,
        concat!(
            "Offset of field: ",
            stringify!(funccall_S),
            "::",
            stringify!(l_avars_var)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<funccall_S>())).l_varlist as *const _ as usize },
        1312usize,
        concat!(
            "Offset of field: ",
            stringify!(funccall_S),
            "::",
            stringify!(l_varlist)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<funccall_S>())).l_listitems as *const _ as usize },
        1392usize,
        concat!(
            "Offset of field: ",
            stringify!(funccall_S),
            "::",
            stringify!(l_listitems)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<funccall_S>())).rettv as *const _ as usize },
        2032usize,
        concat!(
            "Offset of field: ",
            stringify!(funccall_S),
            "::",
            stringify!(rettv)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<funccall_S>())).breakpoint as *const _ as usize },
        2040usize,
        concat!(
            "Offset of field: ",
            stringify!(funccall_S),
            "::",
            stringify!(breakpoint)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<funccall_S>())).dbg_tick as *const _ as usize },
        2048usize,
        concat!(
            "Offset of field: ",
            stringify!(funccall_S),
            "::",
            stringify!(dbg_tick)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<funccall_S>())).level as *const _ as usize },
        2052usize,
        concat!(
            "Offset of field: ",
            stringify!(funccall_S),
            "::",
            stringify!(level)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<funccall_S>())).caller as *const _ as usize },
        2056usize,
        concat!(
            "Offset of field: ",
            stringify!(funccall_S),
            "::",
            stringify!(caller)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<funccall_S>())).fc_refcount as *const _ as usize },
        2064usize,
        concat!(
            "Offset of field: ",
            stringify!(funccall_S),
            "::",
            stringify!(fc_refcount)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<funccall_S>())).fc_copyID as *const _ as usize },
        2068usize,
        concat!(
            "Offset of field: ",
            stringify!(funccall_S),
            "::",
            stringify!(fc_copyID)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<funccall_S>())).fc_funcs as *const _ as usize },
        2072usize,
        concat!(
            "Offset of field: ",
            stringify!(funccall_S),
            "::",
            stringify!(fc_funcs)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct funcdict_T {
    pub fd_dict: *mut dict_T,
    pub fd_newkey: *mut char_u,
    pub fd_di: *mut dictitem_T,
}
#[test]
fn bindgen_test_layout_funcdict_T() {
    assert_eq!(
